{
    " Examining Patients ": [
        "Bend your knees.",
        "Breathe in as far as you can.",
        "Can I have a look at you?",
        "Can I just have you walk to the door and back?",
        "Can you bend both your knees?",
        "Can you bend over and touch your toes?",
        "Can you flex the hip?",
        "Can you flex the knee?",
        "Can you put your hands on your hips?",
        "Can you raise your arm a little?",
        "Can you take a deep breath and hold it?",
        "Can you try flexing the legs?",
        "Close your eyes and say ‘yes’ each time you feel me touching the skin of your legs.",
        "Could you bend down and touch your toes?",
        "Could you bend down as far as you can?",
        "Could you fix your eyes on the tip of this pen and keep your eyes on it?",
        "Could you give me your arm?",
        "Could you just hop on to the couch for a moment?",
        "Could you just look this way?",
        "Could you just take off your skirt for a second?",
        "Curl up.",
        "Drink this liquid now — I’ll be taking pictures of it as it goes down.",
        "Extend the knee, will you?",
        "First of all, you must lie down.",
        "First of all, I listen to your front and then your back.",
        "Grip my hand firmly.",
        "I just want to see you walking.",
        "I want to find out where your bad cough is coming from.",
        "I want to test how well you can feel things on the skin.",
        "I want you to keep this thing under your tongue until I remove it.",
        "I want you to lie down with your legs stretched out in front of you.",
        "I want you to push as hard as you can against my hand.",
        "I’d just like to check your reflexes.",
        "I’d just like to examine your mouth.",
        "I’d just like to take the pulse.",
        "I’d just like to take the temperature.",
        "I’d like to feel your neck and under your arms.",
        "I’d like to have a sample of your water.",
        "I’d like to observe your chest while you’re breathing.",
        "I’d like to run some tests.",
        "I’d like to see your tummy.",
        "I’d like to take a blood sample.",
        "I’d like you to kneel on that straight-backed chair.",
        "I’ll have to extract a tooth.",
        "I’ll just check your blood pressure.",
        "I’ll just feel your stomach here.",
        "I’ll just take your blood pressure.",
        "I’ll just take your pulse.",
        "I’ll touch the back of your hand with it now.",
        "I’m going to fill the tooth.",
        "I’m going to give a local anaesthetic, so it won’t be painful.",
        "I’m going to give an eye test.",
        "I’m going to give you an injection of local anaesthetic.",
        "I’m going to inspect the base of the tongue.",
        "I’m going to inspect the ear.",
        "I’m going to inspect the tonsils.",
        "I’m going to listen to your chest.",
        "I’m going to press this vibrating fork on the ankle bone.",
        "I’m going to remove the needle from your chest.",
        "I’m going to stroke the sole of your foot with this key.",
        "I’m going to tap your feet behind your heel with this hammer.",
        "I’m going to test your reflexes.",
        "I’m going to test your reflexes by tapping you with this little hammer.",
        "I’m going to wash the area with a bit of antiseptic.",
        "I’m just going to find out where the soft spot is.",
        "I’m just going to press behind your knee.",
        "I’m now going to test the pulses in your legs.",
        "I’m trying to check the throat for any congestion.",
        "I’m trying to check the throat for any growth.",
        "I’m trying to identify the heart sound.",
        "I’d like to test your hearing.",
        "Is there any discharge?",
        "Just breathe normally — I want to listen to your heart.",
        "Just hold out your arms for a second.",
        "Just keep your arms straight there.",
        "Just slip off your pants, will you?",
        "Keep the knee straight.",
        "Keep your head still.",
        "Keep your knees and feet steady.",
        "Let me see you standing.",
        "Let’s check the baby’s weight and height.",
        "Lie on the bench.",
        "Lie on your left side.",
        "Lie on your right side.",
        "Lie on your tummy.",
        "Lie still.",
        "Lift it up as far as you can go, will you?",
        "Look downwards, will you?",
        "Look straight ahead, will you?",
        "Now blow the air out and hold it.",
        "Now I just want to see you standing.",
        "Now I’ll take your pressure.",
        "Now I want you to move right to the edge of the bed.",
        "Now I would like you to lean backwards.",
        "Now I’ll take a sample of your blood to check your haemoglobin.",
        "Now I’m going to lift your thigh off the couch.",
        "Now I’m going to put this thing on your chest.",
        "Now I’m going to raise your leg off the couch.",
        "Now I’m going to take your left leg and see how far we can lift it.",
        "Now I’m going to take your right arm and see how far we can raise it.",
        "Now I’m going to tap your leg.",
        "(To a pregnant lady) Now if you’d like to lie down on the couch, I’ll take a look at the baby.",
        "Now let’s see what happens if I bend your toes back.",
        "Now let’s see what happens when we straighten your leg again.",
        "Now we’ll put you onto the table there.",
        "Now would you like to sit up?",
        "Now would you roll over onto your tummy?",
        "Open your mouth.",
        "Open your mouth — I want to pass this little tube down into your tummy.",
        "Place your hands on your back.",
        "Put the thermometer under your tongue.",
        "Put your head down.",
        "Put your head right down to meet your knees.",
        "Put your tongue out.",
        "Remove your sock and shoe.",
        "Remove your top clothing.",
        "Roll over on to your left side.",
        "Roll your sleeves up.",
        "Say ‘Aah...’",
        "Show me where the problem is.",
        "Show me where you get most pain.",
        "Sit forward.",
        "Squat down, please.",
        "Stand up.",
        "Take a deep breath in and out.",
        "Take your right heel and run it down the front of your left leg.",
        "Tell me whether you feel it vibrating.",
        "There doesn’t seem anything wrong with you.",
        "There’s a little infection.",
        "This is a common condition, and it should clear up in a day or two.",
        "This may be a bit uncomfortable.",
        "This must be because of an emotional upset.",
        "Tilt your head back.",
        "Try to keep as still as you possibly can.",
        "Turn over and lie on your back.",
        "Turn your head this way.",
        "Want to lie down?",
        "We need to get your chest X-rayed.",
        "We’ll have to take an x-ray.",
        "We’ll have to clean out the filling.",
        "We’ll put a dressing over that area.",
        "We’ll take some X-ray pictures now.",
        "We’re going to put a little needle in your back.",
        "Will you lie on the bed a minute?",
        "Would you like to get onto the couch and lie on your back, please?",
        "Would a glass of water help?",
        "Would you like a glass of water?",
        "Would you like to lie down?",
        "Would you like to lie flat on the couch for a moment?",
        "Would you like to step into the next room and slip off your top things, please?",
        "Would you open your mouth wide?",
        "Would you remove your shirt?",
        "Would you roll onto your left side and bend your knees up?",
        "Would you strip to the waist, please?",
        "You must get X-rays of your shoulder taken.",
        "You must have your teeth tested yearly.",
        "Your gums are very sore.",
        "Your health is good.",
        "Your resistance is down.",
        "Are you nervous or anxious about anything?",
        "Are you selfconscious?",
        "Are you sometimes over-emotional?",
        "Are you fidgety?",
        "Are you jittery?",
        "Do people think of you as a happygo- lucky person or perhaps rather gloomy and unhappy?",
        "Do you dislike being told what to do?",
        "Do you always follow a set routine?",
        "Do you tend to rely on other people a great deal?",
        "Do you think people like you generally?",
        "Do you trust people?",
        "Do you ever tend to check things more than once or twice?",
        "Do you always feel agitated or only some of the time?",
        "Do you feel controlled from outside like a puppet or a robot?",
        "Do you find it difficult to cope with the demands of everyday life?",
        "Do you remember what day of the week it is?",
        "Do you sometime feel like hurting people?",
        "Do you prefer things to be neat and tidy?",
        "Do you sometimes feel picked upon?"
    ],
    " Diagnosis/treatment ": [
        "Are you allergic to any medications?",
        "Are you allergic to penicillin?",
        "Are you taking any medicine at the moment?",
        "Be careful about eating.",
        "Cover yourself with a blanket.",
        "Do not drink alcohol.",
        "Do not drive after taking this medication.",
        "Do not eat for half an hour before or after taking this medicine.",
        "Do not operate heavy machinery while taking this medication.",
        "Do these exercises preferably on an empty stomach.",
        "Don’t sit up to eat.",
        "Don’t take this medicine more than four times within a 24-hour period.",
        "Don’t worry. It’s only a small bruise.",
        "Drinking some coffee will help it.",
        "Drop in and see me again in about a month’s time.",
        "Have an X-ray of your shoulder and back.",
        "Here is a prescription for some tablets.",
        "I can’t find anything seriously wrong with you.",
        "I think we’ll ask someone at the Medical College to have a look at you.",
        "I think you don’t get enough exercise.",
        "I think you suffer from a minor heart condition.",
        "I’ll give something to calm you down.",
        "I’ll let you know the results as soon as I get them.",
        "I’m going to give (you) something to relieve the pain.",
        "I’m going to give you a prescription.",
        "I’m going to give you something for it.",
        "I’m going to give you something for the pain.",
        "I’m going to refer you to someone else.",
        "I’m going to write you a prescription.",
        "It all points to TB.",
        "It’ll be some weeks before you can go back to your kind of active work.",
        "It’ll get better of its own accord.",
        "Lying down for some time will help it.",
        "One tablet three times daily.",
        "One teaspoon daily.",
        "One teaspoon three times daily.",
        "Resting a while will help it.",
        "Stay in bed for a day.",
        "Take after eating.",
        "Take as needed.",
        "Take before eating.",
        "Take before going to bed.",
        "Take four times daily.",
        "Take in the morning.",
        "Take two aspirin, and call me in the morning.",
        "Take two of the pills each morning for two weeks.",
        "The main cause of it is smoking.",
        "The tooth must be extracted.",
        "This isn’t a frightening condition or anything.",
        "This isn’t a serious injury.",
        "This medication should be taken with food.",
        "This medication should be taken with meals.",
        "This medicine should clear up the trouble.",
        "This needs an incision to let out the pus.",
        "This will clear up on its own.",
        "Try to bend your knees and keep your back straight.",
        "Try to roll over and then get up from your side.",
        "Try to take them after food/meals, in case they cause you indigestion.",
        "Two capsules three times daily.",
        "Want some aspirin?",
        "We must dress your wounds.",
        "We’ll get the physiotherapist to organize some exercises to strengthen those muscles.",
        "We’ll give something to calm you down.",
        "We’ll give you some tablet(s) to ease the pain in your muscles.",
        "We’ll have to do an X-ray.",
        "We’ll have to take an X-ray.",
        "We’ll have to change the bandage on the wound every day.",
        "We’ll send these samples off to be tested.",
        "Well, I can’t see anything wrong here.",
        "Well, I don’t think there’s anything to worry about.",
        "Well, try these tablets for two weeks and see how you get on.",
        "Would you like some aspirin?",
        "You’re in excellent health.",
        "You’re physically fit.",
        "You are to take the tablets every six hours.",
        "You can take the tablets if you are awake with pain.",
        "You can take them during night.",
        "You have to cut the cigarettes down.",
        "You must rest, and allow this swelling to go down.",
        "You must take the pills every three hours.",
        "You need to go on a diet.",
        "You need to relax.",
        "You should also try to have your meals lying down.",
        "You should avoid lifting weights.",
        "You should be careful while getting out of bed.",
        "You should do these exercises daily.",
        "You should lie on a hard surface.",
        "You should try and avoid bending forward.",
        "You should try to avoid jerking your body.",
        "You should try to do them as slowly and smoothly as possible.",
        "You should walk briskly for half an hour every day to keep fit.",
        "You’ll have to get in shape and stay that way.",
        "Your leg has to be kept in plaster."
    ]
}