{
    " Group 1 ": [
        "He accepts problems like these as part of the day-to-day life.",
        "The suspect could not account for his fingerprints on the glass.",
        "They accused him of theft.",
        "Everybody acknowledges her as an expert in this subject.",
        "The transport strike added to our difficulties.",
        "She found it difficult to adjust to the new environment.",
        "He admitted to the forgery.",
        "They advanced some money to him.",
        "Let’s agree on a date.",
        "They agreed to my suggestion.",
        "I can’t agree with that argument.",
        "They agreed with each other.",
        "They advanced some money to him.",
        "He aimed at the target and shot.",
        "They aimed the remarks at us.",
        "He always aims for excellence.",
        "When you work out the cost, you should allow for wastage.",
        "The profits amount to a million or so.",
        "The government has appealed for donations to the famine relief fund.",
        "They appealed to everybody for help.",
        "Have you applied for that job?",
        "They appointed him (as) general manager.",
        "They are arguing about the expenses.",
        "Don’t argue with your boss.",
        "They argued with each other.",
        "Have you arranged a place for him to stay?",
        "When did they arrive at the airport?",
        "They’ve asked for some more time.",
        "Could I ask a favour of you?",
        "She doesn’t like him associating with those people.",
        "There was only a nurse to attend to the injured.",
        "The judge awarded damages to them.",
        "Many women find it difficult to balance family life and career with each other.",
        "These needs won’t balance with one another.",
        "Do you believe in God?",
        "This chair belongs in that room.",
        "These books belong on that shelf.",
        "These things don’t belong to me.",
        "Don’t bet on the result.",
        "They blamed me for the delay.",
        "Can you book a ticket for me?",
        "He wanted to borrow some money from them.",
        "Don’t bother about them – you carry on with your work.",
        "She branded him as a hypocrite.",
        "They branded him as work-shy.",
        "He forgot to bring a present for her.",
        "This business brings a lot of income to him.",
        "The cat brushed against her leg.",
        "He offered to build a house for them for Rs. 10 lakhs.",
        "He was burning with anger.",
        "She burst into tears.",
        "He’s gone to buy a new dress for her.",
        "He called for her and took her in his car.",
        "I called on them on my way from work.",
        "The news came as a shock to us.",
        "There’s a nurse to care for their grandmother.",
        "The bank refused to cash a cheque for them.",
        "Doctors certified the cause of death as heart attack or something.",
        "She then changed into her evening dress and got ready to go for the party.",
        "The colour changed to green for a few seconds.",
        "She characterized him as crazy.",
        "They charged him with murder.",
        "They chased (after) the purse snatcher.",
        "The nurse came to check (on) the patients.",
        "He chose her as his secretary.",
        "These colours clash with one another.",
        "These two groups are always clashing with each other.",
        "He classed them as advanced learners.",
        "He climbed on(to) the roof.",
        "She climbed (up) the stairs.",
        "These two events coincide with each other.",
        "Their interests coincide with one another.",
        "Business and pleasure don’t combine with each other too well.",
        "These factors combined with one another, and the result was terrible.",
        "I don’t want to comment on that issue.",
        "They don’t communicate with each other.",
        "Most of them communicate with one another by e-mail.",
        "They compared her words with those of Tolstoy’s.",
        "They compete with one another to perform better.",
        "She had to compete (against) the national champion in the race.",
        "They had to compete (with) five other companies for the contract.",
        " They competed with each other to get the contract.",
        " They competed against each other to get the contract.",
        " They complained of police brutality.",
        " They complained about police brutality.",
        "He found it difficult to concentrate on his work.",
        "How can you condemn them as spies?",
        "He condemned the product as substandard.",
        "His beliefs conflict with hers.",
        "Most of these ideas conflict with one another.",
        "They congratulated him on his achievement.",
        "We consider him as an authority.",
        "His farm consists of 14 acres.",
        "They never consult with one another about anything.",
        "They consulted with each other before taking the decision.",
        "What he says and what he does contrast with each other.",
        "His behavior contrasts sharply with hers.",
        "This is the first time I’ve contributed to charity.",
        "The judge convicted them of robbery.",
        "They could not convince the judge of their innocence.",
        "Can you cook lunch for them?",
        "They refused to co-operate with the police.",
        "Don’t count on them to support you.",
        "He was a learner driver, and he crashed into a lamp post.",
        "He crossed (over) the river.",
        "She cut a few slices for me.",
        "You should deal one more card to him.",
        "He has no experience of dealing with angry customers.",
        "She decided on a blue dress for the wedding.",
        "She defines friendship as love.",
        "We shouldn’t deny good education to anyone.",
        "You can depend on him.",
        "Everything depends on the circumstances.",
        "She described him as a nice person.",
        "She described their action as unfair.",
        "They asked him to design a building for them.",
        "Don’t let these differences of opinion develop into a long and bitter quarrel.",
        "The doctor has diagnosed the illness as pneumonia.",
        "It was a serious accident, and he died from his injuries.",
        "He died of pneumonia.",
        "The committee members disagree with one another.",
        "She disagreed with the suggestion.",
        "You have to learn to distinguish (between) facts and opinions.",
        "He dived into the river.",
        "The book is divided into 4 sections.",
        "She often dreams of being a great novelist.",
        " I dreamt about a beautiful bird.",
        " I dreamt of a beautiful bird.",
        "They elected him as president.",
        "The argument ended in tears.",
        "The notice ends with a sort of warning.",
        "She has entered (for) the competition.",
        "They’ve entered into a new agreement with their suppliers.",
        "They envied her for her success.",
        "It’s not easy to establish the allegations as false.",
        "He has himself established as a leading lawyer.",
        "They excused him for arriving late.",
        "Can you explain the rules to us?",
        "Many insects feed on flowers.",
        "She sat there feeding breadcrumbs to birds.",
        "Go and fetch a doctor for her.",
        "He fights with his wife over small matters.",
        "They’ve been trying to find a house for their new boss.",
        "She has fixed an appointment for her boss.",
        "They forgave him for insulting them.",
        "He forwarded the report to the Head Office.",
        "Our soldiers sprang into action and fought against the enemy forces.",
        "They gave him some money as a reward.",
        "Can you get a copy for me?",
        "Get into the car.",
        "I saw her getting out of the taxi.",
        " And then she got on(to) the bus",
        " And then she got on(to) the train",
        " Get on(to) the bike",
        " Get on(to) the horse",
        "You should give another chance to him.",
        "Their bank granted a loan to them.",
        "He was just a small-time actor, but he’s now grown into a superstar and a celebrity.",
        "It’s impossible to guarantee jobs for everyone.",
        "The postman handed a letter to her.",
        "I haven’t heard from him for about three months now.",
        "I’ve heard of a person who is an expert at this sort of jobs.",
        "She hesitated to accept the present.",
        "He was hinting at a possibility like that.",
        "They were hoping for lenience.",
        "The police have identified the hijacker as a notorious terrorist.",
        "They keep on improving on their achievements.",
        " They haven’t informed us about their plans yet.",
        " They haven’t informed us of their plans yet.",
        "They insist on a very high standard.",
        "He insisted on going with them.",
        "You should insure against accidental injury.",
        "She intended the remark as a joke.",
        "Can I interest you in our washing powder?",
        "These phone calls interfere with my work.",
        "They interpret what happened as a defeat.",
        "Let me introduce you to my business partner.",
        "I don’t plan to invest in property.",
        "He jumped (over) the wall.",
        "Don’t eat them all. Keep a few for him.",
        "They labelled him as a crook and liar.",
        "They labelled him as corrupt.",
        "You’ll laugh about all this one day.",
        "Don’t laugh at them.",
        "Spending money like this can lead to financial difficulties.",
        "He leapt (over) the fence.",
        " How did you learn of what happened there?",
        " How did you learn about what happened there?",
        "He refused to lease the building (out) to them.",
        "You should leave her to make up her own mind.",
        "He’s decided to leave all his money to charity.",
        "Why don’t you leave a note for him?",
        "She didn’t want to lend the book to him.",
        "I enjoy listening to music.",
        " Listen to him he’s saying.",
        " Listen to what he’s saying.",
        "It’s very difficult to live on such a small income.",
        "He never loans money to anybody.",
        "She longed for a letter from him.",
        "We need somebody to look after the kids.",
        "Look at this picture.",
        "They look on him as a model teacher.",
        "The children longed for the Christmas holidays.",
        "They looked for her purse everywhere, but couldn’t find it.",
        "I just mailed a letter to her.",
        "Can you make coffee for them?",
        "Butter is made from milk.",
        "His new film has made him into a celebrity.",
        "These bags are made of leather.",
        "He made a toy car out of wood.",
        "They mistook him for our boss.",
        "Oil and water don’t mix with each other.",
        "That’s a unique colour. Did anybody mix it for you?",
        "People here don’t like mixing with one another.",
        "They named the baby as Rupa.",
        "He objected to the new proposal.",
        "They’ve offered a job to him.",
        "Dr. John has to operate on two patients today.",
        "He opted for a teaching career.",
        "He ordered lunch for everybody.",
        "We owe some more money to them.",
        " Have you paid for the takeaway + (= a meal that you buy at a restaurant, but eaten somewhere else)?",
        " Have you paid for the takeout + (= a meal that you buy at a restaurant, but eaten somewhere else)?",
        "They haven’t paid the repair charges to them.",
        "He painted a picture for me.",
        "Please pass this paper to him.",
        "They’ll make you pay for your rudeness.",
        "Pay attention to the teacher.",
        "I wanted to pick a few flowers for her.",
        "You should try and persuade her of your serious intentions.",
        "We’re planning for about 100 guests.",
        "I hadn’t planned on buying a car so soon.",
        "We may have to play (against) that team.",
        "The children were playing at being robbers.",
        "Can you play that CD for me?",
        "He played a catchy tune to me on his violin.",
        "They plotted against the President.",
        "He posed as a police officer and cheated us.",
        "Don’t forget to post the letter to her.",
        "Pour the coffee for everybody, will you?",
        "Let’s pray for rain.",
        "He’s prepared a report for the boss.",
        "They pretended to like him.",
        "Nothing prevents you from resigning.",
        " They must have profited by these sales.",
        " They must have profited from these sales.",
        "They’ve promised to help us.",
        "They protected us from every danger.",
        "He works hard and provides for his family.",
        "If you steal money, they’ll punish you for it.",
        "Our team has qualified for the finals.",
        "She quarrelled with him about the money.",
        "He and his wife are always quarrelling with each other.",
        "He quoted a few instances to me.",
        "I ran into + (= met) an old friend at the supermarket today.",
        "They rate him as their most valuable employee.",
        "The workers reacted against the management’s decision.",
        "I read about it in today’s paper.",
        "She read a story to the children.",
        "We regard him as a fine teacher.",
        "They don’t recognize the situation as serious.",
        "Refer to a dictionary, and find out its meaning.",
        "He referred to them as his friends.",
        "We regard him as an expert.",
        "Many people regard their activities as anti-social.",
        "Don’t rely on their advice.",
        "He reminds me of my uncle.",
        "They’ve agreed to rent the house to them.",
        "We must repay the loan to them without any more delay.",
        "Ask him to reserve two seats for them.",
        "All this is going to result in trouble.",
        "They robbed her of all her money.",
        "His ambition was to rule (over) the earth.",
        "She sang a song to us.",
        "Don’t forget to save some food for them.",
        "He’s been trying to secure a job for himself.",
        "Don’t worry – I’ll see about that.",
        "They see us as their competitors.",
        "They see all this as unjust.",
        "I have to send this package to her.",
        "He separated from them and went into another building.",
        "The judge sentenced him to life imprisonment.",
        "She served coffee to them.",
        "The sofa serves as a bed too.",
        "He’s set a difficult task for them.",
        "When he gets angry, he shouts at everybody.",
        "She shouted to me to do something from across the road.",
        "Please show the report to him.",
        "They sat on the grass.",
        "She was happy to see me, and she smiled at me.",
        "He sold the old furniture to them.",
        " Could I speak to you for a moment?",
        " Could I speak with you for a moment?",
        "He spoke to me about his financial difficulties.",
        "A scientist spoke to us on agriculture.",
        "Can you spare some time for me?",
        "Most of his problem spring from drink.",
        "They struggled with each other for the gun.",
        " She struggled against this disease for a year before she died.",
        " She struggled with this disease for a year before she died.",
        "Don’t subject yourself to ridicule.",
        "He’s suffering from pneumonia.",
        "He suggested a mechanic to me.",
        "The teacher has supplied the students with a list of books.",
        "The police suspected him of murder.",
        "He took what you said as an insult.",
        "I took her for your sister.",
        "Can you take this letter to their place?",
        "She teaches mathematics to them.",
        "We’ll have to talk (with them and find a solution).",
        "I saw him talking (to a girl in blue).",
        "You should tell the truth to her.",
        "They thanked her for the help.",
        "Could you think of another way of handling the situation?",
        "Have you thought about trying your luck in another job?",
        "I was thinking about my childhood days.",
        "I’m thinking of leaving this job.",
        "I think of him as my friend.",
        "Throw it to me.",
        "I took his mother for his sister.",
        "He took what she said as an insult.",
        "She tried to translate the poem into French.",
        "They treated him as a VIP.",
        "He decided to treat his friends to ice-cream.",
        "He tripped over a stool and fell.",
        "The car in front turned into the next street.",
        "The road turns to the right there.",
        "You can use that box as a stool.",
        "Industrialists view the latest development as important.",
        "He viewed the criticism as a personal attack.",
        "She was waiting for the bus.",
        " Didn’t they warn you of the dangers?",
        " Didn’t they warn you about the dangers?",
        "He’s been trying to win support for the new proposal.",
        "I only wish for some peace and quiet.",
        "They asked him to write a computer program for them.",
        "You should write to us now and then.",
        "She wrote a letter to him."
    ]
}