{
    " Image-building Word Groups in Use ": [
        "It’s ten years now since we quarrelled. It seems so absurd to bear grudge after all that time.",
        "After all, he is your husband. It sounds so absurd to hear you call him “uncle”.",
        "I like him very much. It’s no use pretending that I don’t.",
        "I suppose you are still under training.",
        "It must be awful having to live in such a congested house as this.",
        "It’s extraordinary how film-actors keep young.",
        "It doesn’t sound as if he enjoys our company at all. Is that the way he behaves always?",
        "I’ve often seen your photographs in the papers. But I never thought I’d actually be meeting you.",
        "When I play cards. I keep talking. I never find that conversation interferes with my game.",
        "I’m sure it’ll be all right when the doctor comes. You mustn’t upset yourself.",
        "It wouldn’t have been nice to go without saying good-bye to the host.",
        "It wouldn’t be very nice if we didn’t give him a cup of tea.",
        "It ruins one’s health when one doesn’t take any rest at all.",
        "I can see that you are leading a happy life. You needn’t tell me that.",
        "It’s certainly nice to get out of your surroundings once in a while for a change.",
        "I think it’s very lucky that tomorrow is a holiday.",
        "I am determined that something must be done to put a stop to the whole thing at once.",
        "It really was nice of you to find time to come.",
        "I thought it was splendid to move about with these high officials.",
        "You can’t think what a comfort it would be for me to know that he is well.",
        "It strikes me that he is planning to make off without paying us.",
        "I gather there has been some little difficulty. May I help you?",
        "It didn’t seem as if I could reach here at all. The car was breaking down every now and then.",
        "I was delighted at the thought of seeing you again after such a long time.",
        "I am delighted you could come. I’ve been so looking forward to meeting you.",
        "I wonder what plans they have made to receive him.",
        "I am not so silly as to think that just because a man and a woman are seen together, it is necessary to believe the worst about them.",
        "Sometimes I wonder if he is not cheating us.",
        "It’s a mercy I didn’t start earlier. If I had, I’d have got drenched in the rain.",
        "I quite agree that I was a little shocked at first. But I recovered soon enough.",
        "I never knew he had such a fine sense of humour.",
        "I don’t feel like eating. I have an indigestion.",
        "I can’t bear to think that I’ll have to live without you.",
        "I hate to think that I made you unhappy.",
        "I should be a perfect fool if I didn’t know that he was making fun of me.",
        "I think it is terribly unkind of you to say such bad things about me.",
        "It’s no good going over all that again. I heard you the first time.",
        "I have made up my mind to go away. You can’t persuade me to stay on.",
        "I hate the thought that you might be unhappy.",
        "It always makes me uncomfortable when people thank me.",
        "You don’t know how sick I am of all these luxuries. I don’t want luxury.",
        "I was quite certain that he was not going to come. I think it would be awfully unfair if I didn’t do this small help to you.",
        "It’s such a bore there are no newspapers to read.",
        "I brought this album, because I thought it might amuse you to see our old photographs.",
        "I am so sorry you couldn’t have a second chance.",
        "It is always interesting moving from place to place, isn’t it?",
        "I bet they all will be jealous of you.",
        "I don’t remember that I ever told you about all these things.",
        "I don’t like to grow old. It’s hateful to grow old, isn’t it?",
        "I hope we haven’t forgotten anything.",
        "I only feel sorry that he should have gone without saying a word to me.",
        "I really am delighted to make your acquaintance.",
        "You are lucky I am not in a bad temper. Otherwise I’d have smashed your head.",
        "It seems to me the best thing would be for him to resign.",
        "But I can’t understand why he didn’t come to me before.",
        "I only hope that he won’t fail in the exams. I don’t hope for more.",
        "I think you’ve made a mistake.",
        "There’s no reason why you shouldn’t enjoy as much as you want.",
        "I don’t think much of these politicians who run after rich people for money.",
        "It’s really great of you to take me to all these places.",
        "It’d be very sad if you just followed your impulses like this. Use your head, instead.",
        "The partners are not on talking terms. I shouldn’t be surprised if they broke up the partnership one day.",
        "It will be fun taking them to all the important places here.",
        "If anything happens, she has me to turn to. It would be a comfort to her to know that.",
        "How right you are to realize that he is not trustworthy.",
        "I am always happy when somebody gives me a present.",
        "We felt so mean having to refuse her request.",
        "You needn’t have the smallest fear that I’ll make a nuisance of myself. I want to stay here only for a few days.",
        "I am glad to see that everything worked out the way we had planned.",
        "I hadn’t the smallest intention of saying anything to wound you. I’m dreadfully sorry for what I said.",
        "You make me feel an awful swine. The worst of it is that what you say is entirely true.",
        "What always interests me is the way you get out of scrape after scrape.",
        "It is comforting to see that everything went so smoothly.",
        "I thought it was a pity to get out of bed, because it was such a lovely day.",
        "I really must go and receive him — or he’ll never forgive me.",
        "I don’t think it would do to ask him home when we are having visitors.",
        "I can’t think where I left my pen. I looked for it everywhere.",
        "It’s a real pleasure to me to know a nice girl like you.",
        "We’ll be delighted if you’ll lunch with us.",
        "I can assure you that I am a good enough driver to drive this car.",
        "It’s lucky you didn’t get in that bus. It broke down on the way.",
        "She looked as if she would burst into tears on the smallest provocation.",
        "I am sure it’s nothing to worry about. Nothing good comes out of worrying too much.",
        "The great thing is not to let emotions dictate you.",
        "I see you are quite determined to marry that girl. When is the marriage going to be?",
        "It’s very wonderful how he has made his way up to this position. He had nothing very much to help him.",
        "I always wanted to live in the countryside.",
        "I was wondering if I could stay here tonight.",
        "I am growing tired of him telling me about his illness. His illness is the only subject he speaks about.",
        "I wonder if it wouldn’t be better that she never did find out the truth. She would get a shock if she did.",
        "It isn’t as if those thieves needed money. They stole the money just for some excitement.",
        "I feel that it’s not right to go there without an appointment.",
        "It has been a comfort to me to talk things over with you. I hope there’s no misunderstanding.",
        "I am glad you will be coming here on leave soon.",
        "It’s nice of you to praise me like this.",
        "It is wonderful being admired by others, isn’t it?",
        "It’s lovely to see you all again.",
        "It has been nice of you to give us your advice. It has helped to make things easy.",
        "I think it was very funny, his going without saying good-bye to anyone.",
        "I can’t believe that I’ve got back home.",
        "I’ve always envied people who could write novels.",
        "I suppose it was absurd of me to take his consent for granted.",
        "I really don’t know what has happened to him. He hasn’t come back yet.",
        "He hasn’t seen you since he was born. You really can’t expect him to recognize you.",
        "It’ll be so much easier for me to face any problem if you are with me.",
        "You’ve been used to a certain amount of luxury, and I don’t know what you’d do without money now.",
        "You’ve no idea how eagerly we’ve been waiting for you.",
        "It’s too bad of you to sneak away without telling anybody like this.",
        "It seems very difficult to get a few minutes alone with you. You’re so busy.",
        "It’s nice to see you after such a long time.",
        "It’s good to be in one’s own house. One doesn’t feel like a fish out of water at least there.",
        "It seems so unfair that this misfortune should happen to me.",
        "What a relief that all the work is over!",
        "It looks as if he is going to get that job. His interview went off very well.",
        "It’s idiotic to sacrifice your life for a slushy sentiment.",
        "We’ve been having a good time at the party until just now.",
        "It seems to me so pathetic that she and her sister wouldn’t recognize each other.",
        "He behaved as if he was far superior to us.",
        "It was a stupid risk to take. Yet he managed to slip a note into the prisoner’s pocket.",
        "It gives me a little thrill when I think that she sacrificed her life for him. It makes me proud to think that I have such an important person as you as my friend.",
        "It’s not just because you are awfully pretty that I love you. It’s also because I like the way you behave.",
        "I do think it is hateful the way you discuss my private affairs with others.",
        "I felt sure you were going to strike him.",
        "I’ve often thought that he was a good-for-nothing fellow. I have no hesitation in confessing it.",
        "It’s cruel of you not to give me a chance to talk with him.",
        "If you are kind enough to wait a moment, I’ll call him.",
        "It’s tiresome to have to talk about the same thing day after day.",
        "I can’t tell you what a pleasure it is that you could come.",
        "I didn’t dare make a scene, because my husband would never have forgiven me.",
        "I can’t tell you how distressed I was at the terrible scene she made before others.",
        "I came round to ask if you could lend me some money.",
        "You don’t know what it is to live on a very meagre income.",
        "It distressed me to see those people living in poverty.",
        "I have every right to stay in this place.",
        "He hasn’t been selected to the post. What makes it so unfair is that a man with lesser qualifications has been selected.",
        "He is such a fool. I can’t imagine what you see in him.",
        "You can’t imagine the troubles he has gone through to raise his children.",
        "It’s simply maddening when you want to sit alone and people won’t leave you alone.",
        "It’s a pity that you can’t think of a way to get around this problem.",
        "It’s always difficult when you live some distance away from your office, isn’t it?",
        "You had an awful time finding a new place to stay, hadn’t you?",
        "Please stop talking about the sacrifices you have made. I am sick of hearing them.",
        "It makes me so happy that you are getting on well.",
        "I never thought I would actually get to know you in person.",
        "It is funny we should feel so exhausted. After all, we have only been out for a walk.",
        "It sounds rather funny to hear you blame her like this. You have been doing the same thing, and you are not blaming yourself.",
        "I wonder if you realize what it was to work under the shadow of a scandal.",
        "It’s rather bitter to find your closest friends ignoring you.",
        "I suppose it’s difficult for the young to realize that they would get old, too.",
        "It wasn’t your fault if you didn’t care for me. I know I wasn’t a good sort.",
        "I am dreadfully sorry I sent such a nasty letter. Once I posted it, I became awfully uneasy. I would have given almost anything not to have posted it.",
        "I thought it rather a relief when the interview was over. But they again called me for another test.",
        "You must think me a perfect swine if you think I am going to smash up their marriage.",
        "I am awfully sorry not to remember you, but I am delighted to meet you.",
        "It must be interesting living in the town, I suppose?",
        "What is so awful is the way he ignores us.",
        "I thought you might like to know that the prisoners have escaped.",
        "I am not astonished that these things didn’t happen before."
    ]
}