{
    " Aa ": [
        "Add up these figures, will you? + (= find the sum of ).",
        "He’s looking for another job. That’s what it all adds up to + (= means or indicates).",
        "My expenses add up to Rs. 950 + (= amount to a total of).",
        "Why did he shout at them like that? His behaviour just doesn’t add up + (= doesn’t make sense).",
        "He asked her out, and she went with him to the cinema + (= invited her out)."
    ],
    " Bb ": [
        "I’m going to oppose the decision. You’ll back me up, won’t you? + (= support).",
        "Ask the driver to back the car up a bit.",
        "He backed up the car to the gate.",
        "Yes, I heard what he said. But the facts don’t bear him out + (= don’t support or confirm).",
        "I wonder how he’s able to bear up against difficulties so well + (= remain strong against).",
        "We bargained with them and managed to beat them/the price down to Rs. 5,000. His asking price was Rs. 6500, you know.",
        "The door was found locked from inside, and so they beat it down and got into the room. + (= broke it down, by hitting it hard).",
        "I don’t know how, but the old lady managed to beat off the thugs who attacked her. + (= fight and drive away).",
        "Some hooligans beat him up last night and left him for dead + (= hurt him severely).",
        "He has a bad cold and his nose is all blocked up.",
        "The pipe/drain/gutter/was blocked up by mud/dead leaves/ twigs/hair.",
        "One of the tyres blew out on the way and had to be changed + (= burst).",
        "He blew out the candle/lamp/match, and the room became dark again.",
        "It took some time for him to blow up the tyres. + (= inflate).",
        "The terrorists were planning to blow up the factory + (= to destroy it using explosives).",
        "(infml) He blew up the difficulties to get her sympathy + (= exaggerated).",
        "I heard the bomb blow up + (= explode).",
        "This time, their quarrel blew up over some silly things + (= arose).",
        "(infml) If he’s kept waiting, he’ll blow up + (= lose his temper).",
        "(infml) His boss will blow him up if he’s late + (= be very angry with him and scold him severely).",
        "Sorry I’m late. My car broke down on the way + (= stopped working because of a fault).",
        "We lost our trust in them and soon our relations broke down + (= became difficult and collapsed).",
        "They told her about his death, and she broke down + (= lost her self-control and collapsed, crying).",
        "He was down under a severe strain, and his health has broken down + (= collapsed).",
        "Can you break down the cost under various heads + (= analyze it under).",
        "You won’t be able to rescue those people if you don’t break down these doors/windows/walls/building + (= strike them hard and knock them down).",
        "If you don’t open the door, I’ll break it down + (= force it open).",
        "Nothing can break down her determination.",
        "The handle has broken off. What to do now?",
        "They broke off for some time and went out for a breath of fresh air + (= stopped doing what they were doing).",
        "She broke off in the middle of a sentence and looked at her watch + (= stopped talking).",
        "He has broken off all his business relations with them + (= ended).",
        "He broke a branch off the tree.",
        "I think a fire has broken out there + (= start suddenly).",
        "The rioting/fighting broke out when everybody least expected it + (= start suddenly and violently).",
        "You want to get ahead in your career, don’t you? Then you’ll have to break out of these prejudices + (= free yourself from).",
        "Somehow or other I want to break out of this routine/the 9 to 5 rut + (= change it; escape from it).",
        "The meeting went on for two hours, and it broke up only after 5 o’clock. + (= came to an end).",
        "They started fighting again, and the meeting/party/gathering broke up. + (= dispersed).",
        "Can’t you stay away from them? Why do you want to break up their family life/marriage/friendship?",
        "They broke up the car into scrap.",
        "He hasn’t got married to anyone else after he broke up with his wife. + (= ended his relationship with).",
        "There was a quarrel about something and he has now broken with Sunil. + (= ended his friendship with).",
        "How can you ever break with tradition in matters like these? + (= end your connection with).",
        "The new government may bring about a lot of changes in the administration.",
        "That song brought back memories of my childhood. + (= reminded me of my childhood).",
        "That story brought back my childhood horrors.",
        "(infml) I know this is not an easy task. But you’ll bring it off, I’m sure + (= succeed in doing it).",
        "You take too much sugar. It may bring on diabetes.",
        "He’s too shy with women. You’ll have to bring him out + (= help him lose his shyness).",
        "Jobs like these are really tough. I know. But, you see, they bring out the best in you — or the worst + (= Produce and cause others to know).",
        "Their TVs are really good. They’re bringing out a new model in a few months, I hear. + (= producing).",
        "He didn’t agree at first. But they managed to bring him round.",
        "She fainted from the pain and nobody knew how to bring her round + (= to help her get back consciousness).",
        "He didn’t agree at first, but she managed to bring him round somehow + (= persuade him to agree).",
        "Do you think it’s an easy thing to bring up children nowadays? + (= raise, rear).",
        "She brought up everything she had eaten + (= vomit).",
        "(infml) I’ll have to brush up (on) my grammar a bit. There’s going to be a test next week + (= revise or practice for a test).",
        "She kept on telling me about him. I had an idea that she was building him up too much + (= praising him too much, perhaps in a way that he doesn’t deserve to be praised).",
        "They’re planning to build up the entire area. + (= put up buildings in).",
        "I have an idea he’s trying to build up newspaper publicity.",
        "He built up this business/wealth all by himself + (= develop gradually and steadily).",
        "He doesn’t need medicines any more. Give him good food. That’ll soon build him up + (= help him regain his health and normal weight).",
        "A lot of tension builds up at work, and when you get back home, you’re not in the best of moods. + (= develops; increases in intensity/amount).",
        "(infml) Don’t butt in while I’m talking. + (= interrupt/ interfere).",
        "Buy up all the vegetables they have + (= buy all of the vegetables)."
    ],
    " Cc ": [
        "The police had to be called in to stop the fight. + (= asked to come and help).",
        "The bank has called in the loan. + (= asked us to pay it back).",
        "Call off the dogs, will you? + (= stop, recall).",
        "Her birthday party has been called off + (= cancelled).",
        "This is not the time or place to carry on a conversation/ talk/discussion.",
        "(infml) They kept carrying on about some silly things. + (= arguing and quarrelling loudly).",
        "He saw me coming, but he just sat there and carried on playing chess. + (= continue).",
        "He carries on some kind of a business there. + (= is going on with/busy with).",
        "They’ve been carrying on a survey of the region. + (= conducting).",
        "(infml) He’s carrying on with his neighbour’s wife. + (= having an affair with).",
        "Carry on working.",
        "Do you believe that he’ll carry out these promises/threats? + (= fulfil).",
        "The doctor wants to carry out some more tests.",
        "He’ll only give his opinion after that. + (= perform).",
        "(infml) That was a new idea/fashion and it caught on. + (= become popular).",
        "He made some gestures, but I didn’t catch on. + (= understand).",
        "(infml) They broke in and cleaned me out of all the cash I had + (= take away all my cash).",
        "Come on! Let’s clean out the kitchen + (= clean by removing all the dirt away).",
        "Clean out this tin, will you? + (= clean by removing the dirt from the inside of).",
        "(infml) Clear off! This is private property + (= go away, leave this place).",
        "I want to clear off the debts first + (= complete the payment of).",
        "The infection/rash took about a month to clear up.",
        "The weather will clear up now. + (= become fine).",
        "I went through the report once again, and things began to clear up. + (= become more understandable).",
        "I want to clear up a misunderstanding + (= remove or settle it).",
        "Has the mystery been cleared up? + (= solved).",
        "I was clearing up the rubbish + (= removing the rubbish and making things tidy or orderly).",
        "If things go on like this, the factory will have to close down + (= stop production, permanently or for a time).",
        "When the news came, all the schools closed down for a day + (= stopped working).",
        "The police closed in around the robbers. + (= advanced on them, especially from all sides).",
        "Fog closed in on the city/ airport. + (= surrounded).",
        "The bank closed (up) at 2. + (= was open to the public till).",
        "Within a week, the wound began to close (up).",
        "Lots of unconnected thoughts cluttered up his mind/head. + (= to cover or fill a space or room with too many things, so that it looks very untidy).",
        "If you want to buy it, buy it now. Prices aren’t going to come down + (= fall).",
        "We were about to leave, and the rain started coming down. + (= falling).",
        "The ceiling came down all of a sudden + (= collapsed).",
        "These traditions/ customs have come down to us from ancient times/from our forefathers/through the centuries/over several generations. + (= passed on).",
        "The door handle came right off in my hand.",
        "(infml) A chess tournament is going to come off in Madras next month. + (= take place).",
        "When do you think will the marriage/party come off? + (= take place)",
        "(infml) I think his scheme has come off. + (= become successful).",
        "How was the game? How did your team come off? + (= fare)",
        "Our party came off best in the recent general election. + (= was in the best position).",
        "Don’t argue with those people — you’ll come off worst. + (= be in the worst position).",
        "(infml) Oh, come off it! You must be joking + (= don’t try to fool me; that’s nonsense).",
        "A button has come off your shirt.",
        "He came off well/badly during the interview.",
        "In a few weeks, winter will be coming on. + (= arriving).",
        "The rain came on all of a sudden.",
        "“I don’t want to go” ~ “Come on, don’t be silly. You’ll have to go.”",
        "Come on/ along, now, try again. I’m sure you’ll be able to do it.",
        "I think I’ve got a fever coming on + (= I feel the beginning of).",
        "I think winter is coming on + (= beginning to be noticeable).",
        "When is that programme coming on? [= going to be shown (on the TV)].",
        "This film — where’s it coming on? At the Odeon? + (= going to be shown).",
        "You leave now. I’ll come on later + (= follow).",
        "The red light came on, and it meant that the voltage had dropped.",
        "Come along, or you’ll miss your bus + (= hurry up).",
        "When’s your new book/novel going to come out. + (= be published).",
        "A new brand of toothpaste has come out. + (= appeared in the shops).",
        "She has come out top + (= been placed at the top in the exam/test).",
        "You’ve come out very well in both the photos. + (= been reproduced well).",
        "Have the results come out? + (= been announced).",
        "The sky cleared and the sun came out.",
        "One day the truth/what really happened/the real reason will come out. + (= become known).",
        "Whatever you do, this stain won’t come out (of the shirt) + (= disappear, be removed).",
        "The Christmas holidays will soon come round. + (= occur again).",
        "She fainted and didn’t come round for some time. + (= recover consciousness).",
        "I hate such hot weather. If only it cooled down a bit.",
        "They/their tempers haven’t cooled down yet. + (= become calm).",
        "He blew on his tea to cool it down.",
        "I’ll drink it later — let it cool down a little.",
        "She put the child to bed and covered him (up) with a blanket.",
        "Cover the food (up) with a plate or something.",
        "(infml) She was trying to cover up her emotion + (= hide).",
        "He knew his friends were guilty. But still he decided to cover up for them. + (= to keep what they had done secret).",
        "(infml) We don’t know when problems are going to crop up + (= happen, occur).",
        "Let me know if anything crops up + (= occur unexpectedly)."
    ],
    " Dd ": [
        "I’m not satisfied with the report I’ve prepared. You see, I didn’t have much time, and I had to dash it off.",
        "The fire/storm has died down + (= became less strong — but some of it was still there).",
        "The police were looking for him, and he decided to go into hiding until the search had died down.",
        "Where did you dig up that dreadful story?",
        "Dig up some worms — we’ll go fishing.",
        "(slang) The gangsters decided to do him in. + (= kill him).",
        "I dozed off in the car and the driver didn’t wake me up till we reached there. + (= fell into a light sleep)",
        "She drew him aside and told him something in his ear.",
        "He drew (out) some more money from his account/bank today.",
        "The train was drawing out (of the station) and she came running in.",
        "He drew out Rs.5000 from the bank/ his bank account yesterday.",
        "(infml) She was very shy and I wondered how I’d be able to draw her out. [= make her feel less shy and reserved (so that she’d talk freely)].",
        "He drew his handkerchief out of his pocket.",
        "Draw up the chair and sit down, will you? + (= bring it near).",
        "A car drew up and the driver got out. + (= came and stopped).",
        "When he took up this project, he had no past experience to draw upon. + (= make use of).",
        "We discussed several ideas and suggestions, and the boss asked me to draw up a paper assessing them. + (= prepare).",
        "Aren’t you dressing up? Didn’t I tell you about the dinner party? + (= putting on formal or smart clothes).",
        "(infml) He has this bad habit of dressing up his reports with high sounding words. + (= trying to make them impressive by using).",
        "(infml) When you visit Bombay next, you should drop in and visit us.",
        "(infml) Their business seems to be dropping off + (= slackening).",
        "The demand for their new product has dropped off + (= become less).",
        "(infml) I dropped her (off) in front of her house + (= took her there in my vehicle and allowed her to get out).",
        "I dropped off for some time and I woke up with a start + (= fell into A light sleep).",
        "He dropped out of school/college/university and started doing odd jobs + (= stop going to school, etc. permanently).",
        "Why did he drop out of the club? + (= withdraw from)."
    ],
    " Ee ": [
        "The pressure has eased off a bit. + (= become less severe or intense).",
        "I think you should ease up on him. Don’t make him work so hard — he’s just a beginner, mind you. + (= treat him less severely).",
        "She egged me on to buy it from the black-market + (= urged me to).",
        "They ended up offering him more money.",
        "He started talking in a tough way and ended up apologizing + (= ended talking by).",
        "We ended up by having a cup of black coffee each + (= end an activity by).",
        "He ended up in prison + (= was finally in).",
        "He ended up as their General Manager + (= finally became).",
        "They ended up the lunch with fruit salad + (= finished it by having).",
        "Their meetings usually end up with prayer + (= come to an end)."
    ],
    " Ff ": [
        "The service at that restaurant has fallen off. + (= become worse).",
        "His income has fallen off. + (= become less).",
        "He couldn’t get on the horse — he kept falling off.",
        "It’s not in the bag — it must have fallen out.",
        "Her child’s teeth are starting to fall out.",
        "(infml) Things fell out the way we had expected. + (= happened).",
        "(infml) Let’s not fall out with them over a silly thing like this. + (= quarrel with).",
        "Look, his wallet fell out of his pocket.",
        "(infml) All our plans have fallen through. + (= failed; came to nothing).",
        "He was ill in bed, and so his wife filled in for him at the shop. + (= took his place).",
        "Have you filled in your name and address on the form/slip?",
        "(infml) Can you fill me in on the rumours/the gossip/the details/the scandal? + (= give me more/all the information on).",
        "I only have a general idea. Fill me in on the details.",
        "I only know what happened today. Fill me in with a little background.",
        "The receptionist gave me a slip to fill out.",
        "Those cutlets filled me up.",
        "Take the car to the petrol station, and fill it up with petrol.",
        "Let’s fill up the tank full.",
        "The police found him out before he could blow up the bridge. + (= came to know about his dishonest/criminal activities).",
        "Why do you want to find out about things that do not concern you? + (= learn about/of...).",
        "You haven’t finished it yet. Don’t let the boss find out + (= discover it).",
        "Have your parents found out?",
        "Finish (off) the pudding/stew/porridge — it won’t keep. + (= eat it completely).",
        "Let’s paint one more door and finish (off/up) the paint. + (= use it completely).",
        "(infml) fDigging the garden — it has really finished me off. + (= tired me out).",
        "(infml) The terrorists have threatened to finish him off. + (= kill him).",
        "I want to finish (off) this job/report/ homework today itself. + (= complete).",
        "Can you fit one more person in that car? + (= find a place for).",
        "Don’t try and fit any more chairs/furniture into that room/hall.",
        "Can you fit this box in (/into the boot of the car)? + (= find space or room for).",
        "His story doesn’t fit in with the facts. + (= match, suit).",
        "They’ve fixed the meeting (up) for Monday/the 10th/ tomorrow.",
        "Have they fixed (up) where to go for the picnic?",
        "(infml) Can you fix this watch (up)? It has stopped. + (= repair it).",
        "Before we move into that house, we want to fix it up. + (= repair/redecorate it).",
        "She’s in the other room fixing her hair. + (= making it look attractive)."
    ]
}