{
    " Group 1 ": [
        "Whatever gave you that idea? Banks won’t give you loans for purposes like this.",
        "Whatever will become of him if he loses the election?",
        "When are the election results going to come through?",
        "When are you going to put this plan into action? + (= carry out…)",
        "When are you going to put this plan into operation? + (= make it start to work).",
        "When are you planning to get the project/campaign going?",
        "When can you start (in) on teaching the children?",
        "When did 500-rupee notes come into use?",
        "When did all this trouble start?",
        "When did he come back home last night?",
        "When did he come? I hope you didn’t have to wait long.",
        "When did he return from work?",
        "When did personal computers come into use?",
        "When did the carpenters stop work? 5.30?",
        "When did the electricity go off? + (= become unavailable).",
        "When did the light go out? + (= stop shining).",
        "When did the problem/trouble begin?",
        "When did the wedding take place?",
        "When did they announce this news?",
        "When did they get there/here?",
        "When did they leave Delhi?",
        "When did they pick the apples last year? In September?",
        "When did this government come (in) to power?",
        "When did you buy this meat? It has gone off. + (= gone bad; become unfit to eat).",
        "When did you give up politics/communism?",
        "When did you have breakfast today?",
        "When did you last see her?",
        "When did you last see him?",
        "When did you leave the party? 10 o’ clock?",
        "When did you next see him?",
        "When did you start this ointment/medicine?",
        "When do grapes/mangoes/come into season?",
        "When do they close the bank/library?",
        "When do they start work in the morning?",
        "When do you start work/working every day?",
        "When does school begin? 9 o’clock?",
        "When does the clinic/library/bank open?",
        "When does the last train leave the station?",
        "When does the library close?",
        "When is the meeting?",
        "When is your article going to appear?",
        "When was her exam? Has she passed?",
        "When you found your money stolen, did you go to the police? + (= inform the police).",
        "When you get back from Dubai, could you bring a bottle of French perfume for me?",
        "When you registered at the reception counter, you should have registered under your own name. Why did you use a false name?",
        "When’ll we know the results of the election?",
        "Whenever are you going to finish that report?",
        "Where are the masons? Have they started the compound wall?",
        "Where are these bus bodies made?",
        "Where are we going to stay for the night?",
        "Where are you going? Can I come/go/tag along?",
        "Where can I get hold of a vase like this?",
        "Where did you buy this? My sister has got the same dress.",
        "Where did you get hold of these details/these figures?",
        "Where did you get the idea that he’s my son? He’s my husband.",
        "Where did you learn this/that news?",
        "Where did you receive/obtain/get so much information from?",
        "Where did you spend your holidays last year?",
        "Where do they make these engines?",
        "Where do you buy your vegetables? In the market?",
        "Where do you want these old jars to go?",
        "Where does he get all this money from? It isn’t as if his parents are rich.",
        "Where does he get his money?",
        "Where does he live?",
        "Where does he live? No matter. It’s not important. + (= never mind).",
        "Where does this road/path/pipe/ wire lead?",
        "Where has what’s-his-name gone?",
        "Where have I put the damned/stupid/wretched thing? I can’t find it.",
        "Where have you been? She’s gone looking for you.",
        "Where have you been? They’ve been trying to get hold of you all day. + (= find you; make contact with you).",
        "Where in heaven’s name has everybody been?",
        "Where is the main shopping street here?",
        "Where was he on the night of the murder?",
        "Where were you? We’ve searched the town for you.",
        "Where’s he going at this time of night?",
        "Where’s Mary? Ah, here she is.",
        "Where’s my watch — I’ve been looking for it for ages.",
        "Where’s she? Is she about? + (= somewhere near?)",
        "Where’s the hostess? How’s the party going along?",
        "Where’s the purse, then? It can’t have disappeared into thin air.",
        "Where’s the sense in lending him so much money? + (= I think it’s an unwise thing to do).",
        "Where’s the sense in selling it at Rs.150 each when you can sell it easily at Rs.200 each?",
        "Where’s the suitcase? What became of it?",
        "Where’s the top of this biscuit tin/paint can/toothpaste?",
        "Where’s today’s paper?",
        "Where’s your sense? Do you expect him to confess so easily?"
    ],
    " Group 2 ": [
        "Wherever have I left the car key?",
        "Which blood group do you belong to?",
        "Which is the quickest/shortest/best/right way from Bangalore to Mangalore?",
        "Which Menon do you mean? There are two people of that name here.",
        "Which of the students/boys/ girls has read the most books?",
        "Which of the two drivers was the guilty party? + (= the person to blame).",
        "Which of the two girls types better?",
        "Which of the two shirts/teachers do you like better? + (= prefer).",
        "Which of these colours do you like best?",
        "Which of those three actors do you like best?",
        "Which of you has the fewest mistakes?",
        "Which of you made (the) most mistakes?",
        "Which way is quicker — by train or by bus?",
        "Which/what woman will marry a person like him?",
        "Who acted the part of Macbeth/Ravana?",
        "Who acted the part of Sita in the play/film?",
        "Who are the players in the other team?",
        "Who are we to judge other people? We’re no better than them.",
        "Who arrived last?",
        "Who but that fool of a secretary could have done such a thing?",
        "Who came first/second/last in the 100 metre race? + (= finished in first, etc. place).",
        "Who came first?",
        "Who designed the new Town Hall?",
        "Who do you like most?",
        "Who do you think is going to win this match?",
        "Who ever are you going to get a loan from now?",
        "Who gave away the prizes? + (= distributed).",
        "Who gave it you?",
        "Who gives importance to things like these in this day and age? + (= nowadays).",
        "Who got (the) most points/votes?",
        "Who handles the firm’s accounts?",
        "Who has the final decision in matters like these? + (= a decision that will not be changed).",
        "Who helped you get your TV going?",
        "Who is the police officer on the case? + (= in charge of dealing with…).",
        "Who lives in the house next door?",
        "Who lives next door?",
        "Who lives there?",
        "Who lost (the) most (money/ weight)?",
        "Who owns this umbrella?",
        "Who owns this/that land?",
        "Who placed the ladder there?",
        "Who plays the lead in that film? Harrison Ford? + (= Who is the main actor?).",
        "Who runs the place?",
        "Who runs this place when you’re away?",
        "Who says the meeting is over? It’s nowhere near over.",
        "Who scored most points in the last week’s quiz?",
        "Who shall we invite in place of Desai?",
        "Who sold these office supplies to us? No less than 60% of them are of poor quality.",
        "Who started the fight?",
        "Who suggested the idea/plan to him?",
        "Who takes you for chemistry/ history/physics/English? + (= gives lessons in…).",
        "Who takes/ teaches your Physics class?",
        "Who threw that stone? It could have hit the window.",
        "Who told you he got a medal? Actually, he was second (to) last in the race. + (= the one before the one who finished last).",
        "Who took the decision to buy these computers?",
        "Who was in charge of the office during his absence?",
        "Who was in charge there then?",
        "Who were the actors who were on stage just now?",
        "Who won the most votes?",
        "Who’ll do the washing-up/the cooking/the cleaning?",
        "Who’ll meet/bear the cost of the repairs/of repairing the car? + (= pay…).",
        "Who’s going to be the next chairman?",
        "Who’s going to look after her in her old age?",
        "Who’s he? We’ve been hearing quite a lot about him lately, haven’t we?",
        "Who’s in charge when the manager is away?",
        "Who’s living next door?",
        "Who’s moving the furniture about upstairs?",
        "Who’s pounding (at/on)the door at this time of night? + (= hitting it hard and repeatedly).",
        "Who’s running this firm?",
        "Who’s that boy running in front?",
        "Who’s that girl sitting by the window?",
        "Who’s that man at her side?",
        "Who’s that man coming down the steps?",
        "Who’s that tall man she was speaking to? I want to get a line on him.",
        "Who’s this Sandeep Gupta? Can you get a line on him?",
        "Whose go is it? + [= turn (in a game etc.)]",
        "Why are they opposed to this proposal/system?",
        "Why are you against cuts in government spending? + (= reductions…).",
        "Why are you against this idea/plan/policy?",
        "Why are you beating her like this? Have you gone out of your mind? + (= Are you mad/crazy?).",
        "Why are you so down on him? + (= Why do you disapprove of/dislike him?).",
        "Why can’t you put away your things? I can’t clear/ tidy up after you all the time.",
        "Why did he resign the job? It isn’t as if the pay wasn’t good.",
        "Why did you act against his advice?",
        "Why did you forge his signature? If the boss finds this out, you’ll be in hot water. + (= in serious trouble; in a difficult situation/disgrace).",
        "Why did you promise to them we would lend them the money they need? This/You’ve put us in a very awkward position.",
        "Why did you snub him in public like that?",
        "Why did you tell him all those things? I told you not to spill the information.",
        "Why did you tell the truth to them? Were you born yesterday? + (= so foolish/stupid?).",
        "Why didn’t he tell us anything about it? It’s not as if he knows nothing about it.",
        "Why didn’t you bring your wife along?",
        "Why didn’t you come to the public meeting? There were scores of people there. + (= very many).",
        "Why didn’t you support that proposal?",
        "Why do we want another TV now? Let’s not throw our money about/away.",
        "Why do you always do things the hard way? + (= in a way that’s unnecessarily difficult).",
        "Why do you always speak roughly to your children?",
        "Why do you criticize him all the time? Do you have a down on him? + (= disapprove of/dislike him).",
        "Why do you feel so unfriendly/unsympathetic towards us?",
        "Why do you keep fighting each other like this?",
        "Why do you keep making the same mistakes again and again?",
        "Why do you keep on trying to set one person against another?",
        "Why do you keep shouting at those workmen? It’s time you grew up, uncle!",
        "Why do you need a secretary who answers you back? If I were you, I’d throw her out.",
        "Why do you take a cynical view of women like this?",
        "Why do you want to pretend ignorance of the situation?"
    ],
    " Group 4 ": [
        "Why does he want to go walking in such awful weather? Crazy is the only word for it.",
        "Why does he want to make things difficult for us like this ?",
        "Why don’t we call them for a negotiation? + (= I suggest that we should…)",
        "Why don’t you ask Ajith? He has/ knows all the answers. + (= he knows everything).",
        "Why don’t you ask Sharma? He knows the subject from beginning to end + (= completely).",
        "Why don’t you bring your friends also to the meeting? The more the better, you know.",
        "Why don’t you come on a visit to our place, then?",
        "Why don’t you come round for dinner and stay the night?",
        "Why don’t you contract out the job instead of doing it yourself? Have you considered the cost in time and effort?",
        "Why don’t you divide the work between you?",
        "Why don’t you do out your cupboard? + (= make it clean and tidy; arrange the things in it in good order).",
        "Why don’t you do your bedroom today? It’s a mess.",
        "Why don’t you get on with the job in hand? Finish it, so you can take up something new.",
        "Why don’t you go and meet him? He’ll be all the happier for it.",
        "Why don’t you have a talk with him? He’ll tell you what actually happened.",
        "Why don’t you have a word with him about our problem? He may be able to give us some advice.",
        "Why don’t you join us for dinner/lunch/breakfast/tea today?",
        "Why don’t you make clear what you expect them to do?",
        "Why don’t you open the windows and air the room for some time?",
        "Why don’t you put a match to the wood/fire? Let’s start cooking.",
        "Why don’t you put some music on?",
        "Why don’t you put those books in order?",
        "Why don’t you put your desk in order?",
        "Why don’t you start a clean piece/sheet of paper for the next list? + (= a blank…).",
        "Why don’t you stay a few days longer?",
        "Why don’t you take a chance? You’ve got nothing to lose. + (= you won’t suffer even if you’re unsuccessful).",
        "Why don’t you visit their place, and see things for yourself?",
        "Why don’t you wait until we reach home? Then you’ll have all the time in the world to read it.",
        "Why ever would anyone want to buy an old car like this?",
        "Why have you been so long in the shop?",
        "Why in God’s name didn’t you tell me this earlier?",
        "Why in heaven’s name didn’t you call me?",
        "Why in the world did you do a thing like that?",
        "Why is he shouting his head off like this? Can’t they hear him? + (= shouting very loudly and for a long time).",
        "Why is he so anxious to get in on this project/ scheme?",
        "Why not try ringing up a few of the key customers?",
        "Why should he take bribes? I mean, he has a good salary, his wife is employed, their parents are rich...",
        "Why should she concern herself in/with other people’s affairs?",
        "Why should that be considered significant?",
        "Why should we go by train when the plane costs no more?",
        "Why should we sell it at cost?",
        "Why the sudden interest in cars?",
        "Why was everybody giving me funny looks? Is something wrong?",
        "Why was he killed? That’s a real puzzle. Nobody’s been able to get their mind round it.",
        "Why was this company making losses like this? I think the management has got a lot to answer for.",
        "Why would anyone ever want to buy an old car like this?",
        "Why’s he behaving so oddly? Is he all there, do you think? + (= really sane).",
        "Why’s he shouting at them? What’s biting him? + (= Why’s he annoyed/upset?).",
        "Why’s nobody answering the bell? Give the button another press.",
        "Why’s she sitting there with a long face? Was there a quarrel or something?",
        "Will it be all right if I join the train at Pune?",
        "Will it take long to finish the repairs?",
        "Will Rs.100 do you? + (= be enough for/satisfy you?).",
        "Will the colour run when I wash this dress?",
        "Will there be buses at this time of night?",
        "Will this government survive the next election?",
        "Will this work run to next year?",
        "Will you be all right on your own?",
        "Will you be at the meeting?",
        "Will you be in tomorrow?",
        "Will you complete the work before next month/year?",
        "Will you describe her as clever/shy/competent?",
        "Will you do it or not?",
        "Will you help me unpack my things?",
        "Will you keep a close eye on the kids till I come back?",
        "Will you pass me that book? I can’t reach it.",
        "Will your savings run to a holiday in Simla?",
        "With all the comings and goings, how can I complete the work? The last visitor only left just now.",
        "With those noisy children playing outside, how can I get to sleep?",
        "With three small children, how can she cope on her own? + (= without help).",
        "Would you be interested in (buying) that TV?",
        "Would you care for a cup of coffee/another piece of cake?",
        "Would you care to come for a walk?",
        "Would you care to join us for a cup of tea?",
        "Would you like a cup of tea/to go for a walk?",
        "Would you like a hand carrying these things?",
        "Would you like a lift into town?",
        "Would you like me to close that window?",
        "Would you like me to come and help you?",
        "Would you like some more porridge/cutlets/cake/grapes?",
        "Would you like to have a quick read of this report?",
        "Would you like to tell me why you couldn’t complete it?",
        "Would you mind closing the window?",
        "Would you mind handing this to him?",
        "Would you mind repeating what you just said? I didn’t (quite) get it + (= hear it).",
        "Yes, of course he’s safe — but why should you concern yourself so much about him?",
        "You bought this from them with your eyes wide open. Now, are you trying to tell me they forced you?",
        "You can’t fine him for a small thing like that. Do you mean to say his loyalty to the company and devotion to duty go for nothing?",
        "You couldn’t see the Governor at all? Do you mean to say you went there for nothing? + (= without achieving anything)..",
        "You don’t look all right. What’s the matter?",
        "You had a breakdown on the way? Don’t give me that line.",
        "You have everything — good looks, intelligence, a good job. What more do you want?",
        "You have to pay me Rs. 1001.50. Let’s call it Rs.1000, shall we?",
        "You knocked it down, didn’t you? Offer to buy them another flowerpot or at least say you’re sorry.",
        "You know something? I met up with her today at the supermarket. + [= met her (esp. again) — that too, by chance].",
        "You look upset — is anything the matter?",
        "You look upset. Is there anything/something on your mind?",
        "You look upset. What’s the matter? + (= What’s wrong?).",
        "You look worried. What’s on your mind?",
        "You must be thirsty after all that walking. Perhaps you’d like a cold drink?",
        "You mustn’t quote me on this anywhere, understand?",
        "You need a rest from all this work. Why don’t you go somewhere for a change of air?",
        "You ought to/should know better than to annoy your boss. Why did you pick an argument with him? + (= You should be wise enough not to…).",
        "You paid 1000 rupees for this shirt? You must be out of your mind.",
        "You remember that restaurant across from the post office? What has become of it? + (= happened to it).",
        "You said all those things to drive home the point that this plan is not workable, right?",
        "You said that there’s a lot we can do to improve ourselves. What exactly did you have in mind when you said that?",
        "You see that counter? That’s where you must give your building plan in.",
        "You stupid thing! Can’t you have phoned me?",
        "You think I’m going to resign? What put that idea/thought into your head?",
        "You think your team is going to beat them? Then you’re in for a surprise.",
        "You want to buy my house, right?",
        "You want to go for a picnic in such awful weather? I won’t hear of it. + (= won’t let you do it; won’t permit; won’t allow you to do it).",
        "You went and told his father, didn’t you? That was a mean thing to do.",
        "You went into banking/this job with your eyes open, and so what’s the point in complaining now?",
        "You were criticizing him — can you do any better?",
        "You were very mean to him. Why did you say all those nasty things?",
        "You’ll be here for one or two years, won’t you? You’ll certainly learn our language in the course of time. + (= when some time has passed).",
        "You’ll get about Rs.9,000 for your TV — or Rs.10,000 at the very best. It’s two years old, isn’t it?",
        "You’ll have to hire a lawyer. But that’s going to cost money. Can you afford it?",
        "You’ll have to stop smoking/drinking. Why do you want to injure your health like this?",
        "You’re a lawyer, aren’t you? I’ve seen you in court.",
        "You’re always criticizing me. Get off my back, will you?",
        "You’re not going to deliver it today, right?",
        "You’re not looking yourself today. Anything wrong? + [= you look ill (or tired); you don’t look as healthy/ happy as usual]",
        "You’re now 20, aren’t you? You’re of an age when you should start looking for a job.",
        "You’re very late — what kept you?",
        "You’ve broken another vase. What do you have to say for yourself?",
        "You’ve got 490 marks out of 500? Good show.",
        "You’ve got a happy marriage, brilliant career and wonderful children — what more do you want?",
        "You’ve said enough. Now shut up, can’t you?",
        "Your actions have brought disgrace on the whole company. What have you got to say for yourself?",
        "Your car is in the driveway. Could you move it, please?",
        "Your grandfather? I don’t remember him — he must have been before my time.",
        "Your hair is all over the place. Why don’t you comb it?",
        "Your headache has gone, I hope?"
    ]
}