{
    " Group 1 ": [
        "Something like this happened there.",
        "She told me something like this.",
        "He had typhoid or something.",
        "He gave her a sari or something.",
        "He was dismissed or something.",
        "They ran away or something.",
        "He hadn’t brought any tools or anything.",
        "He wasn’t sorry or anything.",
        "They left early for some reason or other.",
        "Some meeting or other was going on.",
        "I was thinking about something or other.",
        "He’ll always have something or other to do.",
        "Try loosening one or other nut.",
        "Give me one or other magazine.",
        "He used one or other of these spanners.",
        "He gave me some tablet + and I took it.",
        "He had some ring-like thing with him.",
        "There was someone waiting there.",
        "I saw someone important there.",
        "His name is James something.",
        "Lyndon B. something was their President then.",
        "His name is James something or other.",
        "He gave it to some clerk or other.",
        "Why don’t you meet someone or other there + and sort it out?",
        "It belongs to someone or other there.",
        "Send one or other person to bring it.",
        "I gave it to one or other clerk there.",
        "I can go to one or other of my friends there.",
        "I gave it to Azeez or someone.",
        "Your brother or someone had phoned me up before that.",
        "Did Asha or anyone come here?",
        "I didn’t find Tom or anyone there.",
        "Some stranger came and talked to us.",
        "I saw it with some person there.",
        "I saw it at some hotel or other.",
        "I got it from somewhere or other in Bombay.",
        "He lives somewhere or other in London.",
        "He lives somewhere or other near Bangalore.",
        "He went to one or other Bank and tried for a loan.",
        "Start from one or other end.",
        "He must be in one or other of these places.",
        "It was in New York or somewhere.",
        "He belongs to Hyderabad or somewhere.",
        "It wasn’t in the cupboard or anywhere.",
        "Has he gone home or anywhere?",
        "It was in some bottle there.",
        "I’ve seen it in some shop there."
    ]
}