{
    " Group 1 ": [
        "He has his own particular way of looking at things.",
        "He’s always hopeful and confident about his future.",
        "Whenever anybody praises him, he feels embarrassed and ashamed.",
        "He shows a professional attitude to work.",
        "I like him — he has a devil-may-care attitude.",
        "The situation was very serious, but he acted as though he wasn’t aware of it at all.",
        "He’s always logical in his approach.",
        "He has an aggressive attitude.",
        "She very much wants it to happen.",
        "He’s a reasonable man — he’ll understand your difficulties.",
        "He’s rather lazy and doesn’t show much interest in what he does.",
        "He felt sad and discouraged.",
        "He’s very refined and never uses foul language.",
        "He doesn’t have the temperament for this sort of work.",
        "His mentality towards the working class seems to have changed.",
        "He’s very interested in his new project, and it takes up all his attention and energy.",
        "He wasn’t particularly friendly, but he was civil to them when they met him.",
        "When he starts doing something, it holds his attention completely.",
        "He’s more responsible now — I don’t know what caused him to change his attitude.",
        "He looked sad and upset as though he had a serious disappointment.",
        "I didn’t like his attitude — it was quite unfriendly.",
        "He’s always realistic about things — he doesn’t base his decisions on unlikely hopes.",
        "He’s always afraid that something bad is going to happen.",
        "He freely gives money to people who need it.",
        "I found his attitude impossible to explain.",
        "He appreciates good music.",
        "She felt sad and pessimistic.",
        "She was very warm and friendly, but her husband was very snobbish and treated us as though we were somehow inferior to him.",
        "I think he has an attitude problem.",
        "He has just the right mentality for this work.",
        "He shows courage/ independence.",
        "He and his wife seemed devoted to each other.",
        "He expresses his opinions without any doubts.",
        "He’s calm and sensible even in difficult situations.",
        "He’s always relaxed and unconcerned about what’s going to happen.",
        "She felt grateful to him.",
        "He’s very cautious in what he says and does, and doesn’t take risks.",
        "He’s a very cultured person and he knows a lot about music and arts.",
        "He always follows his own inclinations.",
        "Try to look at it from a woman’s point of view.",
        "He quite likes publicity.",
        "He has a casual sort of attitude towards everything.",
        "He has a definite aim and a strong desire to achieve it.",
        "He always looks at things in a matter-of-fact way and his actions are based on reasons, rather than emotions.",
        "The expression on his face — it was depressing and miserable.",
        "He always considers the bad aspects of a situation rather than the good ones.",
        "He’s easily influenced/controlled by other people.",
        "She likes talking about culture, fashion and things like that.",
        "He has strong and unreasonable opinions about politics.",
        "She faces her difficulties with courage.",
        "He gave her a gift, and she felt both embarrassed and secretly delighted at it.",
        "Her speech and manner are very refined.",
        "I’m not in the right frame of mind to take part in a discussion now.",
        "He’s too optimistic — nothing can make him lose hope.",
        "He always shows understanding for people who’re suffering.",
        "His attitude in this matter is quite strange.",
        "He’s always objective about things, and he doesn’t allow his decisions to be affected by his prejudices.",
        "He very much wanted it to happen.",
        "How do you think will the ordinary man in the street react to these changes?",
        "He isn’t sophisticated — he’s rather narrow-minded.",
        "I don’t like the way he thinks about things in general.",
        "He always takes great care not to offend others, and expresses his opinions in a delicate way.",
        "She was so upset and worried that she couldn’t think clearly.",
        "He freely gives help to people who need it.",
        "He’s full of radical views.",
        "What’s his attitude to politics?",
        "He has a strong character and can put up with difficulty/hardship.",
        "He felt upset and angry because of the way he was treated.",
        "He tried to do it without any real effort or enthusiasm/interest.",
        "She felt lonely and unhappy."
    ],
    " Group 2 ": [
        "He has a good knowledge of culture and fashion.",
        "Whenever he discusses something, he tries to be fair to all sides.",
        "He felt proud to be involved in that project.",
        "He’s happy and satisfied with his life.",
        "One thing I like about him is, he isn’t easily discouraged.",
        "I felt an urge to slap across his face.",
        "He’s an optimist, and I like his general attitude towards life.",
        "He likes doing jobs that others turn down.",
        "They were very grateful for their support.",
        "I like his down-to-earth common sense.",
        "He was very excited, and he was doing everything very quickly.",
        "He reacted well to the news.",
        "He’s a man of definite opinions.",
        "I found his attitude annoying.",
        "He has a lot of unreasonable religious beliefs.",
        "He’s too cautious and slow to act.",
        "She was unable to speak, and she looked at him with surprise and horror.",
        "He’s very annoying at times.",
        "I like him — he’s very sophisticated.",
        "He was frightened, and he was behaving in a wild, desperate way.",
        "Their attitude irritated him.",
        "He wasn’t satisfied with the situation he was in.",
        "His attitude to this idea is very strange.",
        "Let’s be realistic about this — there’s going to be fierce competition for the contract.",
        "He seems to be very eager to make money and become rich.",
        "He’s an easy-going person and is casual about everything.",
        "He always tries to prevent changes.",
        "He has a positive outlook on life.",
        "She’s well-educated and has a very cultivated mind.",
        "He’s been having difficulties, and he was unhappy and sad.",
        "I spoke to him for a long time, but I couldn’t shake him out of his attitude.",
        "He has a short temper, and it often gets him into difficulties.",
        "He’s got a negative attitude, and he always makes you feel unhappy and without hope.",
        "He finds decisions/choices like these very difficult to make.",
        "He always speaks out about whatever disturbs him.",
        "Someone else’s misfortune makes him happy and excited.",
        "She never treats matters like these seriously.",
        "He feels sorry/guilty whenever he does something wrong.",
        "He was not in the right frame of mind to speak to them, and so he refused to see them.",
        "That food hasn’t agreed with me — I have a strange feeling in my stomach.",
        "They had helped him, and he felt that he had a duty to them.",
        "If anyone harms him, he’s sure to harm them in return.",
        "Her attitude made everybody angry.",
        "She’s a happy child.",
        "He was disappointed by what happened, and he felt miserable/ unhappy.",
        "He doesn’t show any respect for the practices and procedures in the company.",
        "He always approaches problems in a practical way.",
        "His attitude was unhelpful.",
        "His main feeling was of great relief.",
        "Whenever he does anything, he pays full attention to it.",
        "He appreciates good food.",
        "He always gives a fair opinion of everything.",
        "He’s more influenced by emotional feelings than by careful thought.",
        "She always acts selfishly.",
        "She has a happy attitude to life.",
        "People here consider him as a nuisance.",
        "He felt so attracted to her that he couldn’t think about anything else.",
        "He’s a daring person, and he isn’t afraid of anything.",
        "I’ve never heard him express regret about anything.",
        "He was impressed by the way they dealt with the matter.",
        "His tastes are very refined and sophisticated.",
        "He has a happy, friendly temperament.",
        "He gets pleasure from being cruel to other people.",
        "He felt strong dislike/impatience about what was going on.",
        "He’s a tough person and has a strong character.",
        "He doesn’t like to do anything that’d make him unpopular.",
        "There’s a general feeling of dissatisfaction with the company’s policies.",
        "He’s quite impractical.",
        "He deliberately makes people suffer — I can’t understand his mentality.",
        "He only looks at problems from his own point of view.",
        "She’s very friendly and always tries to solve her problems without quarrelling.",
        "He has strong prejudices/opinions and won’t change them even when he’s proved wrong.",
        "He’s a very down-to-earth person and is prepared to enjoy life.",
        "He was sorry for what he had done and regretted his actions.",
        "He’s a confident man, and he’s sure about his abilities.",
        "He’s a very emotional man.",
        "He’s a calm person.",
        "I didn’t say all those things, because I didn’t want to hurt his feelings.",
        "He has a criminal mentality.",
        "She has a strange outlook on life.",
        "He believes in allowing other people to do and say as they like — even if he doesn’t agree with them.",
        "He very much wanted that there should be no delay.",
        "She’s very sentimental about her childhood.",
        "She always boasts about how successful her husband is.",
        "Everybody has a bad opinion of him.",
        "His opinions are usually clear and definite.",
        "She has good manners and she’s always careful not to hurt other people’s feelings.",
        "He seems to be in a good/bad temper today.",
        "He’s easy-going and doesn’t worry about the future.",
        "He sounded depressed — as if he had no hope.",
        "He’s not very confident and is afraid of failing, and so he doesn’t take strong action.",
        "He never expresses his opinion/intentions clearly.",
        "He never helps anyone willingly.",
        "When he heard the news, he felt happy, and he was full of excitement."
    ]
}