{
    "key": [
        "She withdrew Rs. 1,000 from her bank account.",
        "He paid the cheque into his account.",
        "I’d like to make a deposit, please. We’ve been trying to arrange a loan from the bank.",
        "He’s gone to put some money in his bank.",
        "Interest is not allowed on a current account.",
        "I get a statement from my bank every month.",
        "I want to cash a traveller’s cheque.",
        "I think he drew some money out of the bank yesterday.",
        "How much do I have to my credit?",
        "I took Rs. 500 out of my bank account.",
        "When was the draft issued?",
        "He had no money in his account, and so the bank stopped the cheque.",
        "The bank has allowed him to overdraw his account up to Rs. 50,000.",
        "How much money have I got left in my account?",
        "He’s the cashier. He receives payment from customers and cashes cheques for them.",
        "I drew a lot of money out last month.",
        "I need a new cheque-book.",
        "Was the cheque paid over the counter or through the clearing?",
        "I’m thinking of taking out a bank loan.",
        "He made an application to open an account without an introduction.",
        "This is a crossed cheque and it must be put into a bank account.",
        "How much interest will my savings earn in the bank?",
        "His account looks healthy at the moment.",
        "I need to borrow 10,000 rupees.",
        "Who do I make the cheque payable to?",
        "We had to pay 20% interest on the loan.",
        "The bank manager has agreed to let me have an overdraft.",
        "Can you let me have 20 or 30 cheques?",
        "I’m thinking of closing my account with that bank.",
        "They’re gradually reducing their overdraft.",
        "Your account is in credit.",
        "Has the bank credited the cheques to your account?",
        "Don’t try to cash that cheque today. It’ll bounce if I don’t put some money into my account.",
        "I’d like to withdraw Rs. 10,000 from my account, please.",
        "You’ve forgotten to sign the cheque.",
        "Where do they bank?",
        "I’m afraid your account is Rs. 4,750 in the red.",
        "Fortunately, our account is now in the black.",
        "We’ve asked the bank for a large loan.",
        "The bank only deals with honest and responsible people.",
        "You have a credit balance of Rs. 5,500.",
        "Before you deposit the money, you’ll have to enter the amount on a paying-in slip.",
        "That’s a draft drawn on the Kochi branch of your bank.",
        "I’d like to make a transfer from my current account to my savings account.",
        "The banks are lending to small scale industries at much lower rates.",
        "He kept a satisfactory credit account for some time and then suddenly asked for temporary accommodation.",
        "Can you make a draft on the Bombay branch of the bank?",
        "I haven’t put any money into my account last month.",
        "He has asked the bank to increase his overdraft from Rs. 25,000 to Rs. 50,000.",
        "He deposits Rs. 50 a week into his savings account.",
        "I’ve invested all my money in the bank.",
        "He gets 12% interest on his money at the State Bank.",
        "He keeps an excellent account and is a man of high standing.",
        "The bank has agreed to back us, and we’re planning to go ahead with the scheme.",
        "You must sign on the back of the cheque.",
        "Did you have to deposit any security to get the loan?",
        "We bank with the State Bank of India.",
        "He has plenty of money in the bank.",
        "If you want to borrow, you can’t object to giving proper security.",
        "The bank has credited you with Rs. 150.",
        "He has a healthy bank balance.",
        "They’ve kept a good account with the bank for years.",
        "We had to borrow heavily from the bank to start this business.",
        "Most of the bank’s customers are of good financial standing and sound reputation.",
        "I paid both the cheques into my bank account.",
        "What’s the rate of exchange for pounds?",
        "I’d like to exchange my dollars for rupees.",
        "You’re overdrawn by Rs. 5,000.",
        "Have you reduced the overdraft?",
        "He keeps a lot of money in banks at interest.",
        "Last week, you drew three cheques on your account.",
        "The overdraft is secured by a guarantee.",
        "You make out a cheque to him for Rs. 5,000.",
        "Has he cleared his overdraft yet?",
        "I’m in the red and the bank manager is after me.",
        "The bank only lends money on security.",
        "This is a bearer cheque. Anybody can cash it at the bank.",
        "The bank wants the personal guarantee of the directors.",
        "He deposited quite a lot of money recently.",
        "Be sure to bank the money before 2 o’clock.",
        "The bank manager asked him about his income and assets — and his nature of business.",
        "My bank account shows two debits — one of Rs. 150, and another of Rs. 200.",
        "Your account shows credits of Rs. 10,000 and Rs. 15,000 during this month.",
        "I’ve paid the cheque into my account for collection.",
        "The bank lends at 18% interest.",
        "He filled up a pay-in slip and deposited the money with the bank.",
        "He went to the bank and drew out all his savings.",
        "How many days will the bank need to collect the cheque?",
        "What’s the exchange rate of the dollar today?",
        "I have a large overdraft.",
        "Was the cheque made payable to the bearer or was any person named in it?",
        "Banks don’t give you interest on current accounts.",
        "His account is overdrawn, but his wife’s account is in credit.",
        "You write him a cheque, and cross it, so payment can only be made through a bank.",
        "How about the financial position of the guarantors?",
        "Are they customers of the bank?",
        "The bank may ask for security if you want an overdraft.",
        "Is this cheque in order?",
        "You don’t have to pay back the whole loan at once. You can pay it back in ten instalments.",
        "She has a good sum of money put away in the bank for her old age.",
        "Where can I get this cheque cashed?",
        "You can’t blame the bank for asking for security for their money.",
        "The money has been credited to your account.",
        "Pay this cheque into your account.",
        "Your bank will then collect the amount of the cheque from the bank it’s drawn on and credit it to your account. Your bank will, of course, deduct a small collection fee from your account.",
        "How much interest do they charge on loans?",
        "The bank only discounts bills for a customer who keeps a current account.",
        "It was a dud cheque, and it bounced.",
        "His monthly salary is paid into the bank by the company.",
        "He got a Rs. 10,000 loan from the bank.",
        "Your bank account is overdrawn.",
        "The loan was allowed for business purposes.",
        "Our bank allows us to run up an overdraft on our current account.",
        "When did you lodge the deeds with the bank?",
        "The bank stopped payment of his cheque.",
        "How many cheques did we draw last month?",
        "How much do you need to take out of the bank?",
        "When did you present the cheque to the bank?",
        "I paid the cheque into his account.",
        "Our account will be nicely in the black next month.",
        "Last week, we overdrew by Rs. 50,000.",
        "Normally the bank doesn’t like to make unsecured advances.",
        "I’ll have to check the entries in the pass book.",
        "I’d like to open a savings account.",
        "Is there a fixed minimum deposit?",
        "We’re going to take out a loan to expand our business.",
        "Is that a cheque drawn on the State Bank of India?",
        "Can you tell me the amount of my current balance?",
        "The cheque was paid into his current account.",
        "The bank has agreed to finance the new business.",
        "They gave me a bank draft for Rs. 5,000.",
        "The bank charges me 20% interest on the loan.",
        "Are you planning to leave money in the bank for a long time?",
        "The bank has allowed a loan of Rs. 10,000 on a joint account in their names.",
        "The bank dishonoured his cheque. He didn’t have enough money in his account to cover it.",
        "This cheque has been drawn payable to Mr. Menon. So he’ll have to endorse it by signing his name on its back.",
        "He borrowed the money on the security of his house.",
        "It’ll take three days for your cheque to clear.",
        "I paid the money in yesterday.",
        "What a relief! At last, our account is out of the red!",
        "Cash me this cheque please.",
        "The bank manager wants us to clear the loan immediately.",
        "The bank has debited Rs. 500 against my account.",
        "The bank can’t grant you a loan if you can’t offer a guarantee or other security.",
        "Bank interest rates are going to rise this month.",
        "Banks usually exercise caution in taking new accounts.",
        "I’ve got some money in the bank.",
        "I don’t think this cheque is in order. The amount in words doesn’t correspond with the figures.",
        "The bank has given us an overdraft of Rs. 1,00,000.",
        "I have an account with that bank.",
        "What did he borrow the money for?",
        "I’m trying to reconcile the bank statement with our records.",
        "I don’t think the balance on your account is large.",
        "I went to the bank to draw out my deposit.",
        "He has a current account with the bank, but the advance was made on a separate loan account.",
        "He keeps his savings in the bank.",
        "The loan is being paid back by monthly instalments.",
        "Has the cheque cleared yet?",
        "Their account has been working very satisfactorily.",
        "He’s thinking of investing his money in (or with) the bank.",
        "I don’t know how much money he has taken out of his account.",
        "He’s always overdrawn with the bank to the full extent of his limit.",
        "The bank advanced him Rs. 25,000 to start his business.",
        "Put the cheque in a safe place. It mustn’t fall into the wrong hands.",
        "His salary is paid directly into his bank account.",
        "Is that a cheque for a large sum?",
        "Why don’t you ask your bank for a loan?",
        "The cash was paid into his savings account.",
        "The bank sends us an account every month.",
        "I want to open an account with that bank.",
        "This cheque is payable to the bearer.",
        "The bank can’t give you any more credit until you repay the previous loan.",
        "The bank statement balance would often differ from the depositor’s book balance.",
        "He deposited the money in the bank.",
        "He says the cheque is valid for six months from the date of issue.",
        "The bank refused to honour his cheque.",
        "Who do you bank with? State Bank?",
        "Did the bank have trouble in getting repayment?",
        "Your cheque will take three days to clear.",
        "The bank will insist on collateral security for a loan of that size.",
        "She drew some money from her account.",
        "He defaulted on that loan, and the bank took him to court.",
        "She drew a cheque on her Madras bank.",
        "Whose account was the cheque paid into?",
        "The bank gave (or made) me an advance of Rs. 25,000 to start my business.",
        "They have two accounts and both are always kept in credit.",
        "My wife and I have a joint account with that bank.",
        "The bank refused payment of the cheque for some reason.",
        "He didn’t have enough money in his account to cover the cheque, and so it bounced.",
        "That’s an open cheque and not a crossed one. You can cash it over the counter.",
        "It’s better to bank your money than to keep it at home.",
        "Can you cash a cheque for me?",
        "You’ll have to find somebody to guarantee the overdraft.",
        "When was this cheque credited to my account?",
        "I handed the money to the cashier.",
        "He drew a cheque on his current account and paid it into the credit of his savings account.",
        "The bank was closed, and so I couldn’t cash the cheque.",
        "How much has the bank deducted from the account for service charges?",
        "You may need to use the house as security for the loan.",
        "His money is drawing interest in the bank."
    ]
}