{
    " Group 1 ": [
        "What I like about her is, she isn’t shy or embarrassed in the company of other people.",
        "He’s very harsh/cruel, and will do anything to get what he wants.",
        "He’s friendly, and enjoys talking to other people.",
        "He behaves differently from other people.",
        "He avoids too much of eating/drinking.",
        "I found him willing and eager to be helpful.",
        "He’s lively and enthusiastic.",
        "He’s very concerned about unimportant details and is very difficult to please.",
        "She frequently changes her mood without warning.",
        "He was angry and upset.",
        "His behaviour was stupid and insensitive.",
        "She never does what she’s told to do.",
        "She was in a bad situation, and she was willing to do anything to get out of it.",
        "He’s stubborn and determined to have his own way.",
        "She behaved as though she felt at ease.",
        "He has the courage to do what he believes is right.",
        "He allows things other people disapprove of.",
        "He’s very aggressive and eager to argue.",
        "I found him humble and unassuming.",
        "Even when he knows what he has done is wrong, he doesn’t feel guilty or sorry about it.",
        "That was a difficult situation, but she was calm and unemotional.",
        "Stop behaving like a woman, can’t you, Ashok?",
        "He’s very unwilling to spend money.",
        "He’s very reliable and respectable.",
        "I found him very confident and assured.",
        "She was very upset and was behaving in an uncontrolled way.",
        "Those children are noisy and not easily controlled.",
        "He’s not careful in obeying rules.",
        "She often complains about things.",
        "She’s very sensitive and sympathetic towards other people.",
        "She’s rather reserved and behaves very correctly.",
        "He keeps trying to make people like him.",
        "She feels embarrassed and nervous when someone is looking at her.",
        "He’s not afraid of doing things even if they involve risk/danger.",
        "I think he’s too confident and aggressive.",
        "He’s very mean and hates spending money.",
        "He gave the impression of being dishonest.",
        "He was lively and entertaining.",
        "Sometimes he behaves in a silly way, rather than being serious and sensible.",
        "He only helps people if he thinks they’re important.",
        "She’s always at ease in social situations.",
        "He’s full of wit/humour.",
        "He’s respectable, wellbred and refined.",
        "She’s polite and has good manners.",
        "He behaves as though he has no emotional interest in the things he does.",
        "They were too eager to obey their boss and to do things for them.",
        "They were cowardly, or they wouldn’t have attacked that old lady.",
        "He felt so happy and excited, he found it hard to think and act normally.",
        "He looked slightly embarrassed — as though he felt he had done something silly.",
        "She was very helpful and polite.",
        "It was a frightening situation, but he was brave.",
        "He’s weak and cowardly.",
        "It was a frightening experience, but she was very calm and self-controlled.",
        "She’s very kind and sympathetic towards other people, and she tries to do them as little harm as possible.",
        "She was very friendly and relaxed.",
        "I found him quiet and not aggressive.",
        "He likes to have fun embarrassing people.",
        "He behaves/speaks as though he’s superior to other people.",
        "He behaves in a gentle and helpful way towards other people.",
        "He was nervous and excited and seemed likely to lose control of himself.",
        "He does a lot of dishonest/illegal things every day.",
        "That child is very spirited and playful.",
        "He often gets involved in arguments.",
        "She’s very quiet and rather shy.",
        "He doesn’t take enough care over how his words will affect other people.",
        "The children were noisy, lively and full of energy.",
        "He behaves in a way that’s too lively.",
        "He doesn’t talk much about his abilities and qualities.",
        "He is very dishonest and secretive.",
        "He never understands how complicated things can be at times, and he interprets them in a way that’s too simple.",
        "He doesn’t show any feelings or emotions.",
        "He strongly supports people he likes, without thinking carefully about the matter.",
        "He always says unkind things.",
        "He appeared to be relaxed and was not trying to hide anything.",
        "Our nextdoor neighbours are very friendly and helpful."
    ],
    " Group 2 ": [
        "He’s very religious and moral.",
        "He was angry, irritated and bored.",
        "He was worried and unhappy about something.",
        "She’s cheeky, but lively and full of energy.",
        "She’s easily upset by unpleasant sights and situations.",
        "He won’t hesitate to take risks to achieve what he wants.",
        "It was a dangerous situation, but she showed courage.",
        "He’s too self-confident and rather cheeky.",
        "He gets angry quickly and easily.",
        "He recognizes and accepts the true nature of situations, and tries to deal with them in a practical way.",
        "He never gives any importance to other people’s opinions or beliefs.",
        "He’s always careless about doing things.",
        "He was so upset and worried that he couldn’t think clearly.",
        "He’s very cheeky and always speaks rudely/disrespectfully.",
        "I found his behaviour/accent very artificial.",
        "He always behaves in a formal and unfriendly way.",
        "He’s lively and full of enthusiasm and excitement.",
        "He only agrees with people if he considers them to be important.",
        "He has no hesitation in doing things even if they’re morally wrong.",
        "He has an enthusiastic nature and is interested in everything he does.",
        "He’s playful and unpredictable rather than serious and practical.",
        "Why do you hesitate to show affection openly and freely?",
        "He has a strong belief in democracy.",
        "He becomes angry and upset very quickly about small, unimportant things.",
        "He’s rather shy and doesn’t enjoy talking about himself.",
        "He’s very careful and detailed in his work.",
        "He’s willing to try out new and unusual ways of doing things.",
        "He’s prepared to be cruel to other people and feels no pity for them.",
        "He was angry and said a lot of bitter things.",
        "He’s very gentle, and he doesn’t get angry very easily.",
        "He’s very naïve and believes that everybody is honest.",
        "He’s a noble person.",
        "Our new boss is bad-tempered and is easily irritated.",
        "He’s quiet and shy.",
        "Her son is disobedient and behaves very badly.",
        "Your behaviour was so bad that you ought to be ashamed.",
        "Our new boss is very strict and serious — I don’t like him.",
        "She must have been very courageous to go into the burning building.",
        "She always talks/behaves in a rude and offensive way.",
        "She’s very lively and easily excited.",
        "He’s a mild person, and he never shouts at other people.",
        "He behaved as though he didn’t like/respect them.",
        "He’s full of confidence and energy.",
        "She seemed cold and aloof.",
        "He does things suddenly without thinking about them first.",
        "She’s always ready to quarrel.",
        "He always behaves in a proud and unpleasant way towards other people.",
        "She deals with situations without anxiety or emotional tension.",
        "His behaviour was silly and immature.",
        "At parties and other social occasions, you can always expect correct and proper behaviour from him.",
        "He has a lot of enthusiasm for photography.",
        "What I don’t like about him is, he tries to get things done in a forceful way.",
        "He was very excited and happy.",
        "Most of us found his behaviour unacceptable.",
        "I found him cold and emotionally detached.",
        "He’s very stern, and he expresses it in his tone of voice.",
        "Both his children are wellbehaved.",
        "He behaves in a strange/peculiar way.",
        "He behaved disgracefully towards them.",
        "He didn’t agree with it, and he said he won’t allow it to happen.",
        "He takes delight in causing distress to people.",
        "His behaviour is always logical and detached and does not involve any emotion.",
        "I have never seen him show fear in difficult/dangerous situations.",
        "He’s very secretive and deceitful.",
        "He’s always determined to do what he wants and refuses to change his mind.",
        "She’s a bit shy, but she enjoys being noticed by other people.",
        "He’s very sincere, and he really means the things he says.",
        "He was very excited about his new job, and he didn’t hesitate to show how much he liked it by the way he behaved and talked.",
        "My grandfather is past 80, but is still physically active.",
        "He frequently changes his mind without warning.",
        "He seems very calm and not to worry or care about things.",
        "He does nasty things to people he dislikes.",
        "He behaves in a rude and unsophisticated way.",
        "He’s not careful in maintaining high standards.",
        "He’s not the type of person who’s easily upset.",
        "He’s not very intelligent, and he’s easily fooled.",
        "She was courteous, but firm.",
        "He behaved in a stupid and annoying way.",
        "She wants to control everything, rather than let people decide things for themselves.",
        "He shows no feelings of pity.",
        "He often says tactless things and upsets people.",
        "He’s always uncertain and embarrassed and doesn’t do anything quickly.",
        "He’s clever and cunning, and he often deceives people.",
        "Her approach has always been helpful, rather than negative or unhelpful.",
        "He keeps doing things that he has no right to do.",
        "He acted as though he had too much of the same thing and was bored.",
        "She’s too proud of her intelligence/taste.",
        "She’s always ready to disagree with other people — that’s what I dislike about her.",
        "He doesn’t consider situations carefully enough, and only does the most obvious or least difficult things.",
        "He deals with problems carefully and tactfully, and avoids upsetting/offending people.",
        "The problem is, most of those boys lack discipline and control.",
        "He says those people have low standards of morality.",
        "She was unwilling to do it, and hesitated before doing it.",
        "The trouble is, you do things without having enough information.",
        "He isn’t afraid of doing things that are dangerous.",
        "He doesn’t always show enough respect for the position of the person he’s talking to.",
        "He’s cruel, violent and uncivilized.",
        "He’s very tactful and can do things without offending people.",
        "She was bitter and angry.",
        "She sounded envious.",
        "He’s not as strict as expected.",
        "He thinks about himself a lot and admires himself too much.",
        "He’s decided to resign and is determined not to change his mind about it.",
        "He always thinks in an unusual/ original way.",
        "He’s very thorough, exact and careful about details.",
        "He’s very cruel and deliberately causes pain to people.",
        "He doesn’t want to make any effort to do anything.",
        "I think he has strong feelings about this issue.",
        "She was very polite and respectful, but firm.",
        "He believes people should be free to do as they like.",
        "Her grandfather always behaves in a way that’s socially correct.",
        "He’s a very enthusiastic reader.",
        "He deliberately does things even if they result in harm for himself.",
        "He handles things in a careless and awkward way.",
        "He always speaks loudly and is cheerful and energetic.",
        "He doesn’t show any concern for the effect of his actions on other people.",
        "She always pays attention to the feelings/needs/wishes of other people.",
        "Her behaviour pleases everybody and makes them feel friendly towards her.",
        "He’s an easy person to deal with.",
        "He always deals with things in a practical way.",
        "You’re being silly and childish.",
        "She’s always ready to start quarrelling with other people."
    ],
    " Group 3 ": [
        "He has strong views on everything, and this makes him difficult to deal with.",
        "She behaves too correctly and is too easily shocked by anything rude/improper.",
        "He does things carefully and deliberately.",
        "He’s pessimistic and cynical.",
        "He doesn’t care at all about morals.",
        "He always behaves in a serious way, as though he thinks he’s more important than he really is.",
        "Don’t follow what your lawyer says without thinking about it.",
        "He’s very bold and doesn’t care what other people think about his behaviour.",
        "He speaks very confidently and frankly.",
        "If she makes a decision, she refuses to be persuaded to change it.",
        "He’s always unfriendly and unhelpful.",
        "He’s always serious and thoughtful.",
        "He’s fair with people even in difficult circumstances.",
        "He can be really nasty at times.",
        "Young people like them seem to forget they’re no longer children.",
        "He was nice to me, but I found him very tense and anxious.",
        "He behaves in a calm way and is not easily made angry or upset.",
        "She’s impatient and easily irritated.",
        "He’s clumsy and awkward.",
        "He’s very impolite and doesn’t show any interest in what other people are saying.",
        "He’s a polite and courteous person.",
        "He deliberately tries to cause harm.",
        "He doesn’t easily become excited/upset.",
        "One thing I like about him is, he’s very enthusiastic about everything he does.",
        "She was polite, but not particularly friendly.",
        "He’s cruel and unkind and has no sympathy for anyone.",
        "From what he said, I think he’s willing to end his disagreement with them.",
        "He always causes annoying problems and difficulties.",
        "He doesn’t give anything the attention or consideration it should be given.",
        "He has extremely strong feelings about everything he’s interested in.",
        "He shows no respect in the way he behaves towards people.",
        "He’s easily annoyed.",
        "Most of those people were simple and unsophisticated.",
        "He shows a lot of aggression/independence.",
        "He won’t hesitate to put people in danger.",
        "He’s sincere in what he’s doing.",
        "He’s gentle and quiet and does what other people say.",
        "He isn’t rash at all — he’s sensible and careful.",
        "She found him rather dull and unexciting.",
        "He did it without enthusiasm.",
        "She’s very sharp and insensitive and says things that hurt other people’s feelings.",
        "He doesn’t always show enough respect for the feelings of the person he’s talking to.",
        "She deals with people with a charming smile.",
        "He can understand and judge a situation quickly.",
        "He believes that everyone should have the same rights and opportunities as each other.",
        "She behaves as though she doesn’t want to be friendly with other people.",
        "He’s very pleasant and friendly, and you can easily approach him.",
        "He always thinks in a rebellious way.",
        "When he wants to achieve something, he has no hesitation in deceiving people.",
        "He isn’t tolerant of different opinions.",
        "He tries to appear virtuous and morally better than other people.",
        "His manner was very polite.",
        "His behaviour seemed false and artificial.",
        "He flatters people too much and is too polite.",
        "He shows no feelings of mercy.",
        "He seems to be very eager to become rich.",
        "He often does things that are unreasonable.",
        "One thing about him is, he’s very unselfish.",
        "She’s determined to do what she wants.",
        "He’s too concerned with unimportant details.",
        "She’s very excitable and easily frightened.",
        "He’s calm and can control his feelings.",
        "He’s annoying and troublesome.",
        "He and his wife are always arguing and disagreeing about things.",
        "He shows disrespect for all religions and religious things.",
        "Whenever you ask him to do something, he does it promptly/enthusiastically.",
        "He behaves as though he’s better or more important than others.",
        "He doesn’t show respect for people and things that are generally respected.",
        "He’s very loving and shows a lot of affection in his behaviour.",
        "He behaves as though he isn’t willing to obey anyone.",
        "He believes his actions and beliefs are important, and he’s very sincere and serious in whatever he says or does.",
        "He always makes plans on a large scale.",
        "She accepted it quickly and eagerly.",
        "Whatever he says is very brief and unfriendly.",
        "He’s eager to tell people what to do when he should not.",
        "He behaved atrociously.",
        "He agreed to do it, but acted as though he’s superior to us and he doesn’t have to do it.",
        "She doesn’t enjoy being noticed by other people.",
        "He’s very thoughtful, and he never tries to upset other people.",
        "That was a dangerous situation, but he behaved bravely.",
        "He has no courage to take drastic measures.",
        "He always behaves as though he’s important.",
        "He says and does things quickly and abruptly, and doesn’t show much consideration for other people.",
        "He’s stingy and doesn’t spend much money.",
        "She behaves as if she doesn’t want to be closely involved with other people.",
        "His new secretary is very competent, and she has the ability to make people less angry/ hostile.",
        "He’s always correct and serious rather than relaxed and friendly.",
        "His behaviour is amusing and often a little shocking.",
        "He was behaving in a very unnatural way and was trying to impress people.",
        "He’s willing to do things that might shock other people.",
        "He always does things in an orderly fashion."
    ],
    " Group 4 ": [
        "She always shows a strong desire to get things that belong to other people.",
        "His behaviour was horrible and disgusting.",
        "He treats everybody the same as each other, regardless of their differences.",
        "I found him unreasonable and difficult to deal with.",
        "He never treats anything as important or serious.",
        "There was a coldness in him that frightened me.",
        "He did it without any real effort, interest or enthusiasm.",
        "He has dignity and self-respect.",
        "She accepts what other people do without complaining.",
        "She’s rather rude and doesn’t have good manners.",
        "He’s very quicktempered and becomes angry easily.",
        "He loses his temper and gets upset quickly.",
        "I don’t think his decision was based on any principle — it seems quite unfair.",
        "He’s calm and reasonable, and he’s not affected by emotions.",
        "He’s lively and energetic and never seems to be depressed.",
        "He refuses to obey his elders and shows aggression.",
        "He’s always ready to start a fight.",
        "She sounded as though she expected something enjoyable/interesting to happen.",
        "He takes care to do what’s fair, honest and morally right.",
        "Don’t expect a dictator like him to be kind and tolerant.",
        "He’s an unpleasant person, and is cruel and violent.",
        "He expresses his opinions in a strong and confident way.",
        "She’s always cheerful and happy.",
        "She wanted to impress us with her wealth/importance.",
        "He speaks easily and persuasively, but isn’t sincere.",
        "He’s very rude and has no consideration for the feelings of other people.",
        "He deliberately avoids giving clear, direct answers to questions.",
        "She always keeps her feelings hidden.",
        "If you really love your wife, why don’t you show it in the way you behave towards her?",
        "He doesn’t think/behave in the way that people in his society usually think/behave.",
        "He’s very bold and is willing to do things that are dangerous.",
        "He often does things that are extremely risky.",
        "He feels that everyone is looking at him and judging him, and he’s easily embarrassed.",
        "She’s easily frightened, and she avoids doing dangerous and difficult things.",
        "He always tries to make other people think that he works hard.",
        "Don’t behave like a baby.",
        "She was behaving in a childish and immature way.",
        "I found him badtempered and miserable/unhappy.",
        "Her father is very loving and affectionate.",
        "She changes her attitude quickly and frequently.",
        "It was a serious situation, but she behaved as though she doesn’t need to worry or do anything about it.",
        "He always behaves in a rather impolite and disrespectful way.",
        "His behaviour seemed strange and eccentric.",
        "He’s too proud of his social status.",
        "He’s very lazy and is not interested in doing anything at all.",
        "He’s dishonest and can’t be trusted.",
        "He’s always behaving in a noisy and violent way in public.",
        "He’s not afraid of being unpopular.",
        "He’s very polite and respectful towards other people.",
        "He’s always careful to behave correctly.",
        "She was eager to show the photos to me.",
        "He was just trying to seem important when he said all those things.",
        "He’s very hostile and aggressive.",
        "He’s very determined and has the ability to cope with difficult situations.",
        "He deliberately plans to get what he wants, even by harming other people.",
        "He was trying to make everybody think that he was ill.",
        "He always tries to avoid embarrassing/offending people, and he’s polite and careful in what he says.",
        "She was so happy, her happiness showed on her face.",
        "Whenever he judges other people, he’s completely fair.",
        "What he did was not sensible and showed a lack of good judgment.",
        "What I don’t like about him is, he always tries to please others.",
        "He isn’t taking his work as seriously as he should.",
        "He behaved as though he was expecting something unpleasant/ horrible to happen.",
        "One thing about him is, he’s not afraid at all, and I admire him for this.",
        "She was modest without being shy.",
        "Our new boss demands hard work and a great deal of care.",
        "She accepts unpleasant situations without complaining.",
        "She’s a backward child and has a lot of difficulty in learning.",
        "Don’t be so casual — you should take account of the seriousness of the situation.",
        "He’s very bad-tempered and complains a lot.",
        "He spends a lot of money carelessly and he doesn’t think about what’ll happen when he has none left.",
        "He behaves as though he’s too pleased with himself.",
        "He refuses to change his attitude to things.",
        "He deliberately doesn’t do what his boss tells him to do.",
        "He acts towards people in a detached way, and he doesn’t care particularly who they are.",
        "He’s very anxious to get that contract.",
        "He often makes mistakes and behaves foolishly.",
        "He behaved as though he felt unsure or threatened.",
        "She’s too concerned with traditional customs and beliefs.",
        "His behaviour is very respectable, calm and polite.",
        "He’s very difficult to influence.",
        "He has a rather severe and unfriendly manner.",
        "She holds back her emotions and doesn’t express them.",
        "He was too smart and confident, and I found him rather unpleasant.",
        "She was very mean and spiteful.",
        "Don’t forget you’re doing something you have no authority or right to do.",
        "His behaviour was not genuine/natural, but was intended to impress other people.",
        "He always behaves like a gentleman.",
        "She keeps adjusting her hair all the time.",
        "He always speaks in a confused way.",
        "He always talks very excitedly and says a lot of unnecessary things.",
        "He often takes decisions quickly and suddenly without thinking.",
        "He was acting like someone who had lost their memory.",
        "He’s awkward and uncomfortable in the company of other people.",
        "He speaks honestly and openly about things.",
        "He always behaves as though he’s in a position of power.",
        "He’s a calm person and doesn’t show any worry.",
        "She behaves in a gentle and caring way towards other people.",
        "What’s the good of bringing about social/political change by hurting people?",
        "He thinks that other people are inferior/ unimportant.",
        "He’s not as severe as expected.",
        "He behaves in a rather nervous way and becomes excited very easily.",
        "I don’t think he has any clear purpose or plan.",
        "He’s not very serious, and he keeps changing from one activity to another.",
        "He doesn’t care about danger.",
        "He behaved as though he had no hesitation in harming us.",
        "His views are often extreme/fanatical.",
        "He shows strong feelings about things he’s interested in, and is very sincere and enthusiastic about them.",
        "I found him irritating.",
        "I have seen him flattering his boss very often.",
        "He’s secretive and clever at deceiving people.",
        "His attitudes and ideas are based on old-fashioned opinions.",
        "He tolerates things that other people disapprove of.",
        "He’s a very cautious man, and he does everything very carefully.",
        "His behaviour was deliberately deceitful.",
        "He always shows respect for his elders.",
        "She always shows pity, sympathy and understanding for people who are suffering.",
        "He never supports his friends — he even does things that could harm them.",
        "He’s noisy and rough and always causes trouble.",
        "She’s very anxious that they shouldn’t misunderstand her.",
        "He’s eager to tell her the news, and he doesn’t want to wait.",
        "He’s very difficult to control."
    ],
    " Group 5 ": [
        "He keeps misleading us and encouraging us to believe what’s not true.",
        "He always does things secretly rather than openly.",
        "His opinions are clear and definite.",
        "He was determined and courageous.",
        "He was happy and pleased, and he had a big smile on his face.",
        "He never shows any anger or excitement.",
        "I’ve never found him eager to be involved in any activity.",
        "He’s always interested in things that don’t concern him.",
        "Whenever things don’t happen the way he wants them to happen, he’s cross and dissatisfied.",
        "You behaved badly yesterday.",
        "He was so happy that he couldn’t relax.",
        "She talks a lot.",
        "She behaves as though she’s right in her attitudes and beliefs, and other people are wrong.",
        "He’s always very lively, and he enjoys everything that he does.",
        "He acted as though he wanted to finish the work as soon as possible.",
        "He’s brave and is not easily frightened.",
        "He’s not very reliable, and he keeps changing from one idea to another.",
        "He behaves as though he has rejected the values of society/his parents.",
        "He’s bad-tempered and unpleasant to people.",
        "Her opinions are too extreme.",
        "He has good manners and is not rude to other people.",
        "He’s a bad person — he always behaves in a way that’s harmful to people.",
        "He behaved as though he was not very concerned about what was happening.",
        "He’s quiet and serious in his behaviour.",
        "He’s shy and avoids meeting other people.",
        "He lacks taste, education and good manners.",
        "He always criticizes people nastily and in a sarcastic way.",
        "He acted as though he was not going to benefit from what was going on.",
        "He was impatient, bored and dissatisfied.",
        "She was very nervous and worried about something.",
        "He’s easily irritated by things.",
        "He’s very honest and upright.",
        "His behaviour was very shocking.",
        "He’s rude to people he ought to be respectable to.",
        "He keeps behaving in a dishonest way.",
        "She’s very reserved and doesn’t tell people about things.",
        "He shows a lot of love for his kids.",
        "He often acts without thinking carefully first.",
        "He doesn’t care that he’s been behaving wrongly.",
        "I’ve always found him eager to gain something out of other people’s weakness/suffering.",
        "He’s always finding things to complain about.",
        "He enjoys playing harmless tricks on people.",
        "He doesn’t care about the effect his behaviour will have on other people.",
        "He’s dishonest and insincere in everything he says.",
        "He’s wellmannered and has good taste.",
        "He was angry and worried, and he couldn’t relax.",
        "He can change easily and adopt to different conditions and circumstances.",
        "He doesn’t like to socialize, and he isn’t very friendly towards other people.",
        "He keeps changing his mind about what he wants.",
        "She’s brave and is not easily discouraged.",
        "He kept on refusing to change his mind about resigning and I felt he was being stubborn.",
        "He achieves what he wants in a clever way, even by deceiving people.",
        "I think his behaviour was too extreme.",
        "He’s stubborn and unco-operative and is unwilling to do what he’s told.",
        "I find his attitudes morally unacceptable.",
        "He’s quick to react to difficult situations.",
        "He’s very casual and unconcerned about everything.",
        "His behaviour was impolite and unrefined.",
        "He’s unsympathetic to other people’s feelings.",
        "His behaviour showed lack of good manners.",
        "He gets annoyed when he has to wait too long for anything.",
        "He acted as though he wasn’t interested in what was going on.",
        "Our old boss was very fussy and difficult to please.",
        "He’s a very anxious person.",
        "He spends time in a lazy way, doing nothing in particular.",
        "Even when things became difficult, she was determined to continue with her research studies.",
        "He’s always trying to make us believe what’s not true.",
        "He shows his dislike and anger in a quiet, controlled way.",
        "He tries to control other people, without any consideration for their feelings or opinions.",
        "If he’s determined to do something, he refuses to give up, even if what he’s doing is unpleasant/cruel.",
        "He behaved in a cruel way.",
        "He’s always finding things to argue about.",
        "He’s a mischievous child.",
        "He keeps trying to do things he wants to do, even though other people are against them.",
        "Generally, he acts in a fair and unselfish way.",
        "The way he talks makes you feel very happy and enthusiastic.",
        "He was bored, and he kept moving his hands and feet.",
        "He’s very friendly and pleasant to be with, but a bit reserved.",
        "She tries to make other people do what she wants, without any consideration for their feelings or opinions.",
        "She’s full of energy and cheerfulness.",
        "He’s been hiding his real feelings.",
        "I found his behaviour very strange.",
        "He refused to pay attention to our pleas and arguments.",
        "He was behaving in a violent and uncivilized way.",
        "He doesn’t get upset even when disappointing/disturbing things happen.",
        "He’s very impulsive and changes his mind unexpectedly.",
        "He remained firm in his support for them even in difficult situations.",
        "She’s very chatty and friendly.",
        "She rarely shows her feelings.",
        "He has a lot of fixed principles, and he tries to impose them on other people.",
        "He often pretends to be kind and considerate.",
        "She seemed very lively and cheerful.",
        "He was nervous, and he kept moving from one position to another.",
        "He often gets angry without having a good reason.",
        "His behaviour seemed funny/silly."
    ],
    " Group 6 ": [
        "He behaves as though he’s unaware of people’s feelings.",
        "She looked very graceful and dignified.",
        "I found him very confident and charming.",
        "He doesn’t make people welcome when they visit.",
        "Why do you keep behaving in such a rough and uncivilized way?",
        "The children behaved well/admirably throughout the party.",
        "He’s very amusing and witty.",
        "His manner was very quiet and controlled.",
        "His behaviour is intolerable.",
        "He speaks very aggressively.",
        "He was happy and relieved that everything went well.",
        "He’s very aggressive and eager to start a fight.",
        "He’s an unprincipled person and is prepared to do dishonest and immoral things to get what he wants.",
        "He won’t tolerate disobedient behaviour.",
        "He behaves as though he’s very pleased with his own behaviour.",
        "He’s very quiet and doesn’t want to talk to other people.",
        "She was very impatient, and she expressed it in her tone of voice.",
        "He often does things that are unfair and difficult to justify.",
        "He’s not experienced, and he’s often deceived.",
        "He’s very energetic and full of life.",
        "He doesn’t say very much and often seems unfriendly.",
        "He easily becomes impatient.",
        "She’s simple in character and never tries to get noticed or to draw attention to herself.",
        "He’s very solemn and conventional in his behaviour and doesn’t show much emotion.",
        "He can’t be trusted — he won’t hesitate to betray you.",
        "He thinks he’s superior to us and behaves in a scornful way.",
        "He’s bad-tempered and aggressive, and it’s very difficult to deal with him.",
        "When he does something, he doesn’t care whether he hurts or embarrasses other people.",
        "He’s very friendly and shows a lot of enthusiasm in his behaviour.",
        "He’s determined to do what he wants and is unwilling to change his mind.",
        "His behaviour at last night’s party was improper and was not suitable for that occasion.",
        "Their boss is quite understanding, and he doesn’t mind even if they’re a bit late for work now and then.",
        "He doesn’t have any gentle or caring feelings.",
        "She takes delight in teasing people.",
        "He does things with too much caution.",
        "Whenever he does anything, you get the feeling he’s doing it because he really wants to do it, rather than because he’s forced to do it.",
        "He accepts difficulties and suffering without complaining or getting upset.",
        "He’s very sensitive and is easily upset.",
        "He’s not cautious and is often deceived.",
        "He always does what his boss wants him to do.",
        "He’s always natural and genuine in his behaviour — he’s never snobbish or pretentious.",
        "Those children behave badly and are difficult to control.",
        "She’s well-mannered and relaxed, and appears comfortable in social situations.",
        "His father is very formal and old-fashioned.",
        "Their old boss used to be very kind and forgiving.",
        "He regards other people’s interests/wishes as more important than his own.",
        "He isn’t as innocent and naive as you think.",
        "He’s very gentle towards everybody.",
        "He’s very determined and doesn’t give up easily.",
        "He’s willing to take risks and try out new things.",
        "She behaves as she wants to, without worrying about what other people think.",
        "He doesn’t have the qualities that a man is traditionally expected to have.",
        "He always speaks in a selfconscious and unnatural way.",
        "He has strong feelings/opinions and expresses them forcefully.",
        "He’s very shy and nervous, and has no courage or selfconfidence.",
        "She doesn’t think carefully about the effects of her behaviour.",
        "All those children behaved in a quiet and obedient way.",
        "He has a modest/quiet character.",
        "He’s always calm and never panics.",
        "He’s often selfish and stubborn, and is difficult to control.",
        "He was reluctant to do it, and he did it without enthusiasm.",
        "He won’t put up with impolite behaviour.",
        "She’s very conceited and has too much pride in her own intelligence/ beauty.",
        "He’s not at all afraid about dealing with situations that frighten most people.",
        "He was worried, and he couldn’t concentrate on anything.",
        "He changes his attitude quickly and frequently.",
        "I can’t approve of your behaviour — I find it unacceptable.",
        "He’s very self-controlled and doesn’t lose his temper easily.",
        "Her manner was very quiet and restrained.",
        "He expresses his opinions and feelings openly, without worrying what other people think.",
        "His behaviour was rather formal and not very friendly or relaxed.",
        "Whenever he gets into a difficult situation, he doesn’t panic, but gives careful attention to it.",
        "He forgets/ignores other people’s needs and wants.",
        "He has strong and fixed ideas about things and is not likely to change his mind.",
        "He was sad and worried about something and was very quiet.",
        "He has very strict beliefs and attitudes, and he’s unwilling to change them.",
        "I don’t know why, but he always behaves towards me in a hostile/rather unkind way.",
        "He always shows a great desire for revenge.",
        "He never does things that are against his beliefs.",
        "The trouble is, he isn’t experienced about the practical aspects of life.",
        "His behaviour is bad, and nobody can make him behave more sensibly.",
        "She doesn’t like talking to other people, and tries to avoid meeting them.",
        "She’s always kind towards people who’re suffering and shows that she understands their feelings.",
        "He’s always careful not to say anything that would offend or upset other people.",
        "He never shows thanks to anyone who does something for him.",
        "He doesn’t have a wide range of experience and has simple tastes.",
        "He likes to do things quietly and secretively.",
        "He was thinking about something and was quiet and serious.",
        "He’s charming and polite, but insincere.",
        "He behaved in a wild and uncontrolled way — as though he didn’t care about how he should behave.",
        "He stays calm, even when upsetting/exciting things happen.",
        "Her father is rarely warm or affectionate.",
        "He was angry/offended, and he started shouting at them."
    ]
}