{
    " Group 1 ": [
        "Her father is a builder.",
        "He doesn’t have a good home life.",
        "He came in through the front door.",
        "They sat on the sofa/couch/ settee and talked.",
        "She lives in Delhi.",
        "They’re renovating their country house.",
        "Those are large and expensive flats.",
        "He’s in the garden shed.",
        "That bed is a fine piece of furniture.",
        "Go along the corridor.",
        "He’s gone home.",
        "Don’t forget to flush the toilet.",
        "They spent a lot of money fitting out the new house.",
        "They have a cottage by the sea.",
        "He works in the building trade.",
        "We slept out in a tent last night.",
        "Their flat is on the top floor of the building.",
        "We should call for a plumber — this drainpipe has a hole in it.",
        "They went to China and settled there.",
        "That’s a large and splendid house.",
        "His friend will put him up for the night.",
        "That house has a sloping roof and is supported by sloping beams.",
        "They sat in the living room and chatted.",
        "We’re going to clean the house down this weekend.",
        "He met with an accident on the building site.",
        "He has built houses for two of my friends.",
        "They’ve rented the house from him.",
        "The doorway is quite wide.",
        "There was a large open space between their house and garden.",
        "There’s a line of joined houses a little away from there.",
        "He lives abroad most of the year.",
        "I can’t walk up the stairs — I’ll take the lift.",
        "I must go to the toilet.",
        "We’ll go and wait at the bus shelter.",
        "They live in a large, grand house.",
        "He’s an architect.",
        "She stood there looking out of the window.",
        "The children were playing in the attic.",
        "There are a number of houses like these in the outer parts of the town.",
        "There’s a garage as part of their house.",
        "That’s a large house, and the dining hall is in the north wing.",
        "There’s a corridor leading from the front door.",
        "Do you have a flat here?",
        "We’ll have to buy some new household equipment.",
        "The whole new area is covered with buildings now.",
        "He’s not a visitor — he lives there.",
        "The dog went out through an opening in the wall.",
        "Where do you live?",
        "That building is divided into flats and offices.",
        "She decorated the walls with pictures.",
        "He was sitting on the divan.",
        "I met him in the passage way.",
        "The dirty water doesn’t flow away from the bath.",
        "They have nice curtains in their house.",
        "They have a small house in the country.",
        "They’re putting up a new building there.",
        "They left India, and settled in Canada.",
        "I only had a single room for living and sleeping in.",
        "These waste pipes carry water and waste away from the building.",
        "He lives in a large, showy building.",
        "The gardens around the hospital are full of flowers, grass and paths.",
        "The roof is supported by a row of pillars.",
        "The rails along the balcony prevented her from falling down.",
        "He’ll put up at a guest house for the night.",
        "He’s thinking of building a house there.",
        "Who built your house?",
        "They live next door to us.",
        "The house is fitted up with the most up-to-date appliances.",
        "He left the car in the drive.",
        "The government has decided to settle the refugees there.",
        "Is it a tall, narrow building?",
        "They grow flowers and vegetables on their garden.",
        "A few rails were missing from the side of the stairs.",
        "We’re planning to put wallpaper on the walls.",
        "He’s looking for a plumber to fit pipes in that building.",
        "He was sitting at his desk and reading.",
        "Their house has a steeply sloping roof.",
        "Their house is of excellent construction.",
        "I occupied a room there for a few months.",
        "Their old house had a tiled roof.",
        "Our village is a pleasant place in summer."
    ],
    " Group 2 ": [
        "He used to live in a house with a large garden.",
        "We can put you up for a few nights.",
        "You can go from the first floor to the second floor either up the stairs there or up that ramp.",
        "They’re in the dining room.",
        "Where’s the car park?",
        "We lived in tents for a week.",
        "They’re planning to build a house out of wood.",
        "I want to live a quiet life.",
        "She went out through the back door.",
        "One of our trees grows over our neighbour’s garden.",
        "That’s a strongly-built building.",
        "We lived in the US for a time and then went on to the UK.",
        "They waited in the hall.",
        "That chair is broken.",
        "We store water in that tank.",
        "These plants decorate the house very well, don’t they?",
        "They were living in a roughly made hut.",
        "He has planned and built several buildings.",
        "We have to find a home for them for a short time.",
        "There’s a lot of work and organization involved in running a home.",
        "That’s a strongly-made building.",
        "Is there anything wrong with the plumbing?",
        "They’ll provide you with a place to live for a short time.",
        "They have a large house in the village with a large area of land around it.",
        "It was very hot last night, and we all slept in the yard.",
        "The roof is supported by a row of arches.",
        "Their new house has three bedrooms and two bathrooms.",
        "There’s no open place there where people can leave their cars.",
        "How much do your household expenses come to?",
        "They’re repairing the upper floor of their house.",
        "Have they moved to their new house?",
        "There are built-in cupboards in their house.",
        "I don’t own this house — I’m just a tenant.",
        "The cows came in through an opening in the fence.",
        "They live at 48",
        "Gandhi Street.",
        "They’re planning to build a new office block there.",
        "That’s just a shed for storing things.",
        "He lives in a comfortable house.",
        "In case of fire, you’ll be able to get out through the fire escape.",
        "I must go to the bathroom.",
        "He has a large writing table.",
        "He lives in a small building made of wood.",
        "There are several fine buildings in our city.",
        "They’re staying at a hotel in the city.",
        "Who lives in the annexe?",
        "The latrine needs a good clean-out.",
        "To us, our home is a palace.",
        "Let’s clear out all the cupboards first.",
        "His house is built on two levels.",
        "They used to live in the upstairs flat here.",
        "The grounds of their country house are enclosed by a wall.",
        "Our country has special housing problems.",
        "They’ve erected a memorial for him in the village.",
        "Who owns that house?",
        "Hang up your clothes in the wardrobe.",
        "Do you know the way out of this building?",
        "The lawn is covered with closely-cut grass.",
        "There was a doormat just outside the door.",
        "Where did the guests stay?",
        "They stayed in a camp during the summer holidays.",
        "We’re planning to fence our garden.",
        "They laid new carpets on the floor/staircase.",
        "She keeps dishes and cooking pots in a corner in the kitchen.",
        "It’s going to cost a lot to decorate the house.",
        "We used to live in a small, dirty house there.",
        "That’s a large fine building.",
        "Most of them live in the poorer areas of the city.",
        "Their house has a cellar, and they store a lot of things there.",
        "Those are large houses belonging to the wealthy people.",
        "I’m staying at a friend’s house.",
        "The town hall has large pillars.",
        "At that time, we were sitting in the balcony.",
        "Put the car in the garage.",
        "They live in a nice little house."
    ]
}