{
    "key": [
        "We must invest if we want our business to grow.",
        "You wanted to know the final price, didn’t you?",
        "He’s a businessman — he buys things cheap, and sells them dear.",
        "Half the order will arrive on Wednesday. The rest will arrive after a week.",
        "We no longer stock that product — there’s no demand for it.",
        "If your order is over Rs. 1,00,000 in value, we can go along with the special discount terms.",
        "They sold that old building, and it fetched Rs. 2,00,000 or so.",
        "We’ll have to analyze the situation before deciding what to do.",
        "How much stock did we have at the start of the year?",
        "You’ll have to make an estimate of the cost.",
        "I’m sorry we’ve really let you down, and there’s no excuse.",
        "Is this price list still valid?",
        "He has a business of his own.",
        "They’re going to open a new department store there.",
        "We’ll be invoicing you separately for these items.",
        "I think we’re passing up an opportunity for making good profit.",
        "Shares have dropped.",
        "He bought that car new.",
        "We haven’t got enough space to stock them.",
        "If we want to compete with overseas companies, we’ll have to improve the quality of our goods.",
        "Certain things may go wrong in any business.",
        "We need the goods sooner than we thought.",
        "That cement factory is up for sale.",
        "They charge high prices.",
        "Let’s work out the firm’s profit for the current year.",
        "We’ve dealt with them for nearly five years now.",
        "We need fast turnover and good profit.",
        "We employ 500 workers.",
        "We’d like to order some office equipment.",
        "Who looks after the accounts of the firm?",
        "We can’t afford to buy it at that price.",
        "Our lowest price is Rs. 200 a dozen.",
        "He bought that house cheap.",
        "These are high-demand, high turnover brands, why don’t you carry them in your store?",
        "The bill they sent to us was far too high due to a computer error.",
        "I’ll have to confirm that with our General Manager.",
        "Are you sure this invoice is correct?",
        "The company has decided to put up their prices.",
        "I can only give you an approximate idea of the cost.",
        "We have a lot of business expenses to meet.",
        "Mr. Mohan to see you, Mr. Murthy.",
        "Have you invoiced them for the last order?",
        "This new product will be on the market next month.",
        "A note was attached to the document with a paper-clip.",
        "Can you give me a quotation?",
        "Somehow or other, we’ll have to meet our delivery date.",
        "You’ll only know our difficulties if you’ve ever kept a shop.",
        "The cost of electricity has gone up.",
        "The company was not able to get any further credit and went bankrupt.",
        "Mr. Prakash here on the phone for you.",
        "Shares have fallen.",
        "I expect to go on buying from our existing suppliers in the future, too.",
        "They haven’t paid the last invoice yet.",
        "Money buys less than it used to.",
        "A better discount? We can’t go over 10%.",
        "There’s no demand for that brand.",
        "I think we should bring down our prices.",
        "They’ve asked for payment before delivery.",
        "Don’t forget to budget for possible increased costs.",
        "Our income doesn’t even cover our living expenses.",
        "They were able to increase overall production by 30% last year.",
        "He’ll be attached to the accounts department for the next three months.",
        "You get a 5% discount for prompt payment.",
        "The goods were delayed during transport.",
        "Our goods are attractively packaged, and they sell more quickly.",
        "They do their bookkeeping by computer.",
        "We keep books by hand.",
        "There’s a Mr. Arun to see you.",
        "At that price that dress is an absolute bargain.",
        "How long has this product been on the market?",
        "What are our finances like at the moment?",
        "The best goods usually cost most.",
        "I like the looks of this washing-machine.",
        "We’ve got all the information you need on file.",
        "We can give you a 15% discount if your order reaches us before the end of this month.",
        "They want us to make immediate delivery.",
        "How are you going to raise money for the project?",
        "What you’ve told me about your product is all very interesting, but the cold hard fact is, your service is unsatisfactory.",
        "Write out a cheque, will you?",
        "I have a Mr. Keshav to see you, Mr. Thomas.",
        "Who’s in charge of the office when Mr. Mohan is away?",
        "The court awarded Rs. 20,000 each to the workers injured in the accident.",
        "We’ll have to speed up production in the factory.",
        "They want a higher discount.",
        "You’ll send it tomorrow? Can I really count on it?",
        "The manager has to get through a lot of paperwork everyday.",
        "Give me time to think it over.",
        "I hope they keep their side of the bargain.",
        "When did we promise delivery? Next Friday?",
        "Shares are sliding.",
        "Supposing they’re not able to deliver on time.",
        "The arrangement can’t be changed.",
        "It’s worth more than you paid for it.",
        "This is our second order for office equipment.",
        "I think there’ll be a two-week delay.",
        "These items bring in far less profit than other goods.",
        "We’ve contracted to supply all the raw materials they need.",
        "This shop sells a wide range of goods.",
        "We have a service contract with them on our computers.",
        "Your cheque is in the post.",
        "I need some background information.",
        "Please allow 30 days for delivery.",
        "The consignment has got stuck at the customs.",
        "Computer prices are falling all the time.",
        "If you order now, you can be certain of prompt delivery.",
        "Have you invoiced them for the goods they bought today morning?",
        "Who wouldn’t like to increase their profit margin!",
        "He’s very slow at paying his bills.",
        "That salesman couldn’t answer my question to my satisfaction.",
        "He has been frequently absent, and is behind with his work.",
        "Prices are likely to go up soon.",
        "He’s been doing a roaring trade and he’s in the money.",
        "I don’t want to carry your line in this store.",
        "Our electricity bills are always heavier in the summer.",
        "The loss in the first half of the year was balanced by the profit in the second half.",
        "First, let’s get an estimate. Then we can decide whether to proceed with the work or not.",
        "We’re thinking of buying your computers.",
        "He’s bought a computer for his business.",
        "Spending on advertising has increased in absolute terms.",
        "Have you made out an invoice for the goods?",
        "We can’t risk our business coming to a stop just because the suppliers couldn’t deliver on time.",
        "Shares are rising.",
        "The new brand of coffee soon became a market leader.",
        "What price did you give?",
        "You’ve done business with us before, haven’t you?",
        "We rely on advertising to sell our products.",
        "Phone him up and ask him to settle the account.",
        "I’m already overstocked.",
        "They do quite a good trade in sports equipment.",
        "The sales figures bear out what he says.",
        "Business is bad. I haven’t made a sale all day.",
        "Three months is my deadline.",
        "These records will have to be brought up to date every day.",
        "This is an excellent profit-making line.",
        "This month’s production figures are looking good.",
        "Shares have been soaring for sometime now.",
        "Do I have to pay in cash, or will you accept a cheque?",
        "We’re hoping for a large sale of our new product.",
        "The factory lay idle during the strike.",
        "Prices start at Rs. 150.",
        "I’d like to know your prices and terms.",
        "That firm is not in business any more.",
        "They’re business partners.",
        "Your prices are too high.",
        "The board of directors are (or is) meeting to discuss this problem.",
        "The maintenance contract is due for renewal next month.",
        "I think our plan is beginning to bear fruit — the sales figures have started going up.",
        "Can you offer the large size at the same price?",
        "The staff are not always careful over the clerical work.",
        "I think the material was faulty.",
        "We’ve decided to cut costs by 5% right away.",
        "Everything they sell are priced high.",
        "The question you’re raising is pretty important.",
        "This idea could save us a lot of bookkeeping work.",
        "Is your April price list still valid?",
        "We couldn’t get enough in all the sizes needed.",
        "Prices for raw materials are getting lower.",
        "Carry our products and you just can’t lose.",
        "He’s the real brains in the organization.",
        "Mr. Prakash of the XYZ company on the line, Mr. Varma.",
        "I’ve made up my mind not to deal with that company again.",
        "That company manufactures sports equipment at a price that we can’t match.",
        "I’m busy with an important customer.",
        "He’s thinking of expanding his business.",
        "We can buy cheaper elsewhere.",
        "Shares are looking up.",
        "He runs a petrol station.",
        "The salary will be fixed according to age and experience.",
        "The new product will be fixed on sale next month.",
        "We’d like earlier delivery if possible.",
        "The shop has a new look to appeal to young customers.",
        "Can you give me an idea about your product requirements?",
        "Add Rs. 25 to the total to cover postage and packing.",
        "If your terms are reasonable we’ll be able to place another order soon.",
        "Well, the point is, what can you do to help us?",
        "Prices for computers are dropping.",
        "That’s a well-known brand of tea.",
        "I don’t think these figures are accurate.",
        "Who’s the other applicant?",
        "Has he had any experience?",
        "The firm’s profits have multiplied over the last two years.",
        "We bought a computer from them, and we’ve had a lot of service problems.",
        "I think our new product should fill a gap in the market.",
        "This price is very competitive.",
        "We made several mistakes, and they cost money.",
        "We don’t only buy on price. There are other factors too — quality, service, delivery...",
        "Their Managing Director has a reputation of being difficult to work with.",
        "I’ll make sure it’s delivered on time.",
        "I can offer it to you at a bargain price.",
        "We shall do our best to see that it’ll never happen again.",
        "We give a better discount on a repeat order.",
        "If I ordered the pumps today, how long would it be before I got delivery in Kochi?",
        "Shares have fallen very low.",
        "I don’t have any demand for your line.",
        "The new government has decided to help people start small business.",
        "Somehow, they always manage to keep ahead of competitors.",
        "They’re going to launch a new product next month.",
        "Write out a cheque for that amount, then.",
        "You can count on the delivery by this weekend.",
        "They always buy goods for cash.",
        "Our firm buys goods on credit from them.",
        "This line can make money for us.",
        "Shares have touched bottom. Now’s the time to buy them.",
        "Are those products selling well?",
        "There’s just not enough profit in these small items.",
        "Oranges are selling at a high price.",
        "Could you bring the delivery forward by a week?",
        "Can I interest you in our new washing powder?",
        "We can certainly meet your needs if there’s an emergency. The actual damage to the factory was not as great as we had feared.",
        "Could you let us have a firm offer?",
        "Our prices compare favourably with anything on the market today.",
        "Shares have been staying very low for a long time now.",
        "Your price is way out of line.",
        "He has set up in business as a photographer.",
        "This is a problem that faces every company now and again.",
        "Order well in advance, so you can be certain of supplies.",
        "Ours is a small manufacturing firm.",
        "He has the right kind of experience for this job.",
        "These prices are our lowest.",
        "Can you give us 45 day’s extra credit?",
        "How much money do they owe us?",
        "Can you give me a rough estimate of how much this work will cost?",
        "The firm got itself into financial difficulties.",
        "Look, your product doesn’t meet with our specification.",
        "What’s the price of this TV?",
        "A lot of customers would buy this stuff if you carried it.",
        "The figures have been adjusted to take account of inflation.",
        "Look, we just can’t accept these faulty goods.",
        "You’ll have to share the extra cost of sending the goods by road.",
        "I don’t know why, but orders have slumped.",
        "The company’s future doesn’t look very hopeful.",
        "The owners couldn’t make it pay, and the factory closed down.",
        "What are your credit terms?",
        "Business is looking up.",
        "The suppliers had difficulties in meeting our delivery schedules.",
        "I think there’s a need for more spending on research.",
        "The discount would be 3% higher for a repeat order.",
        "Business was quiet today, and I didn’t have much work to do.",
        "We’re due to deliver their order this Friday.",
        "He has a lot of money tied up in shares.",
        "Customers often don’t ask for something they don’t see in the store.",
        "The output has increased in the past year.",
        "Can you deliver quickly?",
        "10% will be added on to your bill as service charge.",
        "We’ll repair it for you free of charge.",
        "We bargained with them about the price.",
        "What discount would you offer on an order for 1000?",
        "They’re very easy to do business with.",
        "I don’t know why, but share prices have slumped.",
        "I don’t have any demand for your product in my shop.",
        "He runs a restaurant in Bangalore.",
        "I’ve got a report I must dictate.",
        "They’ve sent us faulty goods.",
        "We don’t want to try out new ideas just now. That’d only disrupt production.",
        "The business is finished — there’s no more money.",
        "I wish you’d keep the deadlines we fixed.",
        "We have a wide range of prices.",
        "His business has been running at a profit.",
        "Their business runs at a loss.",
        "They’ve decided to stock up our product.",
        "It’s difficult to calculate how long the project will take.",
        "How much time can you give us to complete this work?",
        "Ask them for a receipt when you pay the bill.",
        "Our products sell very quickly.",
        "Does she have any secretarial experience?",
        "We haven’t any more available.",
        "The goods left the factory in perfect condition.",
        "It’s not easy to build up a good business.",
        "People just don’t ask for your products. Business has been good for the time of year.",
        "Well, I’ll have to check with the factory.",
        "You’ll receive supplies within three days of ordering.",
        "We didn’t make much profit in the first year.",
        "We sell automobile spare parts, and we need regular supplies.",
        "Ours is a small business.",
        "Theirs is a large firm.",
        "Is that product still in demand?",
        "These items will sell well and make profits for you.",
        "Use this method and you can multiply your profits in a very short time.",
        "When did you place the order?",
        "This trip was financed by the company.",
        "The transport strike has put us further behind with our delivery.",
        "If you want us to send it by post, we must charge postage.",
        "It’s very expensive to advertise on television.",
        "I can’t tell you what the discount is, until I know how many you’d like to order.",
        "There’s a 5% discount.",
        "This seems a sensible solution.",
        "He’s not a government servant — he’s in business.",
        "The production figures will bear him out.",
        "There’s been an increase of 25% on last year’s figures.",
        "They make the best umbrellas on the market.",
        "Our products are always in demand.",
        "We do regular checks on our products and make sure they’re of high quality.",
        "You can take advantage of our introductory offer.",
        "They haven’t been able to work out the terms of the contract satisfactorily.",
        "They only sell goods for cash.",
        "There’s too little profit in this item for the handling effort and expense involved.",
        "At last, his business is picking up. It has been making a loss so far, you know.",
        "Will I have any problem in getting spares?",
        "We’re sold out — we have no more.",
        "He has the reputation of being a keen buyer.",
        "The bill should add up to about Rs. 9,750.",
        "Those are the best terms we can offer, I’m afraid.",
        "Do you have our price list?",
        "What’s all this going to cost?",
        "He’s decided to start a small retail business.",
        "There are clear advantages to the first plan.",
        "We haven’t worked out all those details yet.",
        "Many small firms are facing financial ruin.",
        "Why are they withholding payment this time?",
        "We’ve placed an order with them for some electrical goods.",
        "The discount will be bigger if you order over 100 units.",
        "You’ll have to pay for it when you order it.",
        "Why has there been this hold up on delivery?",
        "He’s in business on his own.",
        "I once had a bad experience with your company.",
        "We hope to expand our business this year.",
        "What’s the order number?",
        "The goods are now ready for collection.",
        "We have a production problem.",
        "We’re out of stock — all sold out.",
        "What we need are products that turn over rapidly.",
        "You see, the discount depends on the quantity.",
        "We’ll have to order some more.",
        "How much does that computer cost?",
        "We need to maintain the quality of our products.",
        "Could you give me some idea of your requirements?",
        "I’ll speak to my partner about it.",
        "Business is good at present.",
        "Are they satisfied with the discount?",
        "He has put a lot of money into that business.",
        "They’re one of our most valued customers.",
        "We can have the items ready by the weekend.",
        "The deal looked impossible, but he pulled it off.",
        "Do you buy only on price?",
        "We can’t afford to lose this contract. The future of our firm depends on it.",
        "Have you checked with our competitors?",
        "Can’t you reduce the price for our first order?",
        "We need to get a clear understanding of the situation.",
        "They’ve sent us damaged goods.",
        "We meet urgent orders quickly from stock.",
        "That’s the reason why you should buy from us.",
        "Can you give me a rough estimate of what the work would cost?",
        "What about a good discount? It’s a repeat order, you know.",
        "Is this situation likely to continue or not?",
        "The company’s finances are in good shape.",
        "I think your product is overpriced.",
        "He’s after a job in advertising.",
        "He’s a close business associate of my brother’s.",
        "Better stock up on sugar there’ll be a shortage soon.",
        "We buy on value and not on price alone.",
        "I’m tied up right now — I don’t have time.",
        "These are our lowest prices.",
        "We’ll enclose the bill with the goods.",
        "The boxes were all checked off as they were unloaded.",
        "He runs a small antique business.",
        "Can you supply me from stock?",
        "He takes care of the business and she keeps the accounts.",
        "We’re overstocked.",
        "The factory has had to close down because of the strike.",
        "Why haven’t you delivered our order yet?",
        "They’ve sent us goods we haven’t ordered.",
        "Please tell us what the problem is, so we can immediately put matters right.",
        "They keep a small hotel.",
        "We’re very disappointed in your firm.",
        "I invested Rs. 15,000, and I got a good return on it.",
        "Is that product selling well?",
        "Are you for or against the plan?",
        "He started the business with a comparatively small capital.",
        "This is a special introductory offer.",
        "If you like, I can send it by air freight.",
        "This TV is made of the best components that money can buy.",
        "These things cost a lot to produce.",
        "Mr. Kumar, would you take a seat, please.",
        "Your delivery is too slow for me.",
        "How’s business?",
        "Business is booming.",
        "OK then. I’ll order on those terms.",
        "The firm’s finances are in bad shape.",
        "He’s temporarily short of cash.",
        "We want Rs. 15,000 for this TV. We can’t settle for less.",
        "Can you find out the price of their computers?",
        "A delivery van would bring the grocery order.",
        "They tried out this idea, and there was an immediate increase in productivity.",
        "We’re now living in the computer age.",
        "Couldn’t you manage to allow me a better discount?",
        "We’ve got it in stock, so I can send it at once.",
        "The chairman brought the meeting to a close.",
        "He started an advertising business on his own.",
        "Don’t promise a date unless you know you can honour it.",
        "But you do like our products, don’t you?",
        "They’re business rivals.",
        "It’s cheaper.",
        "I’ve made a mistake — the accounts don’t balance.",
        "These are damaged goods. they’ll have to reduce the bills.",
        "The suppliers say they would be a bit late with delivery.",
        "I’d talk things over first with my partner.",
        "It’s a real bargain at that price.",
        "We’ve decided to cut down on our advertising expenditure.",
        "What’ll happen to the business when the Managing Director retires?",
        "If you don’t deliver immediately, we’ll be short of stock.",
        "Our company agent there will meet you at the airport.",
        "I thought prices would be coming down now.",
        "This accident would cost the company a lot of money.",
        "That car’s a good buy.",
        "I’m up to my nose in problems.",
        "He’s an aggressive salesman.",
        "Yes, I think we can go along with these arrangements.",
        "You always get value for money at that shop.",
        "He would buy if it were cheaper.",
        "These changes will save your firm a lot of money.",
        "That’s not much more than the price you paid last year.",
        "The quotation you sent us was fine. We’re ready to place an order now.",
        "The company is planning to build a new factory there.",
        "She can’t do shorthand.",
        "We’ll have to stock them again when our stock levels are lower.",
        "It’s more expensive.",
        "What’ll the discount be?",
        "Their ledgers are badly kept.",
        "We have a large number of credit customers.",
        "They have a fine reputation for paying promptly.",
        "Read the credit terms carefully before signing.",
        "Would you like it specially gift-wrapped?",
        "The firm needs to build up a good name for itself.",
        "My partner is out of town.",
        "We agreed (on) a price of Rs. 15,500.",
        "Is that your best quote?",
        "Can you send them immediately from stock?",
        "We’ll have to offer a better product than the competition — or we won’t be able to succeed.",
        "I don’t want the expense of a market survey just now.",
        "This is the very reason why you should stock our products.",
        "10% is the most I can give you as a quantity discount.",
        "During these three months, the demand is likely to be quite heavy.",
        "That house was a bad buy.",
        "Our profits have been going down for some time now.",
        "I’ve been calculating the costs involved and it’s too expensive.",
        "He’s a successful businessman.",
        "This washing machine comes with a year’s guarantee.",
        "It’s out of their price range.",
        "These shoes cost more, but they last much longer than cheap ones.",
        "Please sign the agreement and return it to us.",
        "He has a baker’s shop in town, and he’s doing a roaring trade.",
        "There’s a very heavy demand for our computers this year.",
        "The consignment should reach you by this weekend.",
        "Another strike will throw the firm into bankruptcy.",
        "I didn’t get satisfactory service and I wrote a letter of complaint to their Managing Director.",
        "They’re now doing twice as much business as they were doing last year.",
        "He has set up a small advertising business.",
        "Here’s today’s post, Mr. Sekhar.",
        "The final decision lies with the Managing Director.",
        "Let’s look ahead together and plan for future deliveries.",
        "How will you raise the finance to start the business?",
        "Are those your most favourable prices?",
        "These prices are rather high, aren’t they?",
        "Can you deliver them sooner than we agreed?",
        "Their firm is in serious financial trouble.",
        "Their product is no longer top grade.",
        "They reached an agreement after three days of talks.",
        "It’s a real bargain at that price.",
        "These goods are urgent. We’ll have to send them off today.",
        "Her father has a greengrocer’s business.",
        "Our service would be very personal to you and to your requirements.",
        "We don’t have much ready cash with us.",
        "How many would you like?",
        "How would you like delivery to be made? By rail or by road transport ?",
        "There were huge price reductions during the sale.",
        "There’s going to be a complete reorganization of the sales department.",
        "He has a fruit shop.",
        "They’ve been trying to work up a big demand for these goods here.",
        "The factory has 400 employees.",
        "What have we spent on buying raw materials this year? Half a million, perhaps?",
        "There’ll be interest payable at 20% per year.",
        "He’s a doctor, but he wants to go into business.",
        "I think their firm will go out of business in the near future.",
        "We can buy better elsewhere.",
        "They buy these things in bulk.",
        "Our expenses are going up.",
        "Prices jumped by more than 30% in the summer.",
        "I’ve checked up on the prices you asked about.",
        "He runs a thriving grocery business in town.",
        "We must think ahead and make a plan.",
        "The parcel left our place perfectly packed.",
        "They only sell goods of the highest quality.",
        "Business has been good for the time of year.",
        "We’ll compare the costs and buy the cheapest.",
        "The prices have only gone up a little.",
        "The quality just isn’t good enough.",
        "He has a chemist’s shop.",
        "The closure of the factory came as a shock to the workers.",
        "The company made a loss of 75 lakhs of rupees.",
        "I can give you a quantity discount for 100 units or over.",
        "The company’s sales have reached the 100 million mark.",
        "You’re interested in saving money, aren’t you?",
        "Large amounts of money are spent on advertising.",
        "No, we can’t reduce the prices.",
        "Business is always brisk in the evening.",
        "He’ll be at a conference all day tomorrow.",
        "The firm’s head office is in Bombay.",
        "The job was advertised in local newspapers.",
        "Our Bombay agent is on the line. Will you take the call?",
        "The suppliers have got some trouble or other.",
        "You have to be hard to succeed in business.",
        "I want to consult my partner.",
        "That company is way ahead of us in their research.",
        "The supplier has stopped our discount.",
        "We’ll be able to send your consignment before the end of the week.",
        "She got that dress on the cheap.",
        "We’re not satisfied with the service we get from your company.",
        "They have a sweet-shop.",
        "That shop sells high-quality goods.",
        "It’s all very well to say we should advertise more, but is the expense worth it?",
        "What have we received for the goods we’ve sold this year? One million?",
        "Business has been good for our firm for some time now.",
        "Haven’t they despatched our order yet?",
        "What’s the retail price of these bags, then?",
        "Her father keeps a shop in our village.",
        "I have some ideas for cutting down overheads.",
        "How much stock is left?",
        "When he had enough capital, he bought a shop.",
        "Our company has won a contract for 20 buses.",
        "Now we can confirm the arrangements we made.",
        "This bag looks cheap. It’s poor value for money.",
        "They’ve been pressing us for payment for sometime now.",
        "We’re planning to open offices in Bombay and Delhi this year.",
        "We can offer you a special discount if you order before March 31st.",
        "There’s a two week delivery time.",
        "Our firm has won a contract to build a bridge.",
        "Let me check with the accounts department.",
        "The firm has just won an important contract.",
        "Stamp those letters with today’s date. You received them today, didn’t you?",
        "I can pay you Rs. 10,000 in ready cash.",
        "That shop doesn’t sell goods retail.",
        "You’re right about quality, but price also matters.",
        "He has made a lot of money in business.",
        "The shops in town close at 7.30.",
        "I’ll make a bargain with you.",
        "Sorry, we don’t allow credit.",
        "He runs a shoe shop.",
        "Well, if you can do that, that’ll help.",
        "Can you find out how much stock we actually have?",
        "Can we agree on a price?",
        "Where’s your company’s headquarters?",
        "He owns his own business.",
        "He works for the XYZ company.",
        "The watch is still under guarantee.",
        "Last time, they had difficulty in meeting our delivery schedules.",
        "We’re aiming at a 20% increase in profits.",
        "These goods are in poor supply. You can’t get them easily.",
        "They may claim compensation from us for failure to deliver on time.",
        "This is a repeat order, and you’ll have to allow us a longer credit period.",
        "That’s a very valuable contract.",
        "They’re expected to work an eight-hour day.",
        "The firm is in severe financial difficulty.",
        "Shirts like that don’t come cheap.",
        "Those goods were sent off days ago.",
        "This is the best business deal I’ve ever done.",
        "The company has a lead of several years in the development of this technology.",
        "Let’s not haggle over the price.",
        "I think the price is reasonable.",
        "They use high-quality raw materials.",
        "Don’t buy anything from them. They only buy shoddy goods.",
        "Get the Accountant on the phone for me, will you?",
        "He’s been doing a roaring trade and has been making a lot of money.",
        "I can’t sign these papers without my partner’s approval.",
        "Their credit is good — we can trust them.",
        "Can you confirm the dates now?",
        "The firm operates from its central office in Madras.",
        "Your quality isn’t good enough.",
        "This advertising campaign is aimed at housewives.",
        "Their firm has gone broke.",
        "What would they cost if I took a thousand?",
        "We’ll despatch them immediately from stock.",
        "That was a very difficult deal, but he managed to bring it off.",
        "The advertising budget for the new product is Rs. 50,00,000.",
        "Can you work out how much profit the firm has made?",
        "That contract ruined him.",
        "I think Bombay might be a good market for our products.",
        "The company is hoping to expand into the American market.",
        "I want to get a good rebate.",
        "It was part of the deal they’d deliver in three months.",
        "He deals in antiques.",
        "We usually get a better discount on a repeat order.",
        "She always haggles with shopkeepers.",
        "The company has been trying to raise extra capital.",
        "You’ll have to pay the full amount within seven days.",
        "The guarantee has expired.",
        "He has stopped trading in tea.",
        "You’ve got to be tough if you want to stay in business.",
        "We’ve done a deal with a cement company.",
        "From what you’ve told me, there must be a fault in the product.",
        "The air is polluted by smoke from the factory.",
        "She’s a successful businesswoman.",
        "Please get on to the customer and find out.",
        "We’ll have to check your offer before we order.",
        "He rushed headlong into buying the business.",
        "The company collapsed, and hundreds of people lost their jobs.",
        "He runs a travel agency.",
        "You want to see the General Manager? Have you an appointment?",
        "We can make the same profit with half the effort.",
        "We have to find the right product for the market.",
        "I’m not quite ready to place an order yet.",
        "You’ll confirm that to me in writing, won’t you?",
        "He has a wholesale business in town.",
        "We can assume profits of around 10%.",
        "The firm buys goods at one price and sells them at a higher price.",
        "Eggs are cheap in that shop.",
        "50,000 rupees? That’s a lot more than we paid last year.",
        "They shook hands on the deal.",
        "I think we’re crazy not to look for more business.",
        "He bargained with us about the price.",
        "He’s doing a roaring trade in electrical goods.",
        "We need at least 100 in the first delivery.",
        "We need the goods urgently. You’ll have to despatch them at once.",
        "His old car went for 50,000 rupees.",
        "Things have changed and we can now be of better service to you.",
        "We deliver free of charge.",
        "Don’t use material of such poor (or low) quality.",
        "We’ll have to do something and clear the matter up as soon as possible. Or it’d become a serious problem.",
        "These are shoddy clothes — don’t buy them.",
        "Profits have gone down by 10%.",
        "Can I buy cement retail here?",
        "This material is very poor quality.",
        "You’ll find our prices can’t be beaten.",
        "The cost of the repairs came to Rs.10,000.",
        "The company went bust and was forced to close down.",
        "The company has ambitious plans for expansion.",
        "In many ways, it was a bad bargain.",
        "Last year, we had to spend a lot of money on rail fares.",
        "We buy the materials wholesale.",
        "Why has the consignment been delayed?",
        "I think we ought to drop our prices.",
        "I don’t like their design for the new theatre. Others have better designs.",
        "You’re very lucky to get it so cheap.",
        "They’ve raised their prices a lot since last year."
    ]
}