{
    " Group 1 ": [
        "I’m a size 15 — what size dress do you take?",
        "Could I change this shirt for a larger size, please?",
        "She had a blue-and-yellow striped dress on.",
        "He always wears smart and stylish clothes.",
        "He did up his shirt, his trousers and his shoes.",
        "This shirt is dirty — let me change it.",
        "He wrapped up warmly in a sweater.",
        "He has a large family to feed and clothe.",
        "I don’t think blue/green suits you.",
        "She had a skimpy swim-suit on.",
        "Show me a pair of trousers in my size.",
        "She couldn’t make her mind up what to wear.",
        "The children were naked to the waist.",
        "You can’t wear jeans to the office.",
        "He wore a blue shirt with a white collar.",
        "You’ve got a crease in the back of your shirt.",
        "Those shirts are old and worn out. He doesn’t put them on any longer.",
        "I tore my trousers on a nail.",
        "These are grease marks. They won’t wash out.",
        "It was a plain dress — it had no pattern or design on it.",
        "These jeans don’t fit at the waist.",
        "They’ve gone to buy Smitha’s wedding outfit.",
        "She took off her dress, and put it on a clothes hanger.",
        "She was very stylishly dressed.",
        "She was wearing a blue pleated skirt.",
        "I take a size 15.",
        "That’s a nice dress.",
        "Dresses like these are always in style.",
        "Let me change into something a bit more comfortable.",
        "There was a tear in his trouser leg.",
        "He buttoned up his shirt.",
        "He pressed his shirt, and got rid of the creases.",
        "She sewed the dress on the sewing machine.",
        "A new garment should be washed carefully.",
        "She doesn’t like dresses that fit closely.",
        "Use a belt, and keep the trousers up.",
        "These trousers cost Rs. 1,500 a pair.",
        "She wore a dress that reached to her ankles.",
        "Does this dress come in children’s sizes?",
        "My shirt got all crushed in the suitcase.",
        "My trousers wouldn’t zip up — the zip’s stuck.",
        "He bought a pair of cotton/nylon/woollen socks.",
        "He’s ironing his trousers.",
        "Her blue dress is coming/falling apart at the seams.",
        "He took off his coat and hung it up.",
        "He’s a careless dresser.",
        "This style/colour suits you very well.",
        "Her new dress has a zip/buttons at the back.",
        "She wore a pink dress with a flowery pattern.",
        "He undressed, and went to bed.",
        "This dress fits you perfectly.",
        "She altered the dress to fit her daughter.",
        "I had dressed up to go to a party when they came in.",
        "He changed out of his overalls and into clean clothes.",
        "She was wearing a blue blouse with a low neck.",
        "What size are you?",
        "What’s your size?",
        "Look at the creases in her dress — was she sleeping in it or what?",
        "That’s a dress with style — I like it.",
        "Could you thread this needle for me? I want to sew up a hole in my jeans.",
        "He zipped up his trousers.",
        "That’s a neutral tie — you can wear it with a shirt of any colour.",
        "He always wears conservative clothes.",
        "Your flies are undone — zip them up.",
        "His sleeves were rolled up to the elbows.",
        "She’s a dressmaker.",
        "He had a loose shirt on.",
        "He took off the wet clothes.",
        "The shop assistant put the dress in a bag and gave it to her.",
        "It was a formal occasion, and so she decided to wear her new evening gown.",
        "If you don’t like that dress, try on some others before you decide which one to buy.",
        "She bought herself a new dress.",
        "He put the shirt on and folded the collar over.",
        "His clothes hung from hooks.",
        "I need a pair of gloves.",
        "He turned up/turned down his collar.",
        "He’s been using the same tailor for his trousers and shirts for several years now.",
        "He wore a plain white shirt.",
        "She caught her dress in the fence and tore a hole in it.",
        "He bent down and started tying his shoe laces.",
        "She put her dress on and did up the buttons.",
        "I’ll change my shirt and be back in a minute.",
        "What size do you take?",
        "Look at this top — it would match your skirt.",
        "He’s got a tie on today.",
        "He wore a casual dress for the dinner.",
        "Put the coat on the hook over there.",
        "He tied up his shoelaces.",
        "He always wears sandals in the summer.",
        "My mother is good at repairing/adjusting clothes.",
        "He put his shoes and socks on.",
        "He had a dressing gown on. I think he had just got out of bed.",
        "She was wearing a dress with short/long sleeves.",
        "That shop only sells ladies’ garments.",
        "He was very thin, and the shirt hung loosely on his body.",
        "His coat is lined with fur.",
        "They’ve gone to a women’s clothes shop to buy a dress.",
        "He stood there in the nude.",
        "I need some new clothes.",
        "This material washes well — the colour won’t come out.",
        "He was wearing a dark pin-striped business suit.",
        "When you iron my shirt, do the cuffs and collars properly.",
        "It was a cheerful occasion, but she came wearing a plain black dress.",
        "I can’t undo the bottom button of my shirt.",
        "I like that dress — it’s very simple in style.",
        "They always dress their children well.",
        "This dress has a tear in it.",
        "When he got on his motorbike, he split the seam on his trousers.",
        "Keep your scarf on — don’t take it off.",
        "He always wears clean, neatly-pressed clothes.",
        "What size shirt does he take?",
        "She hadn’t ironed her dress — there were a lot of creases in it.",
        "Go and change — put that blue dress on. We’ll have to get there by 5.",
        "She sewed the tear by hand, and not by machine.",
        "He was wearing a shirt, and it was open at the neck.",
        "He took his shirt off.",
        "He took off his shirt.",
        "I got out of bed, and went to open the door — I was in my pyjamas at that time.",
        "I can’t come out now — all my shirts are in the wash.",
        "I’m thinking of getting my jacket lined.",
        "You look very smart in that dress!",
        "Where’s the belt for this dress?",
        "I don’t think these two colours go together.",
        "He was completely naked.",
        "She put the washing in the sun to dry it off.",
        "I need a pair of ankle socks/knee socks.",
        "These shoes fit very well.",
        "The tailor took his measurements.",
        "The police officer stripped him and started searching.",
        "A button fell off his shirt, and his wife sewed it on.",
        "He’s gone to the tailor.",
        "Pack that dress properly — or you’ll crumple it.",
        "Are you looking for a plain dress or a patterned one?",
        "That shirt is too loose — you need a smaller size.",
        "She tied a silk scarf around her neck and set off.",
        "He’s opened a tailoring shop of his own.",
        "What size shoe(s) do you take?",
        "Your shirt is creased — why don’t you change it?",
        "She had a blue dress on.",
        "He had on a bathrobe.",
        "You should wear formal evening dress for the party.",
        "He looked as though he was dressed for some function or other.",
        "He put on his clothes.",
        "He put his clothes on.",
        "The shoestrings have come undone again — let me tie them up.",
        "He wore a shirt with pleats in the back.",
        "I’m going to wash my clothes.",
        "Let’s go to that shop. All the latest styles of hat/trousers/shoes are available there.",
        "This jacket has been lined with cheap cloth.",
        "Yellow and red certainly go together.",
        "Her skirt reached just below the knee.",
        "Check if the washing is dry, will you?",
        "He always wears freshly ironed shirts.",
        "He pushed his cuff back and looked at his watch.",
        "He helped her undo the top two buttons of her dress.",
        "He tore his trousers while climbing the ladder.",
        "She washed her underwear and hung them on the washing line.",
        "You’ve got a tear in the sleeve of your shirt.",
        "He was dressed only in a vest and underpants at that time.",
        "That dress hangs well on her.",
        "She knows how to dress well on very little money."
    ],
    " Group 2 ": [
        "These trousers are dirty — let me go and change them.",
        "He rarely wears a belt.",
        "She tied a knitted scarf over her head.",
        "She doesn’t like dresses that fasten with buttons/straps/buckles.",
        "What size shirt do you take?",
        "Do you like the style of this dress?",
        "You don’t need to change — you look beautiful in this dress!",
        "He put on his pyjamas and went to bed.",
        "The neck of his shirt was dirty.",
        "She washed her dress and hung it out on the washing line to dry.",
        "Fold up the clothes neatly, will you?",
        "These sheets need a good wash.",
        "Did you like her wedding gown?",
        "He was wearing a shirt with a stiff/big collar.",
        "He undid his belt and sat down.",
        "I like that red dress in the window.",
        "She trained as a dressmaker.",
        "Have you hung out the washing?",
        "He bought a pair of underpants.",
        "The tailor measured him for a suit.",
        "She undid the hem of the skirt to make it longer.",
        "He dressed casually/formally and came out.",
        "There was a hole in the toe/heel of his sock.",
        "Will you sew up this tear, please?",
        "He was standing there with his hands in his trouser pockets.",
        "Her new dress does up at the back.",
        "You’ll have to wash this dress by hand.",
        "He wore a check shirt/ jacket.",
        "Everybody has to wear uniform at school.",
        "Those shoes were a bad/poor fit.",
        "These trousers are too tight — you need a bigger size.",
        "She was wearing a scarf around her shoulders/ neck.",
        "He bought a pair of slippers for wearing in the house.",
        "Try these shoes on, and see if they’re the right size.",
        "His coat has a warm lining.",
        "This dress needs letting in at the waist.",
        "What a pretty dress she’s wearing!",
        "When you sit down, be careful not to crease your skirt.",
        "Go out and see if the clothes have dried out — they’re on the washing line.",
        "He changed out of his work clothes and came out.",
        "The skirt was too long, so she took the hem up and made it shorter.",
        "I don’t think these stains will wash out.",
        "That dress is with the dressmaker, waiting for alteration.",
        "That dress is too loose round her waist.",
        "She helped him do up the belt.",
        "He rolled up his shirt sleeves.",
        "The doctor asked me to strip.",
        "Bring the washing in before it rains.",
        "That dress fastens with a long back zip.",
        "Was he wearing a tie?",
        "Do you have any difficulty zipping up the dress?",
        "He rolled back his cuffs, and started washing his hands.",
        "Have the clothes dried?",
        "You should try on the shoes before you buy them.",
        "His shirt looked stained and dirty.",
        "She dresses expensively.",
        "Her dress had a pattern of red and green checks on it.",
        "This dress has a tight collar.",
        "She and her husband went for a swim in their underwear.",
        "She wrapped a shawl round the baby.",
        "He’s become too tall, and grown out of his clothes.",
        "What are you wearing to the dinner party?",
        "She got fat, and her dresses had to be let out round the waist.",
        "Where’s my pyjama jacket?",
        "Where are my pyjama bottoms?",
        "She ironed the shirt, and folded it up.",
        "These jeans have got oil on them — don’t wear them.",
        "The skirt was too short, so she let the hem down, and made it longer.",
        "I’m going to do a wash in the evening — the washing machine has been repaired.",
        "You won’t be able to get back today — why don’t you take a change of clothes in your suitcase?",
        "Do these trousers and this shirt go together?",
        "He always dresses with great style.",
        "Let’s put the washing out — everything will be dry in half an hour.",
        "It’s your turn to do the ironing this week.",
        "I’m thinking of buying a tie with spots/ stripes.",
        "She had a miniskirt and a tight top on.",
        "She tried on three dresses, and then bought one.",
        "He dresses well/badly.",
        "He was wearing a cotton/woollen vest.",
        "His shirt was open at the collar.",
        "I want to buy a pair of sandals.",
        "These shoes are a good/perfect fit.",
        "Look, you’ve torn your dress.",
        "A suit and sandals certainly don’t go together.",
        "The children stripped and jumped into the lake.",
        "He had on a white T-shirt.",
        "I don’t think this shirt is smart enough for your interview.",
        "She wore a cotton skirt with a matching top.",
        "She put the clothes away in a drawer.",
        "He bathed the child and dressed him in clean clothes.",
        "This dress needs washing.",
        "She always dresses in great style.",
        "He took his coat off and pulled his tie loose.",
        "Her new dress hooks at the back.",
        "He took off his clothes, and put them on a hook.",
        "He trained as a tailor.",
        "I’ve worn out the soles of my shoes.",
        "She put on her dress and fastened her belt tightly around her waist.",
        "He always wears baggy trousers.",
        "Her new dress ties at the neck.",
        "He always presses a crease in his trousers before wearing them.",
        "Why don’t you change into the new dress?",
        "She sat there hemming a dress/a skirt/the curtains.",
        "If you’re planning to stay overnight, take a second set of clothes with you.",
        "A thread has caught, and the zip sticks.",
        "When he lost weight, he had to alter his clothes.",
        "Children are growing all the time, and it’s very difficult to clothe them.",
        "You look so good in that dress.",
        "He stripped naked and started swimming.",
        "The baby was found wrapped in a blanket at their gate.",
        "She was wearing a simple blue dress.",
        "He had on a collarless jacket.",
        "That dress was made to fit a child.",
        "Go and put on a clean pair of trousers.",
        "His shoes were worn out, and he decided to buy a new pair.",
        "That’s a funny garment she’s wearing.",
        "This dress makes you look smart, but sexy.",
        "She can’t even sew on a button.",
        "She does a lot of dress-making.",
        "These jeans don’t fit — they’re much too loose round the waist.",
        "Don’t waste your time — get your clothes on, and come out quickly.",
        "Get your clothes off quickly.",
        "She sat in front of a mirror, and made up her face.",
        "He always wears blue/green/red.",
        "How are you going to dress for the journey?",
        "He sat down in a chair and loosened his tie.",
        "That top doesn’t match your skirt.",
        "He often wears sandals in warm weather.",
        "Does the colour of this dress go with the colour of the shoes?",
        "Mom, can you help me with my shoes?",
        "Keep your neck warm — turn up the collar of your coat.",
        "Some of the stitches have come out of this dress.",
        "That coat has a belt attached to it.",
        "Long skirts don’t really suit her.",
        "These shoes are too tight.",
        "She needs a size 12 dress.",
        "He was half-naked.",
        "That dress is made from cotton.",
        "Long skirts are the latest fashion.",
        "This dress is the right size, and it fits.",
        "You look smart in this dress, Peter.",
        "Look at those dresses hanging up in the wardrobe.",
        "These are the latest styles in trousers/ shoes/hat.",
        "He didn’t know his fly was undone, and he became embarrassed when someone pointed it out to him.",
        "Will you teach me to sew?",
        "Her new dress reached to her knees.",
        "I like to wear loose clothes.",
        "I felt her dress was rather skimpy — it didn’t cover much of her body.",
        "If you keep those shoes on too much, you’ll wear them out soon.",
        "She owns a dressmaking shop.",
        "She rarely wears bright colours.",
        "She was wearing high heels.",
        "He always wears stripy shirts.",
        "Go get changed — the train is at 5.",
        "I’ll have to buy one more shirt that goes with these trousers.",
        "Take a spare set of clothes with you.",
        "She only likes dresses that fasten up at the back.",
        "Her new dress needs altering.",
        "She’s a fashionable dresser.",
        "Casual clothes really suit you — you look good in them.",
        "His belt had a large brass buckle.",
        "Keep that shirt on — don’t take it off."
    ]
}