{
    " Group 1 ": [
        "They took him to the police station with them.",
        "The accused was remanded in custody.",
        "The trial is expected to take place immediately.",
        "He was arrested for taking part in a bank robbery.",
        "White-collar crimes are on the increase in many countries.",
        "They hijacked the plane at gunpoint.",
        "The terrorists were kept under armed guard.",
        "The police searched the house for clues.",
        "He’s not been charged for any offence so far.",
        "His main nighttime activity is burglary.",
        "The terrorists blew up the bridge.",
        "The police have picked him up for questioning.",
        "He’s been in prison for two years now, and has never been released on parole so far.",
        "Prison doesn’t change many criminals.",
        "He’ll now be tried in a court for the crime.",
        "Both the robbers have been sent to prison.",
        "He’ll have to stand trial for murder.",
        "Don’t let any strangers in.",
        "The police have not made any arrests so far.",
        "Mugging is on the increase in that area.",
        "The accused is liable to life imprisonment.",
        "He was arrested for conspiracy to murder.",
        "The police haven’t been able to catch the culprits so far.",
        "Gambling is illegal in this country.",
        "Many criminals don’t get punished for their crimes.",
        "Their accountant bled them dry.",
        "You’re lucky to get off with a caution.",
        "Hanging has been abolished in several countries.",
        "She caught a person breaking open her door.",
        "Most traffic offences are punishable with a fine.",
        "He’s in custody and will now be tried in a court.",
        "The prisoners were taken to the court under guard.",
        "The terrorists have planned to do away with the Home Minister.",
        "They were injured in the riot.",
        "Many of these prisoners expect to be pardoned and set free.",
        "He’s in prison for forgery and cheating.",
        "His duty was to guard the minister’s children.",
        "He was found guilty and was sentenced to two years in prison.",
        "He got away with only a fine.",
        "This isn’t the first time she has been picked for shoplifting.",
        "The court acquitted him of all the charges against him.",
        "The accused in this case faces life imprisonment.",
        "He’s a shady character — don’t have anything to do with him.",
        "Send for the police quickly.",
        "Every official we approached wanted money before helping us.",
        "He decided to plead guilty and to go to jail.",
        "He cheated her out of her money.",
        "He was convicted of rape and sent to jail.",
        "He was arrested for aiding and abetting them in the fraud.",
        "I saw a police officer in uniform standing there.",
        "There were two policemen on patrol that night.",
        "Many tourists are victims of petty theft.",
        "These are minor traffic offences.",
        "What you’ve done is a breach of our agreement.",
        "The demonstrators hurled bottles and overturned cars.",
        "Petty theft has been increasing in this neighbourhood for sometime now.",
        "Is he involved in the scandal?",
        "There were police officers at every door of the building.",
        "He admitted to the police that he was guilty.",
        "Somebody has stolen my watch.",
        "The criminals have all been arrested.",
        "We must help the police find the culprits.",
        "Nobody can make them see the error of their ways.",
        "He was lucky to get off with a light sentence.",
        "One of the robbers stood at the gate to keep watch for the police.",
        "There was only a small group of policemen to deal with the riot.",
        "He was found guilty, and they put him away for 5 years.",
        "As soon as he was arrested, he confessed to the murder.",
        "They were never punished for their crimes.",
        "This is the first time he’s been allowed out of jail.",
        "The bombs failed to explode.",
        "They have no clue about the murderer’s identity.",
        "They smashed windows and looted stores.",
        "The police have started investigating the murder.",
        "The escaped prisoners have gone into hiding.",
        "Many of the beggars in that area live off petty crimes.",
        "He stole a book from the library.",
        "The trial ended in acquittal/conviction.",
        "He’s a convicted thief.",
        "The police have caught two of the robbers.",
        "He paid the penalty for breaking the law.",
        "The police have completely cordoned off the area.",
        "He was hauled up in court for drunken driving.",
        "He stopped running away from the police and gave himself up.",
        "He was arrested for carrying illegal drugs."
    ],
    " Group 2 ": [
        "I don’t think he’s the culprit.",
        "They accused him of murder, kidnapping and bombing.",
        "Hijacking is done mostly for political reasons.",
        "A police officer stopped him and cautioned him for driving too fast.",
        "He was fined for dangerous driving.",
        "A number of demonstrators were injured.",
        "Crimes like these will not go unpunished.",
        "He was arrested for beating up somebody.",
        "They’ve locked him up in jail.",
        "He must have been running away from the police.",
        "Two police officers took the prisoners away.",
        "She killed him by using poison.",
        "Someone has taken the money.",
        "He got injured in a bar brawl.",
        "If you break the law, you will be severely punished.",
        "The police will be investigating the allegations thoroughly.",
        "They deliberately destroy public property.",
        "Terrorists and gangsters hire him to kill people.",
        "The police are expected to protect us and our property.",
        "He makes money by deceit and trickery.",
        "Someone has lifted my wallet.",
        "He hired a hit-man to kill them.",
        "They’ll arrest him soon.",
        "The police searched everywhere in the house, but couldn’t find the murder weapon.",
        "He was arrested for breaking and entering.",
        "The demonstrators clashed with the police.",
        "He was pardoned and released from prison last week.",
        "Nobody saw the crime taking place.",
        "Don’t forget that he was caught committing a crime.",
        "Some thugs attacked her and took all her money last night.",
        "They didn’t guard the prisoners well, and the prisoners escaped.",
        "This is nothing but blackmail.",
        "The murderer was sentenced to death.",
        "Their accountant was a crook.",
        "Strictly speaking, you’re guilty of law-breaking.",
        "He’s a criminal specializing in armed robbery.",
        "He used to take part in armed robbery.",
        "He attacked them and did them in with a hammer.",
        "Don’t park your car there.",
        "He gets money by doing all sorts of dishonest things.",
        "They kept him in the lockup for the night.",
        "We’ve been swindled!",
        "If you drive too fast, you may get booked.",
        "They sent him to prison for armed robbery.",
        "That court deals with drug offenders.",
        "The court found him guilty, and he got three years in prison.",
        "He’s a detective working in the police force there.",
        "Two of the robbers managed to escape.",
        "You should post some guards to protect the area.",
        "The police detained him for questioning at the police station.",
        "All his life, he has fought against crime.",
        "The murderer has turned himself in.",
        "The police have uncovered a plot to assassinate the Prime Minister.",
        "They couldn’t stop the prisoners from escaping.",
        "They’re a gang of thugs/criminals/ terrorists.",
        "Do you like gangster films?",
        "They held him up at gunpoint and robbed him.",
        "He’s a dangerous criminal.",
        "He’s a hardened criminal.",
        "You were trespassing on their land.",
        "He was charged with extortion.",
        "He’s a convicted criminal.",
        "He’s determined to expose corruption in the government.",
        "The guards checked the visitors for guns.",
        "His job is to catch smugglers.",
        "The court has dismissed the charges against him.",
        "Nobody will be able to bring criminals like him to justice.",
        "The terrorists killed him for informing on them.",
        "It’s illegal to drink and drive.",
        "Bribery is a serious crime.",
        "He attacked those people and stole their money.",
        "Someone broke into his house last night.",
        "He’s guilty of a serious crime.",
        "They lead a life of crime.",
        "I think the evidence has been made up to get him convicted.",
        "Somebody robbed them of all their money.",
        "He uses force and threats and gets money from people.",
        "They look after law and order in the city.",
        "Someone broke into his house and made off with all his money.",
        "His house is a meeting place for all kinds of criminals.",
        "They roam around looking for something to steal.",
        "Nobody likes the police there."
    ]
}