{
    " Group 1 ": [
        "The police car overtook our car.",
        "On hills, you must use low gears.",
        "I was in a traffic jam for more than an hour.",
        "The car must be in neutral when you start the engine.",
        "Get out of the way — the car is backing up.",
        "I hate driving along stony roads.",
        "Turn off this road at the next corner on the left.",
        "Let’s park the car here.",
        "I got stuck in traffic for some time.",
        "Put the gear lever in the neutral position, and start the car.",
        "The authorities will have to do something to reduce the traffic jams in the city centre.",
        "The truck veered out of control, overturned, and hit a lamp-post.",
        "The sign said ‘No Parking’.",
        "This tyre is very worn — you should get it changed.",
        "There were skid marks on the road where the accident happened.",
        "Pull up at the pedestrian crossing.",
        "Put the car in the garage, and lock the garage door.",
        "Most cars have four forward gears and a reverse.",
        "I’m thinking of learning to ride a motorbike.",
        "A car came in the opposite direction, and the driver dipped his headlights.",
        "The car kept hitting potholes and bumps.",
        "He was arrested on suspicion of drunk driving.",
        "He drives very well, and he’s very cautious, too.",
        "He goes to work by car/on his motorbike.",
        "What’s the correct tyre pressure for your tyres?",
        "The car was travelling very fast.",
        "The crash happened on a sharp bend.",
        "That car didn’t have its headlights on.",
        "The car skidded and hit a lamp-post, and the side of the car crumpled.",
        "If you use the choke when you start the car, you should push it in before you move forward. Yes, push the choke in when the engine is idling.",
        "A few speed-bumps will have to be installed in that street.",
        "For a moment, I was blinded by the lights of the oncoming car.",
        "The driver pulled up in front of a shop.",
        "Slack off when you approach the junction.",
        "He got into the car and fastened the seat belt.",
        "The tyres squealed when he braked hard.",
        "Can you ride a motorbike?",
        "His car drove into the back of mine.",
        "He crashed the car into a tree and smashed it up.",
        "This is the second car he’s smashed up.",
        "He was involved in a motor accident.",
        "She swerved to avoid another car.",
        "Is there a garage in this street?",
        "The car began to speed up.",
        "During the rush hour, the traffic would be bumper to bumper.",
        "She went round the building.",
        "He rides to work on a motorbike.",
        "The car was in third gear.",
        "My tyre burst when I was driving along a stony road.",
        "He released the hand brake, and the car moved forward.",
        "The car hit a lamp-post.",
        "There was heavy traffic on the roads.",
        "He got into the car, and wound the window down.",
        "In a few minutes, he began to speed up.",
        "He opened the door, got in and started the car.",
        "He pulled into a petrol station.",
        "I saw the car turning the corner.",
        "The car park is behind the building.",
        "He rides his motorbike to work.",
        "The driver got out of the bus.",
        "I was doing 60 kph, and a blue Maruti passed me at 90 kmph.",
        "He drives to work by car.",
        "That’s a dangerous stretch of road.",
        "Let’s go out for a drive.",
        "He got into the car and folded the roof down.",
        "These parking spaces are reserved for employees.",
        "I don’t want to go with him — he’s not a safe driver.",
        "He let the engine tick over for about 30 seconds before the car moved forward.",
        "The car skidded on the road — the driver had pulled up too fast.",
        "We’ve nearly run out of petrol.",
        "He pressed the accelerator hard.",
        "Is the hand brake on or off?",
        "Put the car in gear and drive on.",
        "This is a no-parking zone.",
        "Our car had a breakdown, and we had to push it into a garage.",
        "He braked sharply to avoid a car.",
        "He wound up the window, and locked the car door.",
        "He undid the seat belt, and got out of the car.",
        "Put your car into neutral when you stop at traffic lights.",
        "The car is now in bottom gear.",
        "I’ve got another puncture in my front tyre.",
        "He turned down a street where there was a ‘No Entry’ sign.",
        "Change into second gear when you go up the hill.",
        "He took the handbrake off, and the car moved forward.",
        "Why don’t you roll the window down?",
        "The authorities have been doing their best to ease traffic congestion in the city.",
        "I thought he would pull up at the traffic lights, but he drove straight on.",
        "We saw a restaurant by the road, and pulled in.",
        "I think you’re a bit low on petrol.",
        "Our car was travelling at a speed of 60 kilometres per hour.",
        "Is this a parking place?"
    ],
    " Group 2 ": [
        "Can you ride a motorbike?",
        "He hasn’t passed the driving test yet.",
        "A car came round the corner, and knocked an old man over.",
        "A car suddenly pulled out in front of me and I braked.",
        "The car bumped against the kerb.",
        "He braked sharply to avoid an old lady.",
        "This is considered to be a high-performance car.",
        "He drives very smoothly.",
        "You should press the clutch pedal down when you put the car in gear.",
        "The driver put on the brakes, and the car went into a long skid.",
        "A little later, the car began to slow down.",
        "Don’t forget to put the hand brake on.",
        "Many motor accidents are the result of mixing speed and alcohol.",
        "Before you start the car, you should check that the gear lever is in neutral.",
        "His car was travelling at speed when it crashed.",
        "I had to change a wheel on the way.",
        "The bus is now in top gear.",
        "There was a traffic accident in front of our office today.",
        "How much petrol do you want?",
        "You should change gear at the bottom of the hill.",
        "He reached a dead end, and had to turn round.",
        "I always keep a spare wheel in the back of my car.",
        "He’s taken the children out for a drive.",
        "Remove the key from the ignition switch.",
        "He put the car in gear and drove off/away.",
        "Today traffic was unusually light.",
        "The car veered across the road and overturned.",
        "He didn’t stop at the traffic lights, but went through them.",
        "He was driving a fast car, and he shot past me.",
        "Let’s pull into that restaurant.",
        "Put your foot down on the accelerator.",
        "He was killed in a car accident.",
        "Many accidents are caused by bad driving.",
        "I could see a car’s headlights coming towards me.",
        "I had to drive along a dirt road/track to get there.",
        "Do you have a driving licence?",
        "I think we’re getting low on fuel.",
        "Can I park here?",
        "Does the car perform well in the wet?",
        "I think there’s something wrong with the brakes.",
        "I’ve paid Rs.200 in parking fines this year.",
        "Change lanes — we’ll have to turn off at the next junction.",
        "That’s a very rough road — let’s avoid it.",
        "Now push the choke in, and change from neutral into first gear.",
        "The crash happened in thick fog.",
        "You’ve forgotten to fasten your seat belt.",
        "I hate to drive in city traffic.",
        "I don’t think the tyres have enough air in them.",
        "Stop the car, and let those children cross.",
        "The car won’t start? Pull the choke out, and try again.",
        "I couldn’t find a space there to park the car.",
        "Now you can change into fourth gear/change into fourth.",
        "She knocked down somebody, and had to take him to a doctor.",
        "Let in the clutch, and change gear.",
        "She changed gear, and let out the clutch.",
        "You shouldn’t drink and drive.",
        "He braked sharply, and the car skidded out of control.",
        "By then, the traffic had slowed down to a crawl.",
        "Thick fog made driving conditions dangerous.",
        "He almost knocked down an old lady.",
        "Change into neutral before you start the car.",
        "You’re still in gear — don’t turn off the engine now.",
        "There were patches of dense fog, and they made driving dangerous.",
        "And then, he steered the car into the middle of the lane, and started driving at a steady speed.",
        "I was stuck in a traffic jam for an hour today.",
        "He was drunk, and was not in a fit state to drive.",
        "You can’t park in the city centre.",
        "He opened the door, and got into the car.",
        "I saw him getting off his motorbike.",
        "That car hasn’t got its lights on.",
        "This car goes very fast, and accelerates very quickly — I’m really satisfied with its performance.",
        "He drove her to the railway station.",
        "He parked at the side of the road.",
        "You must put some air in the tyres — they look flat.",
        "You’re going in completely the wrong direction.",
        "These cars perform badly/poorly in cold weather.",
        "What’s the speed limit on this road? 60 kilometres per hour?",
        "I was only doing 50 kilometres per hour, so I was under the limit.",
        "When you’ve put the car in gear, ease your foot off the clutch pedal, and let the clutch up.",
        "That car runs on diesel, and not on petrol.",
        "Please move your car — it’s blocking the road.",
        "He isn’t exactly the most careful driver I know.",
        "He pulled up at the traffic lights.",
        "Don’t pull the choke out like that. That’s too much — you’ll flood the engine.",
        "He lifted the car on a jack, and started changing the wheel.",
        "Don’t leave the car in neutral gear.",
        "He turned down a one-way street and received a warning.",
        "The driver blew the horn.",
        "The car hit the kerb as the driver pulled over.",
        "Which side of the road were you driving on?",
        "There was a car crash in our village last week.",
        "Does he still drive that old car?",
        "He almost ran over a dog.",
        "Can you drive me home?",
        "He has never been convicted of a motoring offence.",
        "He let off the clutch, and the car moved forward.",
        "He started the car, pulled away from the side of the road, and drove off.",
        "Traffic congestion is a major problem.",
        "He brought the car to a stop in front of the building.",
        "Somebody has parked their car in front of the gate.",
        "You’re driving much too fast — slow down a bit.",
        "When you go up a hill, you must drive in a low gear.",
        "The car was travelling at top speed.",
        "I saw a car parked in front of his house.",
        "He usually drives to work.",
        "He got on his motorbike, and rode off.",
        "He had to pay a Rs. 50 fine for jumping a red light.",
        "Turn the steering wheel to the left.",
        "It’ll take a couple of minutes for the engine to warm up.",
        "He received a Rs. 250 fine for speeding.",
        "He put the car into reverse, and started backing up."
    ],
    " Group 3 ": [
        "The driver looked over his shoulder to check that he was clear to move off.",
        "The robbers were in a getaway car, and the police jeep was gaining on them.",
        "Everyone who owns a car must have motor insurance.",
        "The car skidded off the road, overturned and smashed into a wall.",
        "The car began to go more slowly.",
        "There’s a slight/gentle bend in the road.",
        "Turn the key, and switch on the ignition.",
        "I got stuck in a bumper-to-bumper traffic jam.",
        "He put on the brakes, and the car came to a halt.",
        "It was very cold, and I couldn’t start the car up.",
        "How do you like your new car?",
        "He stopped the car and switched off.",
        "He’s going to turn left — his left-hand indicator is flashing.",
        "He was a learner driver, and there was an L-plate on the front and back of the car.",
        "Don’t forget to sound the horn now and then.",
        "I saw the car going round the corner.",
        "That was the sound of a truck changing gear.",
        "The driver gave a signal, and then turned left.",
        "Engage the clutch a little more.",
        "Make sure the car is in neutral, and then turn on the engine.",
        "He pulled the car into a tight parking space.",
        "That road is closed because of an accident.",
        "I’m taking the car to the garage today.",
        "He slowed down, and pulled into the garage.",
        "We’ll fill up with petrol at the next station.",
        "The accident happened because the brakes stopped working.",
        "There’s a heavy fine for driving drunk.",
        "He broke down on a country road, and there were no garages within 10 miles.",
        "Can you drive a car/bus/lorry?",
        "If you press the accelerator, the car will go faster.",
        "Luckily, I had a spare can of petrol in the car.",
        "I saw his car shooting traffic lights.",
        "He turned down a side road.",
        "Use your mirrors to check that you’re clear to move off.",
        "These motorbikes have a reputation for poor performance.",
        "She could hear the skid of the car as it went round the corner.",
        "Don’t forget to check your tyre pressure.",
        "He stopped the car at a pedestrian crossing.",
        "Turn the key, and start the engine.",
        "Ask him to back up a bit.",
        "I think we’re going the wrong way — let’s turn round.",
        "She sounded the car horn.",
        "Put the car away in the garage, will you?",
        "Where is the car key? I had kept it here.",
        "He was driving cautiously in third gear.",
        "Could you lend me your car for a day?",
        "He didn’t stop the car, but continued driving.",
        "Use a jack, and lift the car off the ground.",
        "Now change into the third gear.",
        "Wind down the window, will you?",
        "Pull over, and shut off the engine.",
        "I saw that car drive past.",
        "The car hit a hump in the road and swerved.",
        "He turned off the road at the corner.",
        "The car swerved across the road, and crashed into a tree.",
        "I was in a hurry, and I asked the driver to speed up.",
        "He drives well.",
        "This is the rush hour, and you’ll have to travel bumper to bumper.",
        "Can you drive?",
        "I drove along a mountain road full of stones and holes.",
        "He was killed in a road accident.",
        "The police have closed the road to traffic.",
        "He unlocked the car door and got in.",
        "His car soon gained speed and passed the other cars.",
        "He started the car and drove off at high speed.",
        "He had a motorbike accident last week.",
        "Don’t forget to use your indicators when you turn left or right.",
        "There was a sharp/ sudden bend in the road, but the driver negotiated it quite well.",
        "He put his foot on the brake, and just managed to stop in time.",
        "Were you aware of the speed you were driving at?",
        "The petrol tank is nearly empty.",
        "His new car rides smoothly.",
        "When you start the engine, you may need to press the accelerator slightly.",
        "I had to pull up at a red traffic light.",
        "The windscreen was filthy, and I gave it a clean.",
        "Does his new car have power steering?",
        "The driving instructor asked him to get into the car.",
        "He braked to a halt, and got out of the car.",
        "Pull over to the side of the road — I want to buy something.",
        "He slammed on the brakes, and skidded to a halt.",
        "Last evening, we went for a drive along the coast.",
        "He pushed the bike up the hill — it was too steep to ride.",
        "He pulled in at the side of the road.",
        "Was there a lot of traffic on your journey?",
        "Do you know that petrol pump attendant?",
        "The tank is almost empty. Fill it up, will you?",
        "There will be a lot of traffic during the morning/evening rush hour.",
        "He took my car out and crashed it.",
        "He drove through a red light, and the police stopped him.",
        "He went round the corner at top speed.",
        "His new car drives easily.",
        "Make sure you lock the car.",
        "I had a breakdown on the way, and I had to call a mechanic.",
        "He tried to overtake the truck on the bend, and that was when the crash happened.",
        "A car pulled up, and the driver jumped out.",
        "He jumped on/onto his motorbike, and raced off down the road.",
        "He started the car, gave a signal, and pulled out into the road.",
        "The truck veered out of control, and smashed into a tree.",
        "There’s parking for our customers behind this building.",
        "His brakes stopped working on the way.",
        "Will you teach me how to drive?",
        "Whenever you start the engine, you raise it noisily.",
        "He swerved to avoid the potholes.",
        "He had an accident, and had to go to the police station to make a report.",
        "She got a Rs. 50 fine for breaking the speed limit.",
        "He got into the car, and did up the seat belt.",
        "You should always carry a spare tyre in your car.",
        "He drove into a lamp-post, and the front of the car crumpled.",
        "Don’t exceed the speed limit — you’ll be fined heavily.",
        "Don’t forget to indicate when you pull out into the road.",
        "I watched the driving instructor changing through his gears.",
        "You may find it difficult to start your car up in cold weather.",
        "He was injured in a car accident.",
        "I saw a car speeding away.",
        "He braked too late, and crashed into the car in front.",
        "A van drove into his car, but he escaped unhurt.",
        "The car pulled in and waited.",
        "The cars moved off when the traffic lights turned green.",
        "She parked the car in the drive, and went into the house.",
        "His new car is very powerful, and it corners well.",
        "You should only press the accelerator slightly.",
        "The car was travelling at great speed.",
        "The road was wet, and the wheels skidded.",
        "He started up the car and drove off.",
        "You should drive every day to charge up the battery.",
        "Within a few minutes, a police car drove up.",
        "If you’re over the speed limit, the traffic police will stop you.",
        "The engine stalled when I tried to start it.",
        "The driver was killed in the crash."
    ]
}