{
    " Group 1 ": [
        "Let’s go out and see a film. What’s on at the Rex?",
        "There’s a good film on at the Odeon.",
        "He has no interest in music.",
        "Earlier, they used to give parties every month, but they don’t entertain much nowadays.",
        "They went on a tour of Kerala during the summer holidays.",
        "He kept talking throughout the meal.",
        "How do you fill your leisure time?",
        "He’s been living a life of ease.",
        "The fairground was full of roundabouts, swings and other amusements.",
        "Have fun!",
        "He only likes films/books that are full of humour.",
        "He played a popular tune.",
        "He likes playing with his children — he gets a lot of happiness from it.",
        "Don’t keep working hard like this — you need some relaxation.",
        "He started telling a story to amuse the children.",
        "Performances like these never fail to entertain people.",
        "We enjoyed the holiday very much.",
        "I love watching magic tricks.",
        "He told me a funny story today.",
        "She’s showing an interest in music.",
        "I don’t have much time to do things that I enjoy doing.",
        "I want to be able to live as I want, without any worries or problems.",
        "He took the children to a restaurant as a special treat.",
        "Rock climbing seems to be the latest craze among teenagers.",
        "It’s cheaper to do your entertaining at home rather than in restaurants.",
        "We went to an exhibition of pictures at the art gallery today.",
        "He used to do circus stunts.",
        "I can’t describe the feeling of happiness and satisfaction that was with me at that time.",
        "What fun!",
        "Cooking is something she really enjoys doing.",
        "He’s away on holiday.",
        "The children were playing doctors and nurses.",
        "The children are playing soldiers/pirates.",
        "Shows like these are intended to inform and entertain.",
        "He loves travelling — it gives him a lot of pleasure and enjoyment.",
        "I don’t want to stay in and watch TV. That’s not my idea of an evening’s entertainment.",
        "Eating is his only interest in life.",
        "The children are playing on the swings.",
        "He doesn’t earn a high salary, but he gets job satisfaction.",
        "Did you see the exhibition of sculptures at the museum?",
        "That day, he was entertaining a few friends for drinks.",
        "This is a special occasion, and we should give a party to celebrate it.",
        "Who are the cast (in/of the play)?",
        "Everyone wants to live in comfort.",
        "Children get a great deal of fun out of playing jokes at others.",
        "He doesn’t consider gardening to be work — he considers it to be a pastime.",
        "I don’t like swimming.",
        "The trouble is, he doesn’t get relaxation or rest from work.",
        "He’s won first prize — let’s celebrate.",
        "He was full of amusing stories.",
        "She gets huge pleasure from music.",
        "We went for a show at the theatre last night.",
        "He played the leading role in that film/play.",
        "What are the recreation facilities like in your city?",
        "I don’t feel much enthusiasm for that film.",
        "Golf is a very enjoyable outdoor activity.",
        "They’re planning to put on an exhibition of her drawings.",
        "One thing about the new teacher is, she entertains as well as teaches.",
        "He’s planning to throw a birthday party.",
        "He always has his evening meal with his children.",
        "We went to the circus yesterday.",
        "What’s playing at the cinema?",
        "Golf is an excellent amusement.",
        "I know the tune, but I don’t know the words.",
        "I’ve always liked fishing.",
        "I wish I had more leisure time/leisure.",
        "They spend a lot of money on entertainment.",
        "The celebrations include a huge display of fireworks/firework display.",
        "He takes pleasure in eating.",
        "Did you watch the 9 o’clock show on TV? It was full of comedy scenes.",
        "He’s won the election — let’s have a celebration.",
        "He looked very relaxed and happy.",
        "Her chief interests are dress designing and cooking.",
        "They’ve gone to watch the fireworks.",
        "He couldn’t find any amusements to pass the time without getting bored.",
        "Every day, he spends some time entertaining his children when he gets back from work.",
        "That play has no humour in it.",
        "The place we stayed at had a beautiful view of the mountains.",
        "You can’t fish (in) this river.",
        "How can you prevent us from fishing (in) the sea?",
        "Didn’t you go to the party at Peter’s house?",
        "He played/sang two numbers from that film.",
        "He doesn’t like mixing business and pleasure.",
        "Swimming and golf are his favourite leisure activities.",
        "Films are the only amusement that place has — you’ll quickly get bored there.",
        "Everybody needs some rest and relaxation.",
        "What do you do in your free time?"
    ],
    " Group 2 ": [
        "Do you like watching sport?",
        "It’s a funny film/play, and the cast are good.",
        "She only likes shows full of popular songs.",
        "Travelling is something he likes and enjoys.",
        "Did you enjoy last night’s party?",
        "The audience was very excited by the performance.",
        "He only likes films that have a lot of action.",
        "Canoeing is a great outdoor activity.",
        "The children amused themselves by playing in water.",
        "His new film has a lot of excitement and comedy.",
        "These toys are sure to amuse your children.",
        "It was the second time he had treated her to ice cream/lunch/dinner.",
        "His mother gave me a delicious meal.",
        "Don’t play your radio so loud!",
        "Play the radio a little louder, will you?",
        "Do you like camping in the hills?",
        "That film really bored me — it was very dull, you know.",
        "That was a lovely birthday party.",
        "Do you know how to play the piano?",
        "They were very amused, and they started laughing.",
        "He paints for pleasure.",
        "Drawing is her chief enthusiasm.",
        "Our town has a lot of leisure facilities like tennis courts, sports halls, and swimming pools.",
        "The TV and the radio are the only amusements she has.",
        "Let’s go to the cinema tonight.",
        "He enjoys watching football matches — it gives him a lot of pleasure.",
        "He’s a gifted actor/ singer/performer.",
        "He laughed at the trick they played on him — he’s a real sport.",
        "Who’s that actor? His performance is very good.",
        "I think the audience is delighted with the performance.",
        "He enjoys outdoor activities a lot.",
        "That was a funny film — we couldn’t stop laughing.",
        "The children amused themselves by playing out in the sunshine.",
        "He walked out on the stage, and started doing his show.",
        "We enjoyed our meals together.",
        "We’re planning to go camping during the summer holidays.",
        "When they won the match, they had a celebration party.",
        "She was dancing to fast music.",
        "When she got her salary, she decided to treat herself to some new clothes.",
        "I like painting portraits — I get a lot of satisfaction and enjoyment from it.",
        "What are the facilities for leisure activities your town has?",
        "He plays tennis — that’s the only amusement he has.",
        "For relaxation, he lies down and listens to music.",
        "Then there was a light entertainment programme.",
        "They’re a troupe of travelling actors/dancers/singers, and they’re giving a performance tonight.",
        "He has very little leisure time in that job.",
        "He sang well, and the audience gave him a clap.",
        "They’re planning to go to Ooty for their holidays.",
        "I need a rest — I’m thinking of going on holiday for a week or two.",
        "His behaviour amused me.",
        "We sat there, talking about magazines and cricket.",
        "He likes to have three good meals a day.",
        "We’re planning to go on a camping trip next week.",
        "Don’t you want a life of comfort?",
        "Did you like the play they performed last week?",
        "The children enjoyed themselves playing in the garden.",
        "Football matches on the TV and films are his chief amusements.",
        "The children are playing on the beach.",
        "They stopped for refreshments on the way at Mysore.",
        "He’s a gifted musician, and he gave a remarkable performance.",
        "What do you do in your leisure hours?",
        "They enjoyed the singing, and they clapped hard.",
        "He only got back from holiday yesterday.",
        "The show included several short performances — dancing, singing, comedy and magic tricks.",
        "What he said amused everybody.",
        "Nowadays we don’t entertain guests.",
        "She had a simple meal of bread and butter.",
        "We made camp on a low hill.",
        "I spent the afternoon reading under the trees.",
        "She’s gone to a friend’s wedding.",
        "Don’t you like classical music?",
        "Her jokes never get many laughs.",
        "She enjoyed herself at the party.",
        "Tennis is his favourite pastime.",
        "He’s good fun — he keeps telling jokes and stories.",
        "He regularly entertains his business associates.",
        "I don’t enjoy tragic plays at all.",
        "Our town is planning to hold a festival of dance/music/theatre.",
        "Reading is one of his favourite relaxations.",
        "She has a poor singing voice.",
        "We didn’t go on holiday last year.",
        "We’re going to a variety show tonight.",
        "I’m amused to find them here.",
        "That’s a very entertaining film.",
        "I need a good night’s rest/sleep.",
        "I like fresh fish.",
        "We stayed in tents at the campsite.",
        "When is the next family get-together going to be?",
        "There are very few evening entertainments in our town.",
        "Has he lost enthusiasm for sport?",
        "They’re thoroughly enjoying themselves.",
        "What do you do in your spare time?",
        "We had a lot of a fun at the party last night.",
        "I just went for the fun of it.",
        "Who plays the lead in that film/play?",
        "Who produced that TV show?",
        "That film/play is a musical, and is full of singing and dancing.",
        "He’s too busy for recreation.",
        "Are you interested in dancing?",
        "I spent the afternoon doing very little.",
        "I don’t like teaching. Do you think I do it for enjoyment?",
        "She went on stage, and started singing.",
        "It amused me to find them there.",
        "The guests were entertained by singers and dancers.",
        "Then they went into the house for food and drink.",
        "When they won the match, their coach was very excited about it.",
        "That was an amusing story.",
        "Do you like watching television shows?",
        "After his retirement, he doesn’t entertain much. But earlier, he used to entertain his clients often.",
        "His enjoyments in life are limited to gambling and drinking.",
        "Music and golf are his current enthusiasms.",
        "There’s no fun in staying in — let’s go out.",
        "You must find some time for relaxation.",
        "Who’s the leading man/lady in that play?",
        "Watching cricket is a great national/ popular pastime here.",
        "Does your town have a lot of recreational facilities?",
        "How often do you go to dancing classes?",
        "Yesterday was a day of rest.",
        "They’ve gone to Goa for a holiday.",
        "She clapped her hands in time to the music.",
        "She had an amused expression on her face.",
        "We used to invite our friends to our house and entertain them now and then.",
        "Did you have any refreshments during the journey/meeting?",
        "I liked the campsite very much.",
        "That was an entertaining story.",
        "That play is a funny comedy — you’re sure to like it.",
        "Reading brings a lot of enjoyment.",
        "It was a fun evening.",
        "We went for a film last night, but it was poor fun.",
        "Who’s playing the role of Othello?",
        "Gardening is one of his favourite hobbies."
    ]
}