{
    " Group 1 ": [
        "Do you know how to use a computer?",
        "I don’t think he’s familiar with computers.",
        "Are you new to computers?",
        "Show me how to make the computer do something.",
        "Our computer was down for an hour yesterday, and so I couldn’t complete the job.",
        "My computer doesn’t work — it doesn’t even give an error message.",
        "Do you have a computer?",
        "Computers have become smaller, cheaper and more powerful.",
        "Have you turned the computer off at the plug?",
        "Computer is a good way to get more done in less time.",
        "I can’t access the menu.",
        "He taught us how to create files and folders, how to save files to the hard disk, how to copy and rename files, and how to delete them.",
        "Their firm produces computer software.",
        "I’m not an expert or anything — I’m just a normal computer user.",
        "Show him how to format a floppy disk, will you?",
        "How do I get back to DOS?",
        "These bills were made by computers.",
        "Before you buy your computer, think carefully about what you want to use it for.",
        "Can you show me how to load this program onto the computer?",
        "Without the proper software, your computer won’t be able to do anything.",
        "My disc is full.",
        "Is your PC still under warranty?",
        "The monitor goes blank often — but the press of a key restores it.",
        "You don’t need to know how a computer works — you only need to know how to use it.",
        "I’ve been trying to learn some basic computer stuff.",
        "Those two files can only be accessed with special keystrokes.",
        "You’d better store the backup disks in some other room.",
        "Is the computer’s power cord plugged into the wall?",
        "It’ll be less expensive to upgrade the computer you already have than to buy a new computer.",
        "Do you know how to use a computer and 46do something?",
        "Computers came about as the result of a long series of experiments.",
        "I don’t think the keyboard is plugged in right.",
        "Of course, computers take away some people’s jobs. At the same time, they also create a number of new jobs.",
        "I’m thinking of buying an accounting application.",
        "Did you install any new part recently?",
        "His new computer has a colour monitor.",
        "Monochrome monitors are cheaper.",
        "If your computer doesn’t work, look for loose cables.",
        "The computer system at the bank crashed today, and I couldn’t withdraw the money I needed.",
        "He leaves his computer turned on all the time.",
        "I have a broken hard disk/a broken monitor. Do you know anyone who can repair it?",
        "You should make a backup of all the information held on the computer.",
        "The computers you buy today will be out of date in two or three years.",
        "I accidentally typed a wrong command.",
        "All he knows is a few common computer phrases.",
        "Your monitor should be up around your eye-level.",
        "Look at the speed computer technology is advancing at.",
        "Which key should I press to exit the system?",
        "How do you format discs?",
        "Is the power light on the front of the system unit on?",
        "I’ve been fiddling around with a new piece of software.",
        "Viruses are nasty computer programs, you know — and they can infect your computer.",
        "He seems to have fallen in love with computers.",
        "Computer technology is progressing very fast.",
        "Hardware is the physical part of the computer.",
        "Software controls what a computer does.",
        "The keyboard was working okay in the morning, but now it doesn’t work.",
        "Check the cable connections.",
        "He’s paid a lot of money for his computer.",
        "Software is the set of instructions that make a computer work.",
        "You have to learn what computers can do and what they can’t.",
        "His computer has 128 MB of memory.",
        "Peel and stick the sticky label onto the floppy disk."
    ],
    " Group 2 ": [
        "There are lots of reasons to learn about computers.",
        "He’s very good at fixing computers.",
        "That’s a new software package, and I 47don’t know how to use it.",
        "Computer software comes on floppy disks and CDs.",
        "Have you plugged the mouse all the way in?",
        "Check the brightness knob on the monitor. Has someone turned it down?",
        "I’m very seriously thinking about getting a computer.",
        "The printer receives input from the PC and generates output in the form of a print-out.",
        "Don’t you know what a computer is?",
        "I think it’s high time you started learning basic computer skills.",
        "If your PC seems completely dead, make sure all connections are right.",
        "If you want to exit, press the ‘Escape’ key.",
        "I started up the computer, but all I got was a blank screen. Is my monitor the problem?",
        "The monitor is blank.",
        "What’s the storage capacity of your hard disk?",
        "They’ll teach you everything you need to know about your computer.",
        "Copy the files from the floppies to the hard disk.",
        "I can’t get in to the program.",
        "The software tells the hardware what to do.",
        "When I press keys, the keyboard doesn’t respond.",
        "I know what computers are, and something about the way they work.",
        "The repair man forgot to turn off the power before opening the PC.",
        "There’s been a number of important computer developments recently.",
        "He told us about a few day-to-day mistakes computer users tend to repeat.",
        "Copy all this onto a CD.",
        "This program doesn’t take much time to load.",
        "My document isn’t printing right.",
        "It can take months to gain skill and confidence with your new computer.",
        "Their company makes computer hardware.",
        "I find myself frustrated by the way the computer has slowed down.",
        "I can’t log on/in.",
        "How much memory does your computer have?",
        "Computer programs are called software.",
        "Is the power light on the front of the monitor on?",
        "Computers are becoming more and more common everywhere.",
        "The computer suddenly stopped working.",
        "At the end of the day, he always backs up his work to/onto floppy disks.",
        "A computer is like a super calculator.",
        "You’re going to have to know something about computers if you want to be successful in your career.",
        "Just restart the computer.",
        "How do I get it to print?",
        "I think you’ve entered the command incorrectly — that’s why the computer is not responding.",
        "Are all 48the cables plugged in securely?",
        "Load the CD into the computer.",
        "My computer keeps crashing.",
        "Boot up the computer, will you?",
        "Has the computer booted up?",
        "If you don’t want to lose information, back up the hard disk regularly.",
        "My floppy drive isn’t working properly.",
        "Did they teach you anything substantial about your computer?",
        "This is the second time our computer network has crashed this week.",
        "My mouse is stuck, and it has locked my system up.",
        "Comparison of these figures will be made by computer.",
        "If you want to keep up with advancing technology, you’ll have to upgrade your PC from time to time.",
        "He’s writing software to do this work quickly.",
        "A computer helps you get organized.",
        "I’m just trying to get acquainted with the keyboard.",
        "All these problems were caused by computer error.",
        "Have you changed anything on your computer recently? Added a second floppy drive or a new piece of software or something?",
        "A computer user doesn’t have to learn the inner-workings of a PC.",
        "They installed a new computer system in their office last week.",
        "One thing about computers is, they make information easy to store and retrieve.",
        "Computer hardware is computer machinery and equipment.",
        "The system crashed in the morning, and it was down for three hours.",
        "They have a computer network with 100 or so terminals.",
        "Keep the keyboard below your elbow level, so you can avoid injury to your wrists.",
        "How do I get back to the desktop?",
        "The screen is frozen.",
        "The screen is not moving.",
        "I’m using the keyboard, but nothing’s happening.",
        "The monitor is wavy.",
        "I don’t think he has any experience with PCs."
    ],
    " Group 3 ": [
        "I had accidentally jerked/pulled a cable loose from the back of the monitor — that was what caused the problem.",
        "They’ve been trying to program their computer to do this job.",
        "We use a computer to keep track of accounts and invoices.",
        "Have you opened up your PC at any time and looked inside?",
        "Have you 49keyed all the data into the computer?",
        "My computer keeps freezing up — the Service Engineer says there’s a bug in the software.",
        "What does ‘illegal operation’ mean?",
        "Are all viruses destructive?",
        "If you want to run the latest software, you may have to upgrade your PC.",
        "Computers are very useful.",
        "Computers can be linked together in networks.",
        "The monitor is an expensive piece of equipment.",
        "All day today, she’s been entering data into the computer.",
        "Just click on that program’s icon.",
        "That’s a fast hard disk, and it can store and retrieve data instantly.",
        "If you add more memory, you can make your computer run faster.",
        "We’ll have to load the new software now.",
        "As soon as she came in, she sat down at her computer and started working.",
        "When did you start noticing these problems (with your PC)?",
        "If you want the computer to run faster, you’ll have to upgrade its memory.",
        "I can’t get this computer to work.",
        "Computers are changing our lives in a number of ways.",
        "I saw her going into that room with computer print-outs.",
        "How do I print out a file?",
        "Computers started out as mere playthings, you know.",
        "I don’t think this information is available on the computer.",
        "I think a virus has infected his computer.",
        "We’re planning to add some more memory to our computer.",
        "Are any cables or wires stretched too tightly?",
        "Computer industry has been booming for some time now.",
        "Do you use a computer at work?",
        "I’ve only fiddled around with the program — I haven’t explored its features yet.",
        "There’s no point in giving a hard copy to them — copy the information to a floppy, and give the floppy to them.",
        "That’s a cheap computer assembled by his brother.",
        "Computers are great at playing games too.",
        "Our sales figures are kept on computer.",
        "Try adjusting the brightness and contrast controls on the monitor.",
        "I think your computer needs more memory/a bigger hard drive.",
        "I accidentally deleted that file, but I could restore it from the backup disk.",
        "Don’t you know how to turn off the computer?",
        "When we started using a computer in our office, we could cut down on typing and paper work.",
        "Where does the mouse plug into the computer?",
        "Copy that file 50to a floppy disk, will you?",
        "He had to access three or four files to get the information.",
        "I think the wall socket has gone dead. Why don’t you try plugging the computer into another outlet?",
        "His desk was covered with pages of computer print-out.",
        "What word processing software do you use?",
        "Have you started using that new program?",
        "How do I change fonts?",
        "If your computer’s memory capacity is more, it can do more things.",
        "This mouse is compatible with most computers.",
        "What are the software programs they sell?",
        "If you’re planning to buy a computer, don’t shop for the cheapest price.",
        "Operating systems and computer programs are all (different pieces of) software.",
        "I want to learn the basics and put my computer to work.",
        "You’ve forgotten to turn on the monitor.",
        "People link computers together to share data or programs.",
        "The common cause of this problem is an insufficient amount of memory.",
        "Basically, computers process information, and show the results.",
        "Computers make doing everything easier.",
        "Nothing happens when I press this key.",
        "My PC won’t boot, and I hear beeps.",
        "He’s taken his computer to a repair place.",
        "Do you know how to key in written texts?",
        "Is the monitor plugged in correctly?",
        "How can I avoid getting a virus?",
        "Press the return key now.",
        "I accidentally pressed a wrong key.",
        "My PC is making a strange noise.",
        "Spend a few days, and learn about your computer first."
    ],
    " Group 4 ": [
        "Desktop computers run on electricity.",
        "He’s very good at diagnosing problems with PCs.",
        "You can turn the computer on by flipping the power switch on the system unit.",
        "A computer helps you work more efficiently.",
        "Increased memory can make many programs work faster.",
        "He’s written a computer program to calculate the profit made by the firm quickly.",
        "Computers have no resale value.",
        "My computer has been having start-up problems recently.",
        "Now we should copy all this data onto floppy disks.",
        "Computers affect every one of us — every day.",
        "Give me 51a printout of that document, will you?",
        "Memory chips and hard disks are not terribly expensive, but I think the motherboard is.",
        "You need software to get work done on any computer.",
        "My computer froze up during a spell-check.",
        "They’re going to buy new data processing software.",
        "If you keep the monitor turned up too bright, that’d be bad for the eyes.",
        "I want to get to know a bit more about what a computer can do for me.",
        "They never run illegally-copied programs on their computer.",
        "He spends hours every day at his computer.",
        "I don’t know a thing about how to use a computer.",
        "There are certain necessary things that you should know about computers.",
        "Is the computer on?",
        "I don’t remember the password.",
        "Turn the monitor off, and after 20 or 30 seconds, turn it back on.",
        "Describe the problem in full detail to the repair people.",
        "I can’t come out now — I’m doing a backup.",
        "Do you know how to fix your PC when things go wrong?",
        "Go to a knowledgeable computer user, and get some instruction from him.",
        "Computers can carry out complicated calculations very quickly.",
        "Plug the printer into the computer.",
        "How do I change the paper orientation?",
        "The main cause of this problem is low memory.",
        "How do I get my document out of the print queue?",
        "Colour monitors are more expensive than monochrome.",
        "I’ve run into a really strange problem with my computer.",
        "His company produces computer hardware.",
        "Check all the cables behind the computer — if any of them is loose, plug it back into the socket.",
        "Slide the floppy disk into the floppy drive carefully.",
        "My keyboard has gone dead.",
        "Check if any of the plugs are out of their sockets.",
        "What are the different kinds of software applications you use at work?",
        "MS Word",
        "Wordstar and Wordperfect are word processing applications.",
        "I think your hard drive needs to be upgraded.",
        "The keyboard plugs in at the back of the computer.",
        "Don’t turn the computer on and off rapidly.",
        "If you turn off the computer, and if you want to turn it on again, wait for 20 to 30 seconds.",
        "I know my way around a program or two.",
        "52There was a bug in the computer program — which was why these problems have been happening.",
        "Turn off the computer when you’re done.",
        "The great thing about computers is, they reduce tedious human labour.",
        "Power supplies in PCs are relatively inexpensive.",
        "What are the records you entered into the computer today?",
        "Delete all unnecessary files and programs, so you can free up more space on the hard disk.",
        "Make a copy of the file on a floppy disk, and give it to me.",
        "Don’t you know how to exit the program?",
        "Who’s that working on your PC?",
        "Is he a repair man?",
        "The printer cable plugs into the computer here.",
        "The program should now open in a new window.",
        "I think your computer’s memory needs to be upgraded.",
        "You should access the databases today and update them.",
        "Do you run any special virus-protection software on your PC?",
        "She doesn’t have much experience working with computers.",
        "Computers affect us in more ways than we imagine.",
        "Have you labelled the floppy disk?",
        "Sometimes problems like these go away when you reboot your computer.",
        "You’ll have to learn how to organize the files on your hard disk.",
        "We have the details of all our customers on computer.",
        "My mouse has frozen.",
        "How do you start this program?",
        "Computers — it’s a subject you have to keep up with.",
        "Computers have now become affordable."
    ],
    " Group 5 ": [
        "Don’t forget to disconnect all the cables from the back of the PC before opening it.",
        "The candidates must have basic knowledge of computers and ability to use them.",
        "There’s some basic information you should know before you buy a computer.",
        "At the end of each day, we make a backup of all the data we’ve keyed into the computer.",
        "The screen is blank.",
        "I think you have a disk problem.",
        "I’m thinking of taking a computer programming course.",
        "There are a number of computer repair shops in this area.",
        "He’s bought the computer to do word processing.",
        "My computer locks up unexpectedly — yes, it stops working altogether.",
        "The power cord plugs into the back of the computer.",
        "The on-screen 53pointer doesn’t move when I move the mouse.",
        "He’s installing a new program.",
        "Computers help doctors make their diagnosis.",
        "Before you buy software, make sure that it works/runs on your system.",
        "His old secretary was not computer-literate.",
        "How do I get it to print out?",
        "What are the programs installed on this computer?",
        "If you want to avoid back pains, you’d better buy a chair designed to be used with a computer.",
        "When you push the little plastic button just below the floppy drive slot, the drive will eject the disk.",
        "This problem happened when the computer was spell-checking my work.",
        "We’re planning to add a new terminal to our computer network.",
        "If you’re planning to use graphical applications, better buy a colour monitor.",
        "It says I have a bad disc sector.",
        "Will the computer get damaged if lightning strikes?",
        "How do I get back to the main menu?",
        "Before you install any software on your PC, check it for viruses.",
        "Computers help you organize your finances.",
        "It can take weeks to learn the important features of a new piece of software.",
        "We’ll have to take all precautions to avoid a computer crash.",
        "Are you familiar with the inner workings of your computer?",
        "She has an impressive command of computers.",
        "I can’t get in to my file.",
        "The problem came up because one of the program files was corrupted.",
        "That’s a new database program.",
        "Print that file on paper and give it to me — I need a hard copy.",
        "In general, computers are quite durable.",
        "They have a computer to do accounting.",
        "If you want to store more programs and data, you need a larger hard drive.",
        "Save the work to your hard disk.",
        "The computer was down since the morning — it’s now up again.",
        "Make a copy of the file before you delete it.",
        "Is there a loose cable? Check all the cables behind the system unit.",
        "I can’t access my disc.",
        "I haven’t loaded the file yet.",
        "Did you try out the computer before you bought it?",
        "Jobs like these are handled by computer in our office.",
        "Do you know how to use a word processor?",
        "The monitor appears totally blank — do you think the monitor is broken?",
        "If you buy a computer from them, they’ll give you the service and support you need.",
        "Save your work before you shut down the computer.",
        "Computer literacy — it’s very important in today’s world.",
        "The computer booted up fine, but the picture on the monitor looks funny.",
        "The ‘Backspace’ key doesn’t work right.",
        "Insert a floppy disk in drive A.",
        "Are all the cables in the back of the monitor secure?",
        "The computer froze when I pressed the ESCAPE key — it stopped responding to my commands."
    ]
}