{
    " Group 1 ": [
        "Is the land there good for farming?",
        "Press the seed into the soil, and cover it lightly.",
        "You must remove all the weeds from around the plants/crops.",
        "The future of farming certainly looks bright in our country — many signs point in that direction.",
        "They have a good year-round supply of water for all their farm needs.",
        "The plants were grown indoors, and then transplanted outside.",
        "We’ve lived and farmed here for more than 50 years.",
        "His land is not suitable for cultivation because of shallow soil.",
        "When he retired, he took up gardening.",
        "If you want to do the farm work efficiently, you need modern machinery and equipment.",
        "Have you sprayed the plants with insecticide yet?",
        "During the growing season, most farm crops need about 1 inch of water a week.",
        "Look at those cows grazing around that tree.",
        "His farmland is nearly level, and so, for him, erosion is not a problem.",
        "When is cabbage ready for harvesting?",
        "They’re thinking of taking up fish/sheep farming.",
        "They always treat soil/their plants with manure.",
        "Many trees die because people often do careless planting.",
        "The flower-beds were full of weeds.",
        "The long-term outlook for farming in our country is certainly bright.",
        "Their country is strong both in industry and agriculture.",
        "Nearly all farm plants are of the seed producing types.",
        "There’s a cowshed on the farm to shelter/keep/milk the cows.",
        "I’m thinking of planting bushes/trees/shrubs/vegetables/potatoes/beans in the garden.",
        "He cleared the land by chopping up and turning under the bushes and growths.",
        "If the land/soil isn’t fertile, plants won’t grow well.",
        "How do you prevent rabbit attacks in this area?",
        "Farmers were preparing the earth and working on it to grow potatoes.",
        "How much water do you apply to the crops a week?",
        "They have a few acres of grazing land in that village.",
        "Do they have farm buildings for the livestock?",
        "She planted the seeds and covered them with a little soil.",
        "Are these insects injurious to peas?",
        "We still plant and harvest rice by hand.",
        "The soil on their farm is deep and easy to work.",
        "I think we should fence in the field.",
        "Dairying is well adapted to family-type farming.",
        "You should fertilize your fields with manure.",
        "Cabbage crops usually produce good yields.",
        "She trained the shoots/bushes up the fence.",
        "There’s a lot of money involved in farming.",
        "You should turn and loosen the soil before you start planting the garden.",
        "The income of a farm family is usually less than that of a city family.",
        "The stalks were bare after the harvest.",
        "We had a good crop of rice this year.",
        "They are healthy plants.",
        "Not all of the land on the farm is alike — some parts are very good for cultivation, while some parts are only moderately good.",
        "They have tractors, seed-bed preparation machines, crop-harvesting machines and other farm machines on their farm.",
        "This is the first time we’ve had a harvest failure.",
        "He picked up a hoe and started loosening the soil and removing the weeds.",
        "These are harmful insects, and you can kill them by putting pesticides on your crops.",
        "Their farm produces small fruits as well as tree fruits.",
        "They breed and keep sheep at the farm.",
        "She raked in the backyard, and made a good seed-bed to grow young plants from seed.",
        "She has a beautiful flower-bed in her garden.",
        "Cabbage/cauliflower plants are usually sown in the field by hand — farmers don’t generally use machines for this purpose.",
        "That’s a dry area with low rainfall, and most plants won’t grow there.",
        "Remove the loose stones from the fields — they’d interfere with using the fields.",
        "Where are most of the grapes produced in our country?",
        "Last week, an agriculturist had come to advise the farmers here.",
        "In that area, people use irrigation to supplement rainfall.",
        "Farm income has increased considerably during the last few years.",
        "That’s rough mountain land/marshy land, and is not suitable for cultivation.",
        "These are fruits/leaves/flowers/plants with long stalks.",
        "Their garden is full of wild plants.",
        "We’ll have to think of better ways to improve crop yields."
    ],
    " Group 2 ": [
        "Their farmland is always wet and requires drainage.",
        "If you irrigate that area, you can make it fertile.",
        "Rice is a widely grown crop in Kerala.",
        "You should have a good understanding of your land if you are to use it properly.",
        "There was a long period of drought last year, and it damaged the harvest.",
        "You should only apply water to the plants slowly, so that all the water soaks into the ground.",
        "All the fields in that area are planted with rice/ wheat.",
        "I don’t own a farm, but I have a smallholding — it’s smaller than a normal farm, you know.",
        "How do you cut the cabbage/cauliflower heads from the stalks?",
        "The weather was good for the harvest.",
        "If you want to drain large areas of land, you need main outlet ditches.",
        "Vineyards should be located near good roads.",
        "You can buy fresh farm produce in that market.",
        "There are transplanting machines to set plants in fields.",
        "On their farm, the primary source of income is dairy products.",
        "She’s tidying up the garden.",
        "Farming is becoming more productive and more efficient in our country.",
        "My parents are farmers.",
        "Fruit trees largely take care of themselves — except for pruning.",
        "We’re going to have another year of crop failure.",
        "Our farm produces farm products for sale and home use.",
        "He was pinching out the tips of the young growths, so they’ll develop into bushy plants.",
        "Some seed varieties grow very fast.",
        "What insect is most injurious in this region?",
        "Look at those hens loose in the farmyard.",
        "Some plants don’t transplant well.",
        "You can prune the young tree by trimming the roots and the top at the planting time.",
        "We don’t use any chemical pesticides — we grow crops without using them.",
        "Farmers in that area have started using machines for threshing.",
        "You should use stakes to support these plants.",
        "Wheat, maize and rice are cereal plants that produce grain.",
        "Insects like these mostly attack cultivated plants and fruits.",
        "They have several acres under cultivation.",
        "You should rake the soil smooth.",
        "In general, the farmers in our country have become more efficient during the last few years.",
        "Have you fed the chickens?",
        "Are there any apple/cherry orchards in your area?",
        "Nowadays, good agricultural land is in short supply.",
        "The seeds were planted in beds and there were irrigation furrows between the beds.",
        "Look at those leaves/shoots that have sprouted!",
        "You should cover the roots of the plant with earth.",
        "We’ll have to cut open-ditches to drain the land.",
        "Set the tree in the hole, throw soil in, and tramp the soil thoroughly on the roots.",
        "That’s a very fertile region and can produce a large number of good quality crops.",
        "He’s gone to his village to help his parents in the harvest.",
        "If the weather is dry when you plant the tree, pour some water into the hole.",
        "After ploughing the land, you should break up all large lumps of soil.",
        "Be careful how you cultivate the plants — you shouldn’t injure their roots.",
        "Better give shallow cultivation.",
        "They own a coffee/rubber/tea plantation.",
        "How much grain/ milk does your farm produce?",
        "Beans need a well-prepared seed-bed.",
        "They planted the trees at 25 feet intervals.",
        "They have a farm reservoir, and they use water from it for irrigation.",
        "Rice is grown on wet land.",
        "The soil here is full of grass and weeds.",
        "We visited their village during the wheat harvest.",
        "Do they produce or buy the feed grain needed for the livestock?",
        "The trees gave a high yield last year.",
        "When planting is done on ridges, you should be careful not to expose roots, and you shouldn’t cover plants when they’re small.",
        "How much will it cost to produce an acre of tomatoes?",
        "He employs more than 50 farm workers.",
        "Total farm production in our country during the last year was the largest on record.",
        "The government will have to do something to improve the level of living of farm people.",
        "Many plants make poor growth, because farmers don’t handle them properly at planting time.",
        "Both of them work on a farm.",
        "Those oranges look old and shrivelled.",
        "This dry weather is going to have a bad effect on our crops.",
        "They have a number of fruit trees in their backyard.",
        "Get the tree in the position you want — then add soil in the hole and pack again.",
        "We cut long narrow trenches in the earth and planted the seed in them.",
        "They use a high-yielding variety of wheat for seed.",
        "Fences keep cattle and sheep where they are wanted, and also out of places where they’re not wanted."
    ],
    " Group 3 ": [
        "They grow crops and keep pigs at the farm.",
        "There are trees of various ages in that farm.",
        "Organic manure like these make plants grow healthy and strong.",
        "This is a chemical fertilizer — you should spread it on the land/ground and work it in before planting.",
        "All this land will have to be brought under cultivation.",
        "If you sow the seed now ,the plants will be ready to be set in the field by September.",
        "All the farms in that region are highly productive.",
        "They rotate crops by growing different crops in succession in that field.",
        "Where can we get good celery seed from?",
        "They live in a farming area.",
        "A large part of the land on their farm is in crops.",
        "The vines provide shade as well as fruit.",
        "Crop production per acre of cropland has certainly increased.",
        "The paddy fields in that area are irrigated by canals ,pipes and ditches.",
        "The grain crop will have to be harvested in about a month’s time.",
        "Beans/Rice cropped badly last year.",
        "The seedlings were raised in the greenhouse and transplanted later.",
        "That hill is too steep to plough.",
        "Before you use wet land for field crops ,you should drain it and remove surface water.",
        "You should give frequent cultivation to cabbage ,so you can prevent weeds and grass from growing.",
        "Their farm has a lot of fields.",
        "Most family-type farms in our area have livestock.",
        "You can use hand cultivators ,but cultivation should be given frequently — and for these crops cultivation should be shallow.",
        "She grows flowers ,vegetables and other plants in her garden.",
        "His land is covered with small bushes and trees.",
        "When you plant young trees ,you should cut off all diseased and broken roots and roots that are too long.",
        "Their farms produce cereal crops.",
        "How is wheat/rice threshed in your area?",
        "There are paddy fields near our house.",
        "He’s raking in the garden.",
        "Nowadays fewer men on the farm work fewer hours — but they produce more farm products than ever before.",
        "Some flowers don’t transplant easily.",
        "His son is at university studying agriculture.",
        "All these lumps of earth will have to be broken up.",
        "Wells should be located on the high side of the fields to provide for water flow.",
        "These trees no longer yield fruit.",
        "How do you control grasshoppers and other insects in your fields?",
        "Buds have started appearing on the trees.",
        "The roots are still unharmed — they’ve produced a lot of sprouts.",
        "He owns about 100 acres of farmland there.",
        "Potatoes grow under the ground.",
        "The field had been ploughed ,and we could see a series of ridges in it.",
        "Set the tree in a hole ,and fill the hole to the top and pack.",
        "How many acres of crop land does their farm have?",
        "The irrigation in that area is very poor.",
        "What crops are grown in your area for home use?",
        "Their farmhouse is at the bottom of the valley.",
        "Vegetables and small fruits are high-return crops.",
        "How much fertilizer should I use for peas?",
        "He cut a narrow trench/channel into the ground, so water could flow along.",
        "We transplanted the seedlings into the soil today.",
        "Push/Hammer these stakes into the ground, and tie all the young plants to them.",
        "Coffee and tea are the main crops grown there.",
        "We keep the fields flooded with water and use them for growing rice.",
        "How deep should the soil be ploughed to prepare it for melons?",
        "Put cow dung around the roots of these bushes.",
        "While these plants are young, you shouldn’t cover the buds with soil during cultivation.",
        "How do the growers in your area market the spinach crop?",
        "He grows mushrooms in the garden.",
        "Land that’s idle is losing fertility.",
        "What are the climate requirements of carrots?",
        "Fewer farmers and more customers are to the advantage of farmers.",
        "Let’s train the vines over/against the wall.",
        "Don’t set the plants too shallow or too deep.",
        "Crops grow well if you dig manure or chemical substances into soil.",
        "They’re expecting a record harvest this year.",
        "Ploughing is over, but there are lots of large lumps of earth/clay on the surface.",
        "The larger the farm in crop areas, the larger the net farm income.",
        "How many onion plants are required per acre?",
        "He’s ploughing the field/ploughing in the field.",
        "She grows grapes in her vegetable garden.",
        "After planting the tree, she left a depression near it to receive extra rainwater.",
        "Plant them in rows three feet apart.",
        "If the land is deep, level, well-drained and fertile, most farm crops would do well on it.",
        "How far apart should these plants be set?",
        "He cut furrows into the earth using their ploughs and planted seed in them.",
        "If you want to put your farmland to proper use, you should clear it of bushes, stumps, stones and other obstructions.",
        "They don’t have enough farm buildings for storing the harvested crops and the farm machinery.",
        "They grow potatoes in large quantities.",
        "There are several orange/lemon groves in that area.",
        "What’s the yield per acre?",
        "The land is full of grass and roots.",
        "New buds have started sprouting on the trees.",
        "More than 80% of the entire farm output is consumed as food.",
        "You should care for the field if good crops are to be produced.",
        "The trees have started putting out their leaves.",
        "Tomatoes don’t grow well in this soil.",
        "Before you set these plants in the field, the soil must be turned to a depth of 6 to 8 inches.",
        "How are ripe melons harvested?",
        "Farmers in our area are busy weeding and planting.",
        "If you want to make full use of the land, you should keep it in growing crops throughout much of the year.",
        "You can produce better crops if you add manure/ fertilizers to soil.",
        "After ploughing the land, the soil should be harrowed several times — this will help in controlling weeds.",
        "They’ve built a barn to store grain and hay on their farm.",
        "Sheep get most of their feed from forage, and only a small percentage from grain.",
        "Most of them are wheat/rice/potato farmers.",
        "Our farmland is suitable for growing maize.",
        "How far apart should I space the rows?",
        "Another crop failure could result in a shortage of food.",
        "Generally, dairying is concentrated near the larger cities and industrial centres.",
        "He farms 100 acres.",
        "General farming usually includes one or more cash crops.",
        "The children have trampled the seedbed and ruined everything.",
        "These insects are a nuisance — they eat crops.",
        "Crops must be chosen that can do well on your land.",
        "Farmers in that area grow beans and cowpeas on orange/lemon groves and turn them under as green manure.",
        "Farmers will have to think of new methods to increase their yield.",
        "You can buy eggs from them — they keep chickens.",
        "When you plant a young tree, you should set it in a hole one or two inches deeper than it grew in the nursery.",
        "I’ve finished weeding. Now I’ll have to start digging.",
        "Dairying requires a fairly large amount of labour.",
        "Every square metre of the soil was used for vegetables.",
        "The ground was hard and difficult to dig.",
        "You should use the hoe now and then, and prevent the growth of grass and weeds.",
        "Trees started shedding leaves in early autumn.",
        "A good farm must have a good water supply.",
        "What’s the length of time required to grow a crop of cauliflower?",
        "You should water the young plants regularly.",
        "Add some compost to the soil round the roots — the plants would grow well.",
        "He started on a smallholding — now he owns a large farm.",
        "These plants were grown in a nursery and transplanted here.",
        "Don’t let the land lie waste — start farming it.",
        "Rotation of crops is not very important with short season crops like lettuce.",
        "Build a frame around the seedbed, and cover it with a good quality sheeting, so you can protect the bed from the sun and hot winds.",
        "Much of our village is good agricultural land.",
        "Break the land deep, but don’t turn up the tighter soil.",
        "Climate is perhaps the most important factor in deciding what vegetables to produce.",
        "Has the farm population in our country increased during the past few years?",
        "He gathered the leaves together with a rake.",
        "You should turn the soil under with a plough before the plants are to be set.",
        "To pick grapes, you need much skill.",
        "He owns a fish/sheep/mink/livestock/crop/dairy/poultry farm.",
        "Tomatoes have cropped well this year.",
        "You should put decaying plants and animal dung in the earth near the young trees.",
        "Their farm is off the main highway.",
        "He pruned the 1-year old trees by cutting the top back to about 30 inches above the ground.",
        "The tomato is the main home garden vegetable in our area.",
        "Their region has the most fertile soil in the country.",
        "How do you plant onion/bean/asparagus/tomato seed?",
        "We must start digging up the garden tomorrow.",
        "It’s been a good harvest this year.",
        "Mangoes grow in hot countries.",
        "Labour is one of the major items of expense in farm production.",
        "This sort of land is no good for growing carrots."
    ],
    " Group 4 ": [
        "They keep/raise sheep on their farm.",
        "Before you put the plants in, you should use a rake and loosen the earth and make it level.",
        "He gets a good view of a large part of the farm from his farmhouse.",
        "What crops do best in your area?",
        "You’ll have to turn over the earth once more before planting them.",
        "They plant these seeds on ridges in ploughed fields and they work down the ridges when the plants grow several inches high.",
        "They’ve sown/planted the fields with wheat.",
        "Sandy soils are better suited to deep-rooted crops like sweet potatoes.",
        "How should I handle the plants after pulling them from the bed?",
        "He picked up a spade and started digging in the garden.",
        "They cultivate a small/large garden.",
        "We only planted the seed last week, and little green shoots have already started to appear.",
        "He ploughed the land and left it unplanted to restore its fertility.",
        "Cabbage crops are harvested by hand as soon as they reach sufficient size.",
        "How can you tell when tomatoes are ready to harvest?",
        "He resigned and took up farming.",
        "The crops are cut and gathered after they have ripened.",
        "Set the tree in a hole, and throw a few shovels of the topsoil around and over the roots, and pack this well.",
        "Their farmland doesn’t have enough waterholding capacity.",
        "Buds have started opening.",
        "You should grow a cover crop like peas and turn it under as green manure.",
        "We must weed the garden today.",
        "Most farmland is not being wisely used.",
        "Carrots grow under the ground and have green shoots above the ground.",
        "What crops do you grow here for turning under as green manure?",
        "This land is poor and stony and isn’t suitable for farming.",
        "Wild plants like these grow among cultivated plants.",
        "When you plant these trees you should dig deep wide holes — or the roots won’t spread out in a natural position.",
        "He doesn’t own the farm — he only runs it.",
        "Before planting time, the soil is ploughed with a tractor and cut over with a harrow.",
        "How are rows laid off for planting lemons?",
        "She planted flowers along the drive.",
        "Farm people need as good housing as town people.",
        "It’ll be a good idea to plant lowgrowing crops like cabbage, beans, onions, etc. between the rows of trees.",
        "They had a bumper wheat crop last year.",
        "The soil here is too dry and rocky — you can’t cultivate this land.",
        "Use a hoe and remove all these weeds.",
        "We had a good/high yield of rice last year.",
        "The basic feed for the livestock on the farm is pasture.",
        "Put decaying plants and twigs round the roots — they’ll keep water in the earth near the plants and protect the plants from weeds.",
        "They planted the seeds in the soil/ground.",
        "If the field is dry, you should irrigate the field soon after setting the plants.",
        "What type of soil is lettuce grown on?",
        "Basically, farming is a business — and it may or may not be profitable.",
        "How do you prepare land for corn?",
        "How are you going to shade the seedbed from the sun?",
        "We’re going to put manure on the fields tomorrow.",
        "They’ve planted/sown 50 acres with rice.",
        "He dug a ditch to drain water from the field.",
        "He raked the soil and made it smooth and level.",
        "How do you take/pull plants from the seedbed?",
        "The soil hasn’t been turned up properly.",
        "If you plant in long, straight rows, much of the cultivation can be done with the tractor.",
        "How deep should the soil be prepared to grow cabbage?",
        "She planted her garden with cabbages, onions and other vegetables.",
        "Many banks refuse to finance farming.",
        "If you put rotting leaves, twigs and other plant material round the roots, you can protect the plants from weeds and help them grow.",
        "Wheat and rice are two of the main crops in our country.",
        "They mostly cultivate wheat and potatoes.",
        "The apple/pear trees were inter-cropped with cabbage/beans/onions.",
        "Have you watered the flowerbed today?",
        "They keep their crop land in productive use most of the time.",
        "What are the fertilizer requirements of these crops?",
        "He farms somewhere in Kerala.",
        "Success of farming depends on several factors.",
        "Lettuces have large green leaves and these leaves are used in salads.",
        "They sprayed the fruit trees with pesticide.",
        "His farmland is gently sloping, and he has to spend a lot of money to prevent erosion.",
        "The yield was poor this year.",
        "It’s only three days since we planted the seeds, and they’ve already started to sprout.",
        "Let’s hope the rains won’t fail this year.",
        "He’s an apple-grower/ fruit-grower/flower-grower/rose-grower.",
        "The ponds dried up during the drought.",
        "Vegetables and small fruits are intensive cash crops like cotton and tobacco.",
        "How long does it take to produce a crop of eggplants?",
        "The ground is very hard — you’ll have to break it up before planting the seeds.",
        "When you pull these plants from the bed for setting them in the field, take care not to injure them.",
        "Plants need water as well as light.",
        "Farming is actually a high-risk business.",
        "What type of soil can cabbage be grown on?",
        "Wheat, rice, maize, barley, rye and oats are various types of cereal.",
        "They cultivate about 50 acres.",
        "I don’t think he’s been watering the plants — they’ve shrivelled and died.",
        "Is there enough hay in the barn for the cows?",
        "In good farming, land is wisely used.",
        "She bought the plants from a local nursery.",
        "Cover crops like peas prevent erosion and provide green manure each year.",
        "These plants grow best in the shade.",
        "Let’s train the roses along the wall.",
        "There’s a mass of bushes, shrubs and plants growing under those trees.",
        "Their farm produces a good vegetable/fruit crop every year.",
        "Rake the soil before you plant the seeds.",
        "Certain crops should be planted shallow and certain crops should be planted deep.",
        "Farmers dig fertilizers into soil to make it more fertile.",
        "Everybody here will be busy till after the harvest.",
        "If it continues to rain like this, we shall have floods.",
        "Spinach and other greens are harvested immediately before marketing.",
        "This land is very fertile.",
        "Farming requires a great deal of capital.",
        "She drove stakes about a foot deep in the soil and tied the tomato-stems to them.",
        "A flock of sheep was grazing in the field.",
        "They use about 50 cents of good land for their vegetable garden.",
        "What are the varieties of root crops grown here?",
        "Last year, their farm produced a fine crop of fruit.",
        "Crops grow very well here, because the soil is really rich.",
        "Farmland shouldn’t be left idle.",
        "With a hoe, he broke up the surface of the soil.",
        "You should dig the flower-bed once again before planting.",
        "The leaves have become dry and wrinkled.",
        "Grow spinach in rows and keep the rows free from weeds.",
        "They’re out in the fields reaping.",
        "His land is really level and not subject to erosion but is not suitable for cultivated crops for several reasons.",
        "He owns a farm there. She frequently breaks up the earth between the rows of plant and removes weeds using hand cultivation.",
        "We keep chickens on our farm, and we sell their eggs and meat.",
        "Do they grow grapevines on that farm?",
        "The garden is full of weeds — we must pull them out.",
        "Garden vegetables are the most frequently produced food for home use.",
        "They turned over the soil with a plough and planted the seeds.",
        "He cleared away the undergrowth neatly and started preparing a seedbed.",
        "The apple season is about to begin.",
        "A poor water supply is a handicap for a good farm.",
        "What’ll be the average cost of growing an acre of peas?",
        "When you turn under soil-improving crops, that’ll improve conditions of the soil for the growth of succeeding crops.",
        "Wheat and rice are cereals.",
        "They have a fence around the entire farm.",
        "That region is too dry — nothing grows there.",
        "It’s three weeks since we’ve planted the seeds and shoots have not started to appear.",
        "Don’t use farmland for crops it’s not suited for.",
        "Peas grow in pods and are eaten as vegetables.",
        "What soils are best for spinach?",
        "We’ll have to prepare the land and grow crops on it.",
        "Don’t permit the fields to be idle.",
        "This dry weather is going to shrivel the crops.",
        "We had to employ extra labour to cut the crops down and bring them in.",
        "You need hay to feed your cattle when they can’t graze enough forage from the pastures.",
        "You need modern machinery and equipment for good farming.",
        "When you plant these trees, use a small quantity of wood ashes/a little well-rotted manure.",
        "Most of the land here is very fertile.",
        "Our area has enough annual rainfall, and we have good crop yields.",
        "You must learn how to do the weeding.",
        "How many cows do they have on the farm?",
        "The leaves have shrivelled up in the sun.",
        "How much seed is needed to plant an acre with peas?",
        "The fields are divided from each other by hedges.",
        "This is the mango season, and mangoes are available everywhere.",
        "His land is not agricultural land, and is steep, rough and stony.",
        "If you grow an acre of cabbage, what is the average yield to expect?",
        "How many acres have rice farmers planted this year?"
    ]
}