{
    " Group 1 ": [
        "We had a wonderful weekend, and I’m happy.",
        "He looked sad and disappointed about something.",
        "They all dislike him, but they don’t dare to say so.",
        "I apologized to her and asked her to forgive me, and she became emotional and started crying.",
        "He had a feeling of fear that something unpleasant was going to happen.",
        "He was very worried and I tried to calm/comfort him.",
        "What he said gave me new ideas and a strong feeling of enthusiasm.",
        "His colleagues admire and respect him.",
        "He regretted what he’d done, and he wanted to do something to show he was sorry.",
        "The comments he made surprised everybody.",
        "He was disappointed with the film — it wasn’t as good as he had expected.",
        "I think his interest in her is just a passing fancy.",
        "His business has been losing money, and he felt depressed.",
        "I’m feeling very depressed.",
        "She’s very sensitive about her appearance, and she doesn’t like anyone talking about it.",
        "I’m happy about the arrangement/ idea.",
        "He was uncertain and worried about what was going to happen.",
        "He had a feeling of anxiety that something dangerous might happen.",
        "She was very excited, and found it difficult to keep calm.",
        "He was disappointed about the way they treated him.",
        "He felt depressed, even near to tears.",
        "He didn’t like what was going on, and he started expressing his impatience.",
        "She loves and cares about her children very much.",
        "I don’t know what made him afraid/anxious.",
        "He felt sorry and guilty about what he had done.",
        "She was flattered by the way he loved her.",
        "He’s very easily shocked by anything rude.",
        "He sounded quite happy and cheerful over the phone.",
        "She was very sad, and nobody could comfort her.",
        "He was very angry/excited/upset, and she tried to make him calm.",
        "He doesn’t have as much confidence/hope about the project now as he had before.",
        "She felt sad and unhappy that these things had happened.",
        "I was shocked by its size.",
        "He’s quick to express his emotions.",
        "He was worried, and he wasn’t quite certain whether he was doing the right thing.",
        "He felt great affection for those children.",
        "They’re all slightly afraid of their headmaster.",
        "He knew he shouldn’t have shouted at her, and he felt embarrassed and guilty.",
        "He felt a sharp pain in his back.",
        "He wasn’t gentle but rough with them, and he regretted it.",
        "He seemed extremely pleased about what he had done.",
        "The film reminded her of something that had happened in the past and made him feel very sad.",
        "The trip to Delhi hadn’t been worth the effort, and he felt disappointed.",
        "She has great enthusiasm for teaching.",
        "She was very angry, but she didn’t express it.",
        "The deal fell through, and he felt miserable and depressed.",
        "I have to make a speech tomorrow, and I’m dreading it.",
        "It’s surprising — he could complete the work in an hour!",
        "They didn’t tell her about the accident, because they didn’t want to cause her alarm.",
        "They hate each other.",
        "His boss praised his work in front of everyone, and that gave him a feeling of satisfaction.",
        "She suddenly felt afraid and acted quickly and without thinking carefully.",
        "She looked terrified.",
        "He’s happy with the way the campaign has gone.",
        "The story she told us was very moving/touching.",
        "I didn’t do anything to provoke him, but he started shouting at me.",
        "He was staring at her, and it made her feel terribly uneasy.",
        "The offer hasn’t satisfied the workers.",
        "He told us how he had killed a cat without feeling guilty or ashamed.",
        "She felt more sympathy for him than she ever had before.",
        "She came running to us in a panic.",
        "I was surprised by his stupidity.",
        "He felt no bitterness over the way they had treated him.",
        "I don’t know why, but I think he’s angry with me.",
        "I hated myself for shouting at her.",
        "He isn’t easily affected by criticisms.",
        "She has a deep affection for her uncle.",
        "They were delighted to see us.",
        "She told him how she had suffered, and he was filled with pity for her.",
        "He knew he had done a silly thing, and he felt foolish and slightly embarrassed.",
        "She always shows contempt for politicians.",
        "He was very nervous and anxious, and couldn’t relax.",
        "I did what I could to calm his fears.",
        "He took it calmly, but I know he was angry.",
        "The fire alarm caused a lot of panic among the crowd.",
        "Her face looked suddenly sad.",
        "Their kindness really moved him.",
        "They’ve reached there safely — I’m relieved.",
        "Don’t get carried away by the excitement and do anything foolish.",
        "The news/decision made him very angry.",
        "It’s an emotional film, and it’s sure to bring tears to your eye.",
        "She spoke in a bitter tone.",
        "You can’t rely on him — he keeps changing his mind.",
        "For the first time since they got married, he shouted at her, and it affected her deeply.",
        "Her husband had won the election, and she was excited.",
        "This thought has been worrying him for some time.",
        "I’m sorry I did it, and I’m ready to make amends.",
        "I love her, and I want to get married to her.",
        "They greeted her with affection.",
        "He knew he had behaved badly, and he felt ashamed of himself.",
        "I’m dreading the exams/interview.",
        "He felt regret about all the trouble he had caused.",
        "I only have warm and friendly feelings towards them.",
        "She panicked when she found that she had lost her purse.",
        "The noise made him angry and impatient.",
        "He lost control over his feelings and started behaving in a wild way.",
        "He felt that what he was doing was not quite right, and he was worried that it may have bad consequences.",
        "I’m glad I didn’t oppose the plan.",
        "She was crying and shaking with fear.",
        "Nobody likes the new boss — he always shows contempt for us.",
        "Her feelings towards him often change from love to hate.",
        "He likes to go fishing — he finds it very exciting.",
        "She was so nervous and anxious that she burst into tears.",
        "I dread to think what’ll happen if the boss comes to know about all this.",
        "He’s sorry about what he’s done/said.",
        "He was bitter about the way they had treated him.",
        "We’re grateful for their support.",
        "He’s quite content with his life.",
        "Loud noise always makes him angry.",
        "He spoke with great feeling.",
        "He’s very sympathetic and thoughtful towards others.",
        "She was badly shaken by the rumours.",
        "His idea had been confirmed, and he felt happy and satisfied.",
        "She felt pity for him when she came to know of his troubles.",
        "He’s very upset, and he can’t think calmly/clearly.",
        "He felt strongly about the injustices of the system, and decided to speak out against them.",
        "He loves his children very much.",
        "He has strong opinions, and he often expresses them with passion.",
        "Everybody was in a state of great panic/excitement.",
        "He’s sad and depressed and has no hope."
    ],
    " Group 2 ": [
        "She surprised everybody by her knowledge of history.",
        "She was overcome by a feeling of despair.",
        "When she repeated the question, he looked annoyed.",
        "It was a sad film, and it made her cry.",
        "We’re poor, and we aren’t ashamed of it.",
        "He never expresses any gentle or caring feelings.",
        "He was glad about what happened.",
        "He was very nervous, and her voice was shaking.",
        "He’s a hard-worker, and his boss has taken a liking to him.",
        "Most of them reacted to the decision with surprise.",
        "She was overcome by fear and started screaming.",
        "The election results have made him feel disappointed/sad and pessimistic.",
        "He was afraid they’d do something violent to him.",
        "What’s the use of envying them? Let’s try and be as successful as them.",
        "I was irritated by his behaviour.",
        "I’m looking forward to the chance of another outing like this.",
        "He felt sorry when he heard of what happened there.",
        "She was very pleased about the news.",
        "He made me appear stupid, and I felt very embarrassed.",
        "She didn’t want to show her real feelings.",
        "I don’t like that man.",
        "Indian politics really surprises everyone.",
        "They had to undergo a lot of frightening/shocking/disgusting experiences during the war.",
        "They were very sad over his death.",
        "She was overcome with panic and felt helpless.",
        "You gave me a real scare when you shouted like that.",
        "When he read the letter, he looked relieved.",
        "Many tourists said they were surprised by our country — they found most of the things here quite unusual.",
        "He’s very tactful and does things without offending people.",
        "She was jealous of her sister’s good looks.",
        "When she heard the news, she shouted with joy.",
        "He took pity on her and decided to help her.",
        "Their old boss always used to show consideration for them.",
        "She was overcome by emotion, and she couldn’t say anything.",
        "He loves his parents very much and would do anything to please them.",
        "He said all those things, so she won’t be upset/angry/worried.",
        "That was a very upsetting/shocking experience.",
        "He couldn’t conceal his envy of his friend.",
        "I found her sad and gloomy — all other children were lively and cheerful.",
        "She burst into tears in front of everyone.",
        "If you keep on criticizing her work like this, it’ll make her feel discouraged.",
        "As soon as she saw him, she began to cheer up.",
        "He had no hope that things would improve.",
        "She was ashamed that she made a mistake in public.",
        "She didn’t like the way they treated her, and she felt bitter.",
        "He was eager to show me everything.",
        "He does things in a quiet and controlled way, without drawing attention to himself.",
        "He became emotional, and his voice became unsteady.",
        "I’ve always had the greatest admiration for him/his talents.",
        "Things were happening so quickly that it was difficult to know exactly what was going on.",
        "He has a horror of flying.",
        "He was thoughtful and sad, and stood there looking out of the window.",
        "She couldn’t control her anger, and she started screaming.",
        "You gave me a fright jumping out like that.",
        "We’ll have to do something to soothe the workers’ fears.",
        "I hadn’t expected a reply like that, and it made me uneasy/embarrassed.",
        "She had an uncomfortable feeling that she’d done something wrong.",
        "I have no pity on them, and I’m not going to give them any money.",
        "He was very pleased to see them.",
        "She tried to hide her shame and embarrassment.",
        "He doesn’t express his opinions without thinking carefully about them.",
        "When she came to know what he had done, she felt great admiration and respect for him.",
        "The news encouraged them and made them cheerful.",
        "He saw the snake, and he suddenly moved back in horror/alarm.",
        "He didn’t have the courage to say ‘no’.",
        "She was very angry, and she stormed out of the room.",
        "She kept on making the same mistakes, and it really frustrated her boss.",
        "Soon his behaviour began to irritate me.",
        "She’s very unfortunate and has a difficult life.",
        "You’ve always had a fear of failure — you’ll have to fight it and overcome it.",
        "She was delighted at the exam results.",
        "He said he was going to resign, and everybody was very surprised.",
        "It was an unfair decision, and I was shocked and angry.",
        "He’s very attached to his children.",
        "The announcement made everybody encouraged and optimistic.",
        "When he heard what she said, he flew into a rage.",
        "They envied him his money/ success.",
        "He never had the guts to do anything like this.",
        "She couldn’t believe that all this was true/real.",
        "She has an absolute horror of cockroaches.",
        "He was very angry/upset, and she tried to make him feel calmer.",
        "He had the feeling that everything was wrong and nothing will improve.",
        "He knew he hadn’t done anything wrong, and he didn’t feel any guilt or shame.",
        "He was very pleased at the idea.",
        "He felt confused and was unsure how to react.",
        "Her parents were very kind to me, and it really touched me.",
        "This is the first time she has ever been in love.",
        "When she said all those things, he had a feeling of comfort.",
        "By nature, he’s calm and quiet.",
        "The news of his death came as a shocking blow.",
        "Her boss keeps shouting at her, but she isn’t bold enough to stand up to him.",
        "She was annoyed and offended, and she went out charging through the door.",
        "She made no attempt to hide her real feelings.",
        "He had a lot of difficulties, and he felt that he won’t be able to overcome them.",
        "She told us how she had suffered, and it moved/touched us deeply.",
        "She was jealous of her sister and hated her.",
        "He takes pleasure in reading.",
        "The whole thing surprised me.",
        "She felt numb with fear.",
        "He was wealthier than them, and they felt a lot of envy towards him.",
        "I’ve always had the greatest respect for him.",
        "There were so many choices available that I was very confused.",
        "He couldn’t decide what to do, and he stood looking out of the window.",
        "He didn’t seem at all frightened.",
        "He didn’t say anything, but inside, he was boiling with anger.",
        "There was no emotion in her voice.",
        "She’s very worried, and I don’t know what to do to set her mind at rest.",
        "He was very unfortunate, and I felt sorry for him.",
        "For the first time, he felt a deep sense of shame.",
        "She seemed satisfied with the suggestion I made.",
        "Everybody was shocked by his behaviour, and couldn’t say or do anything.",
        "He was very upset and he said all this in a choked voice.",
        "He’s very fond of his family and friends.",
        "She was very upset, and I didn’t know what to do to comfort her.",
        "He’s quick to react to people and to show emotions.",
        "She was afraid to complain.",
        "He couldn’t cope with the problem, and he felt frustrated and angry.",
        "There was a general feeling of shock at the news.",
        "When she heard the news, she stopped feeling depressed and became cheerful.",
        "He couldn’t win any of the games, and he felt hopeless/desperate.",
        "Everybody was glad a step forward had been taken.",
        "He likes to go fishing, and it gives him great pleasure.",
        "He looked upset — the news seemed to have shaken his confidence.",
        "He’s more successful than them, and they’re jealous of him.",
        "He’s in love with that girl.",
        "We were confused by the variety of goods on offer.",
        "When the fire alarm went off, she started shivering with fear.",
        "When he loses his temper, he becomes violent.",
        "You really gave me a shock, creeping up on me like that.",
        "I didn’t know what to say to help him stop worrying.",
        "The announcement was so sudden and unexpected that it surprised everybody.",
        "For the first time, he had a feeling of guilt about the way he had treated her.",
        "He was sad and upset about the whole situation.",
        "Her moods change often and suddenly.",
        "She was very frightened, and her voice was choked with emotion.",
        "He hates violence.",
        "I know he said all those things only to comfort me.",
        "He’s never sympathetic to other people’s feelings.",
        "She’s still scared of the dark.",
        "He lost concentration and started making mistakes.",
        "The election results shocked everybody.",
        "He looked very confused, and acted as though he couldn’t decide what to do.",
        "The news cheered everybody."
    ]
}