{
    "key": [
        "They’re having lunch.",
        "She sat there licking the ice cream.",
        "She prepared a dish of spinach and tomatoes.",
        "The pudding [won’t keep] — you’d better [finish it off].",
        "He ate the cutlet in one bite.",
        "That was a heavy meal — I shouldn’t have eaten so much.",
        "Can you fry an egg for me?",
        "Can you make a salad?",
        "I had a big breakfast.",
        "Is the food ready yet?",
        "She sliced the cucumber.",
        "She likes her eggs hard-boiled.",
        "She cooked us a nice hot dinner.",
        "Some kinds of food soon spoil.",
        "The kettle’s boiling.",
        "She was munching her breakfast noisily.",
        "Curries take a long time to prepare.",
        "He didn’t have time to go to the canteen, and he missed his meal.",
        "Add some more salt and pepper. That’ll improve the taste.",
        "When the phone rang the first time, I was [at lunch], and I didn’t feel like picking it up.",
        "There’s too much salt in this stew.",
        "He gave a dinner for his friends last week.",
        "Peel me an orange, will you?",
        "These lemons make good pickles.",
        "He took a bite out of his sandwich.",
        "The meat was beautifully cooked.",
        "For dessert there are oranges.",
        "Sweep the biscuit crumbs off the table.",
        "I don’t think he was hungry. He just sat there pecking at his food.",
        "Don’t forget to check the seasoning in the curry before you serve it.",
        "He picked up a piece of meat and chewed at it.",
        "He ate up all the food and left none for me.",
        "He took a few gulps of coffee and hurried out.",
        "He doesn’t eat meat.",
        "How can I eat dry bread? Don’t we have any butter or jam left?",
        "Let’s pickle the lemons.",
        "I want my tea black.",
        "I wonder how he manages to tuck away so much food.",
        "He drinks his tea without sugar.",
        "The tea was very hot and I sipped it slowly.",
        "This fish has a lot of bones in it.",
        "I ate a big meal today.",
        "She put all the ingredients in a bowl and mixed them.",
        "Boil an egg for me, will you?",
        "I’m hungry — my stomach is rumbling.",
        "This milk tastes sour.",
        "The dessert was apple.",
        "They had no food of any kind in the house.",
        "Have you chopped the onions yet?",
        "This is hungry work.",
        "Digging up the garden is thirsty work.",
        "Potatoes have been cooked. Can you mash them for me?",
        "The water’s boiling.",
        "He looks well, and he has a healthy appetite.",
        "She hasn’t much of an appetite.",
        "He’s a glutton — he won’t leave any of the food for the rest of us.",
        "There’s a sour taste in my mouth.",
        "The soup needs more flavouring.",
        "And then, they sat down to eat.",
        "That’s a buffet lunch; you’ll have to serve yourself.",
        "No, no. No more. I’m full up.",
        "The milk is (or has gone) off. Don’t use it.",
        "This bread is a bit stale.",
        "He added a little chilli powder to the dish to give a hot taste to it.",
        "He’s ill and he’s off his food.",
        "There was no sugar, and we had to manage without.",
        "Hurry — eat up. We’re late.",
        "The pudding was really filling — I felt really full.",
        "I’m not fond of salad.",
        "Slice the apple and chop it.",
        "A mouthful of food went down the wrong way and he started coughing.",
        "She only ate the tender pieces of meat.",
        "The meat was very tough and difficult to chew.",
        "We ate in the hotel restaurant.",
        "The food was cold and tasteless.",
        "I’ll eat at my hotel.",
        "The dinner has already been cooked. It just needs heating up.",
        "They fed him up after his illness.",
        "When you go to the market, get some crisp tomatoes and apples, will you?",
        "She only had a light breakfast.",
        "I think we must teach the children how to behave at table.",
        "Please boil my egg hard.",
        "She can make all kinds of snacks — samosas, cutlets, idlis, dosas...",
        "The stew tastes of garlic.",
        "She gave him a second helping of pudding.",
        "Don’t eat so quickly.",
        "What’s for pudding?",
        "He sat there and finished off the cake.",
        "He swallowed a piece of meat without chewing it.",
        "The milk’s coming to the boil.",
        "The cream has [gone off] — it has a sharp taste.",
        "I had toast and tea for breakfast.",
        "The fillings in the cake and the sandwich tasted nice.",
        "Go on, have a little taste.",
        "This curry smells of garlic.",
        "The cutlets smelt delicious.",
        "We had fish for lunch.",
        "The cutlets had a mouth-watering smell.",
        "I never eat a big lunch.",
        "The stew tastes strongly of ginger.",
        "This bread is mouldy. Don’t eat it.",
        "Ask her to shell the peas.",
        "He’s ill and he has no appetite.",
        "Do you take sugar?",
        "The vegetable curry had a very hot, spicy taste.",
        "She only had a piece of the cake.",
        "The soup was strongly flavoured with pepper.",
        "She suffers badly from indigestion.",
        "Chop a few cloves of garlic.",
        "This meat is very tough.",
        "Don’t eat that soggy sandwich.",
        "This chicken curry is too hot for my taste. It’s full of pepper.",
        "Break two eggs, beat them and make an omelette.",
        "Season the soup with plenty of salt and pepper.",
        "He swallowed a mouthful of curd.",
        "Don’t have the ice cream now, it’ll spoil your appetite for dinner.",
        "That was a heavy cake — it must have caused the indigestion.",
        "That restaurant specializes in Chinese dishes.",
        "She served him a generous portion of roast chicken.",
        "Let’s bake a cake, shall we?",
        "Is there a pudding today?",
        "Have a taste of this cake.",
        "Is there enough for four servings? There are four guests.",
        "Drink your tea while it’s still hot.",
        "Here’s a crisp cucumber. Let’s make a salad.",
        "Can I have some mango chutney with my pancake?",
        "They finished off all the food before I could get any.",
        "First you must bring the water to the boil.",
        "That was a really lavish meal.",
        "That smells appetizing.",
        "He doesn’t need any medicine now. What he needs is healthy, wholesome food.",
        "I haven’t tasted such a beautiful chicken curry for ages.",
        "It tastes sour.",
        "The smell was tempting.",
        "You must serve this sweet cold, and not hot.",
        "You’ve got egg on your face. Go and wash.",
        "There was a delicious smell from the kitchen, and it made our mouths water.",
        "They’ve asked me to dinner.",
        "Shell these peanuts, will you?",
        "I like eating raw vegetables.",
        "Your hands [smell of] fish.",
        "We have to buy some breakfast food.",
        "Don’t eat too much sugar.",
        "There was no milk, and I had to drink my coffee without.",
        "He drank the whole bottle of water.",
        "The butter has [gone off] — it has a sharp smell.",
        "Then she started kneading the dough.",
        "He stirred his coffee with a spoon.",
        "He picked up the cake and bit into it.",
        "This meat is very tender and easy to chew.",
        "We broke for lunch for an hour at 1 o’clock and then reassembled at 2.",
        "We’re eating out tonight.",
        "The cake was rather soggy — I didn’t like it.",
        "I didn’t like the soup. There wasn’t enough seasoning in it.",
        "That banana had a boring taste.",
        "I’m full — I can’t eat another mouthful.",
        "I have a terrific thirst.",
        "The butter has gone bad. It smells stale.",
        "She served the fish with a few slices of lemon.",
        "I had a meal of rice and chicken curry.",
        "She spread a slice of bread with butter.",
        "She spread butter on a slice of bread.",
        "Can you shell this egg, please? It’s a hard-boiled one.",
        "She threw the leftovers to the dog.",
        "Put some pepper in it — that’ll give it more taste.",
        "Ask everybody to come. Dinner is served.",
        "Can I have a drink of water?",
        "I was at breakfast, and then the door opened and they came in.",
        "I’m starving! Is the grub ready yet?",
        "She served the snacks hot.",
        "The kettle’s on the boil.",
        "I’ll have my coffee a bit weaker.",
        "Don’t make my tea too strong.",
        "They ate at the first serving (or sitting) and we at the second serving (or sitting).",
        "I’d like a small taste.",
        "It tastes bitter.",
        "Is there egg in this ice cream?",
        "She bakes mouth-watering cakes.",
        "He didn’t eat much dinner.",
        "Cut the bread and make some toast.",
        "She served out the soup to the children.",
        "Give me my eggs raw and not boiled.",
        "The pudding looked very tempting.",
        "They sell all kinds of baby foods and health foods.",
        "He always eats with a knife and fork.",
        "He took a bite out of the apple.",
        "She served the portions with a lavish hand.",
        "The food was awful.",
        "Have you stirred the cake mixture thoroughly?",
        "She’s in the kitchen, peeling the potatoes.",
        "First let’s have a bite to eat.",
        "I like to eat a lot of salads.",
        "I didn’t like the meat. It was smelly.",
        "He took a drink of water.",
        "He swallowed the curd in a (or one) mouthful.",
        "Add some pepper, salt and other seasonings to the soup — that’ll improve its flavour.",
        "The kitchen smelt strongly of fish.",
        "He was hungry after his long walk.",
        "The butter has gone (or turned) rancid.",
        "She cooked the vegetables with some hot-tasting spices.",
        "Cut the pie into four portions, will you?",
        "He only had a snack [at lunch] time.",
        "Have you served coffee to all the guests?",
        "I had a black coffee with sugar.",
        "She’s on a diet — she wants to reduce her weight.",
        "Let’s make a stew out of the leftovers.",
        "Let’s heat (or heat up) the soup. It’s cold now.",
        "I’ve forgotten when I last had a good meal.",
        "The tarts you made last time had coverings of pastry.",
        "The eggs won’t take long to fry.",
        "Cut these apples into halves and those apples into quarters.",
        "Can I have a second helping?",
        "It tastes sweet.",
        "We usually feed our kitchen scraps to our dog.",
        "The meat tasted like mutton.",
        "That’s a tasty dish.",
        "Have a smell of this milk. Does it smell all right?",
        "That’s a nice chicken curry.",
        "He ate a few mouthfuls of food and rushed out of the house.",
        "She prepared a dish of fish and vegetables.",
        "The factory canteen serves plain but wholesome meals.",
        "What delicious food!",
        "Most of the mangoes were mellow, but some of them were still green and hard.",
        "This recipe will be enough for three servings.",
        "Is this coffee sugared?",
        "There’s a smell of cooking.",
        "He didn’t like the food, but he got it down somehow.",
        "It was an atrocious meal.",
        "She gave him a handful of peanuts.",
        "I’m absolutely famished. I haven’t had a bite to eat all day.",
        "Would you like some peanuts — salted peanuts?",
        "She made some chicken sandwiches.",
        "He picked up a piece of cake and chewed on it.",
        "He only had a drink of water.",
        "He didn’t eat the pastry coverings of the pies.",
        "She put ginger, cinnamon, cumin and other spices into the curry to give it flavour.",
        "The doctor has asked him to avoid butter and other fatty foods.",
        "After all that work, I was very hungry.",
        "We had crispy fried chicken for lunch.",
        "I only had time for a snack lunch.",
        "He ate too much pastry.",
        "This fish is very bony.",
        "Do you prefer savoury snacks or sweet snacks?",
        "Have you peeled the onions yet?",
        "He had a bowl of porridge for breakfast.",
        "Today I had a large meal [at lunch] time.",
        "After that, they served us lunch.",
        "Look at those crows waiting for food scraps.",
        "It’s a long journey, and we must have enough provisions.",
        "The soup is warming up on the stove.",
        "The biscuits and cake tasted stale.",
        "We only have time for a quick snack.",
        "The coffee is too strong I can hardly drink it.",
        "This chicken needs some more spice.",
        "Can you taste the garlic in this curry?",
        "Look at these cutlets. Don’t they make your mouth water?",
        "This dish doesn’t taste good without vinegar.",
        "I think this rice is over-cooked. That’s why he hasn’t eaten it.",
        "That’s a nice rice pudding.",
        "I liked the cream filling in the chocolate.",
        "I don’t like meat if it’s not very well done.",
        "Cut me a piece of cake, will you?",
        "I had a strong black coffee, and it has left a bitter taste in the mouth.",
        "What’s that delicious smell?",
        "You can flavour the curry with pepper.",
        "He eats the plainest of foods.",
        "I had a savoury pancake, and she had a sweet one.",
        "Where do you usually lunch?",
        "These apples are not ripe enough to eat. They’re still green.",
        "Have you taken food yet?",
        "Have you started your baby on solids yet?",
        "I feel like a coffee.",
        "He picked up the apple and took a large bite out of it.",
        "Ask her to lay the table for lunch.",
        "We had ice cream for dessert.",
        "The cake has jam filling.",
        "What kind of eats did you have at the party?",
        "She boned the chicken and started cooking it.",
        "Don’t have too many sweets — you won’t want your dinner!",
        "I like bread, but I don’t like to eat the crusts.",
        "What’s for dinner?",
        "She’s a rotten cook.",
        "She flavoured the curry with chillies.",
        "He started chewing a piece of toast.",
        "She’s ill and she has completely lost her appetite.",
        "Let’s chop up the onions.",
        "Ginger makes digestion easier.",
        "These cakes are tasty.",
        "Would you like black coffee or white coffee?",
        "She put a chocolate in her mouth and started sucking it.",
        "The food was awful.",
        "Milk is certainly a good food.",
        "I didn’t eat the cake. It was mouldy and dry.",
        "He told me about it over coffee.",
        "We ate a buffet lunch.",
        "The meal was nothing fancy, but the portions were generous.",
        "That smells delicious.",
        "I added a little salt to it to improve the flavour.",
        "The helpings are generous in that restaurant.",
        "I feel like having something — something small and light, like crisps.",
        "He wasn’t hungry and he sat nibbling at his food.",
        "Look at these vegetables. Aren’t they fresh and crisp?",
        "She served us tea and cakes.",
        "These snacks have sweet fillings inside.",
        "I don’t like to eat vegetables when they’re over-cooked. I like my vegetables lightly cooked.",
        "That was a tasty meal.",
        "They’re young and they have healthy appetites.",
        "I like good, plain food — nothing fancy.",
        "He doesn’t eat much breakfast.",
        "How much chilli did you put in the curry?",
        "Drink up — hurry!",
        "What was the main dish?",
        "We had a snack of coffee and biscuits.",
        "She bit off a piece of the chocolate.",
        "This is good chutney. It has got a bit of bite to it.",
        "Two ice creams, please — one vanilla ice cream and one chocolate ice cream.",
        "I have a very poor digestion.",
        "We have a guest. Lay a place at table for him.",
        "They served us soup, a main meal and a sweet.",
        "That’s a tasty dish. How did you make it?",
        "I’m very thirsty — I need a long cool drink.",
        "They served us crisp toasted sandwiches for tea.",
        "Let’s make some toast for breakfast.",
        "I didn’t like the food. It had almost no taste or flavour.",
        "I like spiced food.",
        "The dinner smells good.",
        "He had salt porridge for breakfast.",
        "Add salt and pepper to taste.",
        "He doesn’t like dishes that are mild in flavour.",
        "He sat there sucking on an orange.",
        "You can eat it either raw or cooked.",
        "Have you fed the baby yet?",
        "I think it’s a rotten egg. Don’t use it.",
        "She was cooking dinner (or the dinner).",
        "The pancake had a savoury filling inside.",
        "Taste this and tell me if it’s too sweet.",
        "She hadn’t cut the crusts off when she made the sandwiches.",
        "She gave me a large helping of pudding.",
        "Did you sugar my coffee?",
        "This stew doesn’t taste very nice.",
        "I had toast and eggs for breakfast.",
        "The snacks were not sweet — they had a spicy taste.",
        "Have some more toast.",
        "Warm the plates before you serve the food.",
        "Don’t let your dinner get cold.",
        "He peeled the banana and ate it.",
        "I didn’t like the soup. It was tasteless.",
        "She sliced a cucumber.",
        "He was tired and hungry.",
        "She’s fond of cooking.",
        "You must only eat bland food until you get well again.",
        "He’s gone to (or for) lunch.",
        "She saved some food for later.",
        "Drink up your milk!",
        "One tomato soup and one chicken soup, please.",
        "Put these vegetables in the fridge, so they’ll stay fresh.",
        "Come and eat your lunch — or it’ll spoil.",
        "Either eat your carrots or you go without ice cream.",
        "She squeezed an orange or two and made me a glass of juice.",
        "I had breakfast on the train.",
        "What was the main course?",
        "She sat there munching chocolates.",
        "He sat there munching at (or on) an apple.",
        "She sat there munching an apple.",
        "She served us an interesting dish containing spinach and tomatoes.",
        "Come on, stop talking so much, and eat nicely.",
        "There’ll be a stop for refreshments on the way.",
        "That’s a rich cake. Don’t eat too much of it — it may cause indigestion.",
        "She flavoured the chicken curry with lemon juice.",
        "We had fruit and custard for dessert.",
        "He’s a big eater.",
        "He gulped down his tea and hurried out.",
        "The food is good at this restaurant.",
        "Don’t let the food go to waste — [finish it off].",
        "Would you like some more cabbage?",
        "She squeezed a little lemon juice in to the tea.",
        "I had a late lunch today.",
        "He’s a fussy eater.",
        "Can you make me a glass of lime juice?",
        "Would you like a glass of lime juice?",
        "Would you like a glass of lemon?",
        "The meeting started at 9, and there was a break for refreshments at 11.",
        "Have some more spinach.",
        "The food will spoil if you [don’t keep] it in the fridge.",
        "Pass me the toast, will you?",
        "She eats the most nourishing food, but she still looks thin.",
        "Rich restaurant meals are not good for your health.",
        "I didn’t like that soup — it was very bland.",
        "Stop talking and get on with your breakfast. Or you’ll be late for school.",
        "He licked the last of the ice cream off his plate.",
        "Put the meat in the fridge — or it [won’t keep] till tomorrow.",
        "They usually eat off china plates.",
        "Put the rest of that food in the fridge — we can eat it later.",
        "We’ll have to find a way of getting some food. We can’t let the children go hungry.",
        "I had a lick at the ice cream.",
        "She cut up the fish and salted the pieces lightly.",
        "This kind of rice cooks more quickly.",
        "You must mix flour, fat and water into a dough and roll it flat.",
        "Can’t we have lunch now?",
        "I’m starving.",
        "My mouth watered when I saw that cake.",
        "We get a good meal in our canteen.",
        "I’ll meet you during the lunch break.",
        "Shall I make tea (or the tea)?",
        "She makes wonderful puddings.",
        "I don’t like my vegetables very well-done.",
        "Shall I warm up the dinner?",
        "The coffee had a bitter taste.",
        "These salted mangoes will keep for months.",
        "She threw away the rotten fruit and vegetables.",
        "This tea has a wonderful flavour.",
        "The meal began only when everybody had been served.",
        "Look at the way the price of the foodstuffs is going up.",
        "She served some snacks with coffee — they had a salty flavour.",
        "My stomach was rumbling for lunch.",
        "What are we having for dinner?",
        "Brush the cake crumbs off the table.",
        "Taste and see if this soup needs more salt.",
        "We’ve run out of butter and jam — you’ll have to eat dry toast.",
        "They serve excellent lunches in this restaurant.",
        "They serve excellent dinners there.",
        "I can’t eat this orange — it’s bitter.",
        "These bananas are not yet ripe. They’re too green to eat.",
        "She shaped the dough into rolls.",
        "She had some tea and buns.",
        "Leave the potatoes to boil for about 20 minutes.",
        "We’ll discuss it over lunch.",
        "These oranges are completely rotten. Don’t eat them.",
        "There’s no food left — you’ll just have to go hungry.",
        "The biscuits were crisp and delicious.",
        "What kind of filling do you want in the sandwiches?",
        "You can’t have the whole cake — don’t be so greedy.",
        "That was a marvellous meal.",
        "You can cook it by frying or grilling.",
        "He can’t take solids — he’s too ill.",
        "I’ll have rice and chicken curry, and ice cream to follow, please.",
        "To follow, I’ll have fruit salad, please."
    ]
}