{
    " Group 1 ": [
        "We had a really pleasant time together.",
        "His French wasn’t as good as his English, but good enough.",
        "What an unpleasant man!",
        "Don’t expect them to be truthful — they’ve got no ethics.",
        "The weather conditions were bad, and the plane couldn’t land.",
        "He’s a very able lawyer.",
        "It’s an old car, but it’s basically sound.",
        "This is perhaps the finest film I’ve ever seen.",
        "He showed excellent self-control in his answer.",
        "What an awful smell!",
        "His work is satisfactory, but not outstanding.",
        "He’s a nasty man, and he won’t help anyone.",
        "That’s a remarkable achievement.",
        "She gave us some hints on how to look after indoor plants, and I found them very useful.",
        "He says he’s a policeman, but he doesn’t look authentic/genuine.",
        "He has a lot of good qualities and he deserves admiration.",
        "The conference was very dull, and I didn’t know what to do to amuse myself.",
        "That’s a marvellous dress you’re wearing.",
        "Some of these drugs have a harmful effect on the nervous system.",
        "She’s a very skilled and experienced swimmer.",
        "Many of them are incapable and don’t have the abilities necessary to do their jobs.",
        "He is an exceptionally talented painter.",
        "His work is first class.",
        "What miserable weather! If only it stopped raining!",
        "That’s a first rate plan/idea.",
        "The management of that company seems to be very inefficient.",
        "Their work is well below standard.",
        "I don’t think it was an honest answer.",
        "All the players were good, but he was easily the best.",
        "This dishwasher is an ingenious invention.",
        "The index at the back of the book is not as good as it should be.",
        "He had a better life there.",
        "He’s a very gifted violinist.",
        "If you want to be successful in this business, you’ll have to offer the best to your customers.",
        "That’s a very good product.",
        "The new park is going to be an excellent place for kids.",
        "I think his argument/reasoning is faulty.",
        "The dress she had on wasn’t suitable for the occasion.",
        "The telephone line was defective.",
        "He’s all right — you can trust him.",
        "He did an admirable job in dealing with the situation.",
        "One thing I like about him is, he has a positive attitude to everything.",
        "He was very unfriendly, and his behaviour was nasty.",
        "That was an outstanding/impressive performance.",
        "He’s an ethical person — I’m sure he won’t stoop to blackmail.",
        "It isn’t a genuine/an authentic Michelangelo drawing, but a fake.",
        "Their computers are superior to those of others.",
        "He never loses his temper, and that’s an admirable quality.",
        "That is a marvellous idea.",
        "He’s a nice person, but rather dull and boring.",
        "The election didn’t produce a satisfying result for them.",
        "Don’t buy those vegetables — they’re rotten.",
        "Do you think the supplies of food are sufficient?",
        "He’s a kindhearted person.",
        "He’s good looking and fashionable.",
        "The boss was in a foul temper today.",
        "He’s a fine painter/musician/actor.",
        "He likes to play tricks on others — he’s a mischievous person, you know.",
        "The painters have done an excellent job of that building.",
        "Our company is going through a bad time.",
        "That was a surprise to me, but an agreeable one.",
        "His new house is a bit small, but very pleasant.",
        "That egg is rotten — don’t eat it.",
        "He isn’t very clever, but he tries hard.",
        "He showed great surprise at the news, but I don’t think it was genuine.",
        "He’s always hopeful and confident, and it’s great to work with him.",
        "I like the design of this building/ dress/furniture — it’s stylish.",
        "I’m not happy with his work — it’s below a satisfactory standard.",
        "Thank you for an excellent evening.",
        "His argument/reasoning was deeply flawed.",
        "I don’t think it’s a sound idea/plan.",
        "The problem is, the supplies of medicines are not adequate.",
        "She always goes out dressed in fine clothes.",
        "His new film is a miserable failure.",
        "He’s a firstrate professional.",
        "They’re all fine singers.",
        "Change that dress — it looks awful on you.",
        "He’s an outstanding player.",
        "He’s very truthful, and you can trust him.",
        "I find it difficult to believe that he’s a real/genuine doctor.",
        "The telephone system in our area is very inefficient.",
        "We had a really good time at the party last night.",
        "This food has a nasty mouldy smell."
    ],
    " Group 2 ": [
        "The terms of the new contract are really advantageous to us.",
        "This film doesn’t have any technical merit, but it’s very entertaining.",
        "This medicine isn’t suitable for all patients.",
        "He’s a superior musician.",
        "He’s very competent in foreign languages.",
        "I think the fears of the industrialists are legitimate, and not groundless.",
        "My room has a fine view of the countryside.",
        "The kitchen smelt foul.",
        "His car is in first class condition.",
        "If you want to know how to start up a company, you should consult Mr. Ashok Arora — he’s a specialist adviser, you know.",
        "He’s the most honest man I ever met.",
        "They treated us dreadfully.",
        "Last night’s party was good wholesome fun.",
        "He has a bad character, and he can’t be trusted.",
        "Many of our doctors are not adequately trained.",
        "We had a really enjoyable time there.",
        "The arrangements for the conference — I don’t think they were adequate.",
        "I don’t know if this make of TV is all right.",
        "Who cooked this dish? It’s superb!",
        "His interpretation of the balance sheet figures — it’s faulty.",
        "I don’t think he’s suitable for that job.",
        "He had a terrible accident last year.",
        "Stress in itself is not always harmful.",
        "He’s a nice person, and is pleasant to be with.",
        "Their village/town is rather crowded, but very pleasant.",
        "He’s good-looking and stylish.",
        "The new boss is always nasty to me.",
        "The work was not up to standard.",
        "That was a very competent performance.",
        "The boss seems to be in a foul mood today.",
        "He’s a genuine person — always honest and sincere.",
        "This butter tastes stale.",
        "I like her — her behaviour has a childlike quality.",
        "She’s very clean, and always keeps the kitchen free from dirt.",
        "Most people in that area are poor and live in housing of sorts/of a sort.",
        "That was a satisfying meal.",
        "That bridge is in poor condition and may soon collapse.",
        "He’s an expert tailor.",
        "He claims to have invented this device, but do you think his claim is legitimate?",
        "The smell of rotting cabbage was disgusting.",
        "The new arrangement suits me fine.",
        "He’s a miserable man, and always bad-tempered.",
        "That’s a great idea.",
        "It was a bad accident, and his injuries were awful.",
        "I don’t think he was being truthful with us when he said all those things.",
        "The whole marketing department in our company is very inefficient.",
        "This milk has gone bad.",
        "The food in that restaurant is very good/poor.",
        "His hearing/sight was defective.",
        "He’s a very talented tennis player.",
        "This food has gone off, and it smells.",
        "He has superb confidence.",
        "If you bury a piece of wood, it’d decay/rot.",
        "This medicine is an effective cure for TB.",
        "This method is inefficient and expensive.",
        "The flight was very comfortable, and I enjoyed it.",
        "He’s a poor singer — his wife can sing better than him.",
        "He’s a very friendly and agreeable person.",
        "She has a nice little house there.",
        "Don’t keep biting your nails — it’s a disgusting habit.",
        "He’s a very moral person — don’t expect him to stoop to bribery.",
        "This is not the most favourable time to start up a company.",
        "There’s no doubt that his work deserves to be praised.",
        "This is a boring subject.",
        "This is a wicked world.",
        "He’s an outstanding musician.",
        "That building is very impressive.",
        "The things they’ve done are morally unacceptable.",
        "Prof. Ahmed is an expert on this topic.",
        "Their new interest rates seem very advantageous.",
        "That’s a fine book.",
        "I found his joke offensive.",
        "He has an excellent brain and is very competent.",
        "This method isn’t effective and isn’t going to produce the result we want.",
        "The boss liked her because she was honest and reliable.",
        "It’s immoral to deceive other people.",
        "That’s a faulty switch — we’ll have to get it replaced.",
        "I didn’t like the food — it wasn’t all right.",
        "They sell good quality furniture.",
        "This bread isn’t fresh — it’s stale. Don’t eat it.",
        "The terms of the contract are not very advantageous to us.",
        "He’s a great painter — he has superb skill.",
        "You shouldn’t wear this sort of dress to the office — it isn’t suitable, you know.",
        "I’ve had a bad day at work.",
        "This is certainly an awesome achievement.",
        "The food was poor.",
        "He’s a fine-looking young man.",
        "He lives in a nasty little flat there.",
        "He was way below the standard required, and was not chosen for the job.",
        "Most of our employees are hardworking and responsible.",
        "He’s a warm and friendly man.",
        "He’s a mischievous person — he takes delight in embarrassing others.",
        "I like him — he’s an admirable character.",
        "The children looked smart in their white shirts.",
        "His new film has a lot of artistic merit.",
        "Our new boss looks very stern, but is actually harmless.",
        "He was splendid company during the journey.",
        "He was found to be a superior candidate, and he was chosen for the job.",
        "She’s an expert at cooking.",
        "They claim to be the market leaders in this industry, and I think their claim is reasonable and justified.",
        "She gave us an excellent meal.",
        "He says this diamond is flawed.",
        "The food here is first class."
    ],
    " Group 3 ": [
        "You’ll have to give me a truthful answer.",
        "Rumours like these would certainly be damaging to our reputation.",
        "I hate that place — it’s awful.",
        "The preparations for the meeting were not satisfactory.",
        "These floppy disks are of superior quality.",
        "I don’t think the response to their latest ad was very good.",
        "Don’t use this milk — it smells off.",
        "That machine was of poor quality.",
        "His financial situation is awful.",
        "He exercises every day and keeps in perfect shape.",
        "The bathroom was dirty and disgusting.",
        "I don’t think the investigation has been thorough.",
        "It’s not a very expensive hotel — the prices are OK.",
        "Did you go to the carnival? It was an impressive spectacle.",
        "I found his argument defective.",
        "I think today’s going to be a pleasant day.",
        "She’s a very attractive and fashionable woman.",
        "He made some nasty jokes about me.",
        "He’s the most upright and trustworthy man I’ve ever met.",
        "This sort of diet isn’t suitable for most people.",
        "He has a few valuable contacts in the government.",
        "The lecture was so dull I fell asleep.",
        "That’s a fine book.",
        "The film didn’t have a satisfying ending.",
        "Her grandfather is past 90, but his mind is sound.",
        "Do you think the talks the unions had with the management were genuine?",
        "There’s nothing more enjoyable than lying on that beach.",
        "He has a foul mouth, and nobody likes him.",
        "He’s an excellent student.",
        "That was a defective theory.",
        "His jokes are always the same, and they’re boring.",
        "He felt that the only honourable course of action was to resign.",
        "The education system here isn’t as good as it should be.",
        "Is the pain terrible/very bad?",
        "I’ve made some arrangements, but I don’t know if they’re OK.",
        "The government’s decision is very good news for small investors.",
        "That building is very old, and all the doors and windows are rotten.",
        "That’s a very attractive dress.",
        "I don’t think that house is in very good condition — don’t buy it.",
        "He’s a warm and kindhearted man.",
        "Divorce isn’t good for children.",
        "Look at those flowers! Aren’t they a beautiful sight!",
        "This job is no good at all — I’m going to resign.",
        "Bangalore has a pleasant climate.",
        "This is a nasty situation, and I don’t know how he’s going to handle it.",
        "Our old boss was very able and efficient.",
        "The motor bike is a very convenient way of getting around.",
        "Those suggestions were not good enough to be accepted.",
        "That dress looks stylish — I like it.",
        "The vegetables have started decaying/rotting.",
        "That was an excellent dinner.",
        "He and his business partners get along splendidly.",
        "It was a boring meeting/party.",
        "His musical ability is of a high standard.",
        "He’s an expert in this sort of work.",
        "Dishonest behaviour is something I had never expected from him.",
        "The show was just excellent entertainment.",
        "All these rumours are mischievous.",
        "That’s a great relief.",
        "The weather has been awful for a week now.",
        "That food is no longer fresh — it’s stale.",
        "Her son is an able child, and he’s very good at his studies.",
        "There’s a negative side to his character that I don’t like.",
        "That’s an old building and it has started to decay.",
        "He did OK at the interview.",
        "The weather has been good for some time now.",
        "Trying to convince him of something is really tedious.",
        "Adultery is considered immoral.",
        "They’re very poor, and their living conditions are very harsh/severe.",
        "I don’t like his paintings — they’re of poor artistic quality.",
        "He’s a world-class tennis player.",
        "He’s evil, and he takes pleasure in harming other people.",
        "Do you think this is a suitable present for her?",
        "Tomorrow is her birthday.",
        "The water supply in this area is quite inadequate.",
        "He’s always had high moral standards.",
        "Many of the trade union leaders are not trustworthy."
    ],
    " Group 4 ": [
        "He’s a specialist in repairing computers.",
        "I don’t think the things he said were truthful.",
        "He had a smart blue shirt on.",
        "The whole department is corrupt — everybody takes bribes.",
        "These two teeth have decayed, and they need to be pulled.",
        "We’ve just had very good news.",
        "He has committed several awful offences.",
        "He’s a narrow-minded person.",
        "He’s a wicked man, and he’s made his wife’s life a misery.",
        "The brakes were defective.",
        "It seems they’re in severe financial difficulties.",
        "I’m sure he’ll soon become a world-class champion.",
        "I like the new job, but the pay is bad.",
        "He is an effective lawyer.",
        "This work is quite inadequate — you’ll have to do it again.",
        "That’s an excellent idea.",
        "He’s a man of dubious character.",
        "This is wonderful news — I’m so happy.",
        "Arguments and quarrels like these can turn nasty.",
        "They only sell superior quality paper.",
        "They arrived at a very convenient moment.",
        "The food tasted disgusting.",
        "He used to do reasonably well in school, without really trying.",
        "He gave me a few tips on answering questions at interviews, and they were really valuable.",
        "This is dreadful news.",
        "He has a collection of splendid paintings.",
        "That was sound advice — you should have taken it.",
        "His moustache isn’t genuine — it’s phoney.",
        "It’s always satisfying to be proved right.",
        "He always uses foul/bad language.",
        "We had a really great time together.",
        "He’s wicked by nature.",
        "He’s an honourable man, and he won’t behave in a cheap way.",
        "Filling up long forms like these is tedious work.",
        "I found most of his answers unsatisfactory.",
        "His behaviour was rude/shocking.",
        "He isn’t a good person to work with.",
        "That’s a school of quality.",
        "This food isn’t fit to eat.",
        "He’s an evil man.",
        "That’s a useless job, but he had to take it because opportunities were scarce.",
        "He gave me a few valuable tips, and I found them very helpful.",
        "Our education system is hopeless.",
        "He’s very thorough, and is very methodical in his work.",
        "Food shortage has become severe.",
        "He’s a very capable person, and he can do most things well.",
        "That was a marvellous performance.",
        "This is a nasty problem, and I don’t know how to deal with it.",
        "He’s a capable worker, and we don’t want him to leave us.",
        "The timing of the meeting was very convenient.",
        "He’s very incompetent and can’t do his job properly.",
        "He speaks good English.",
        "The new boss is stern and hard to please, and isn’t popular with the staff.",
        "That was a coincidence — a remarkable coincidence.",
        "It was the most disgusting thing I’ve ever tasted.",
        "He’s a splendid painter.",
        "That man is boring — he only talks about himself.",
        "She’s a dressmaking expert.",
        "One thing about him is, he’s honest and dependable.",
        "This scandal will be damaging to the Chief Minister/the government.",
        "That was an excellent performance/lecture.",
        "It’s good to see you after all this time.",
        "I’m very tired — it was an awful journey.",
        "I have a severe/terrible toothache.",
        "Do you think their intentions are honourable?",
        "It’s a good job, and the salary isn’t bad.",
        "He’s very corrupt, and he only does things in return for money.",
        "This isn’t a nice thing for a person with your reputation to do.",
        "We had a good time on the trip.",
        "That’s a college of a high standard.",
        "A few weeks holiday will be beneficial to your health.",
        "He works very hard and is absolutely trustworthy and level-headed.",
        "She’s a bad driver.",
        "He’s a very helpful person.",
        "We had to reject their offer, because it was quite inadequate.",
        "The carnival was a spectacle not to be missed.",
        "These shoes are of low/poor quality.",
        "He has a wonderful view from his bedroom window.",
        "Diabetes is a nasty disease.",
        "The smell in the toilet was disgusting.",
        "I find the opening hours of the bank very convenient.",
        "He’s not a real/ genuine policeman — he’s just a fraud/fake.",
        "He’s a man of superior intelligence.",
        "Their work was satisfactory, but it could have been better."
    ],
    " Group 5 ": [
        "That’s a horrible thing to say.",
        "I can’t stand the smell of rotting vegetables/meat/fish.",
        "The article he sent to them was not of an acceptable standard, and they decided not to publish it.",
        "He’s a marvellous actor.",
        "It was boring to sit there with nobody to talk to.",
        "He won’t fail to notice things like these — he has an expert eye, you know.",
        "He’s an honest man — he never tries to deceive people.",
        "That’s not a bad idea.",
        "When he started his career, he was very honest, but now he’s become corrupt.",
        "He looked pathetic, and I felt sorry for him.",
        "Did he tell you the awful news?",
        "His suggestion is certainly worthy of consideration.",
        "He’s a dishonest lawyer.",
        "He’s sure to make a favourable impression on the interview board.",
        "She’s a real expert on art, and you can learn a lot from a conversation with her.",
        "He coped with the situation admirably.",
        "I’ve had a terrible journey, and I’m very tired.",
        "We had a wonderful time in Goa.",
        "He was smart and well-dressed.",
        "There was a foul stench when the rubber started burning.",
        "She’s an able student/teacher.",
        "What rotten luck!",
        "You should arrange a convenient time for the negotiation.",
        "That wasn’t a satisfactory answer.",
        "It tastes slightly bitter, and it has a very unpleasant smell.",
        "These are pathetic excuses — do you think I believe what you’re saying?",
        "He looked splendid.",
        "I found that film very boring.",
        "They’re a bunch of incompetents.",
        "He’s past 70, but his body is still sound.",
        "He isn’t an expert or anything — he’s phoney.",
        "She’s very efficient and does a good job as our Managing Director’s secretary.",
        "These shoes are great for walking in the country.",
        "He’s a corrupt politician.",
        "The washing machine was defective and wasn’t working properly.",
        "He acted honourably, and apologized to them.",
        "I don’t like that man — he’s awful.",
        "She’s a thoroughly evil woman.",
        "He’s an annoying person — he keeps asking personal questions.",
        "He had a severe hip injury.",
        "There’s nothing like a good book.",
        "His efforts certainly deserve praise.",
        "Some of these foods contain a lot of chemicals and additives, and may have a harmful/damaging effect on your health.",
        "I don’t think she should get married to him — he isn’t worthy of her.",
        "He’s a specialist on European history.",
        "This is a pocket-sized computer, and I find it very handy.",
        "We usually avoid that restaurant — it’s a fancy place, and very expensive, you know.",
        "The film was entertaining, but not particularly good.",
        "What an awful thing to say!",
        "We took a chance, and we’ve won — it’s very satisfying.",
        "She’s a poor swimmer.",
        "This toaster is a clever invention.",
        "The trouble is, none of their plans are thorough.",
        "He was good at languages while at school.",
        "Everybody had a good opinion of the way the police handled the situation.",
        "He’s a great musician.",
        "I’ve just had some very bad news.",
        "They were a superior team and they won.",
        "She’s a very competent cook.",
        "I don’t think what you said was appropriate to the situation.",
        "This kind of attitude is simply not acceptable.",
        "She has an evil tongue, and she keeps spreading rumours about other people.",
        "He’s a remarkable writer.",
        "You look marvellous",
        "Ajith!",
        "He’s not a dishonest man — I’ve always found him to be fair in his dealings.",
        "He’s very ingenious and is full of clever ideas and plans.",
        "His accent sounded phoney.",
        "There were lots of good applicants for the job, but she was much better than the rest.",
        "That’s a very exclusive restaurant, and not many people can afford to go there.",
        "This fish is rotten and is beginning to smell disgusting.",
        "I don’t find his explanation satisfactory.",
        "I like him — he’s wonderful.",
        "This bread/cheese is mouldy — don’t eat it.",
        "The safety record of that airline is exemplary.",
        "Don’t take him to that hospital — he won’t have the best of care there.",
        "It’s not a serious problem, but an irritating one.",
        "The air in this room is rather stale — I think we’ll open the windows.",
        "This dish tastes good.",
        "You don’t need any medicine — what you need is lots of wholesome natural food.",
        "I find this work slow and tedious and rather frustrating.",
        "That was a world-class performance.",
        "He doesn’t have the qualifications to be a doctor — he’s a fake/ fraud.",
        "The information I got from there was very useful.",
        "He collapsed in the street and fainted, and when he came to, he was in severe pain.",
        "She’s very skilled at making people at their ease.",
        "The design of that building — it was defective.",
        "Have you seen his paintings? I think he’s just great/wonderful!",
        "That was a dinner of sorts/of a sort — I didn’t enjoy it.",
        "This is a clever new gadget — it can sharpen pencils.",
        "I don’t think their action was appropriate — they shouldn’t have dismissed him at all.",
        "The compromise formula was not acceptable to them.",
        "I’ve had a rotten day at work.",
        "I don’t think he’s competent enough to be put in charge of the office.",
        "Our house has got a marvellous view of the countryside.",
        "I think he’s horrible and disgusting.",
        "Her excuses were not genuine, but phoney/false.",
        "They’re planning to give a lavish and select party and only the most important people here are going to be invited to it.",
        "These clothes are great for cold weather.",
        "He has suffered some dreadful injuries."
    ],
    " Group 6 ": [
        "The weather conditions in their place would be very harsh now.",
        "His behaviour/tact was exemplary.",
        "He only likes the best.",
        "That’s a fancy school — only wealthy businessmen can afford to send their children there.",
        "He gave a performance on the piano, and it was very impressive.",
        "She’s a lovely and well-mannered woman.",
        "This cooker/fridge is faulty.",
        "The police found the information he gave very valuable.",
        "The food was absolutely bad.",
        "This material is of good/high quality — it’s very good for curtains.",
        "You should take exercise regularly — that’ll have a beneficial effect on your health.",
        "He’s a very skilled guitar player.",
        "She’s always hopeful that things will turn out well.",
        "He’s fine at sports and rather poor at his studies.",
        "He’s a remarkable man and has a lot of unusual qualities.",
        "Their new boss seems to be a clever man — he understands things quickly.",
        "That hotel is very convenient to the airport.",
        "If you don’t handle the situation properly, it’ll turn/go sour.",
        "I had the good fortune to win first prize.",
        "There are a lot of people who think abortion is immoral.",
        "This sort of behaviour is unsuitable for educated people like you.",
        "Many of the passengers suffered dreadful/terrible injuries in the crash.",
        "I’ve got some splendid news for you.",
        "I had a bad dream last night.",
        "Do you think their firm is financially sound?",
        "Many of these so-called charitable causes are not genuine, but bogus/phoney.",
        "There’s a pleasant view from her window.",
        "I didn’t like her performance — it was absolutely pathetic.",
        "This device is very suitable for cleaning windows.",
        "I find some of his habits very irritating/annoying.",
        "Even if he finds your wallet, he won’t give it to you — he has no morals.",
        "This isn’t a very nice room.",
        "He has one or two of his teeth decayed.",
        "He hasn’t done anything illegal or dishonest.",
        "He seems to be in a good mood today.",
        "His health steadily became worse.",
        "Don’t expect him to be kind to you — I’ve never found him to be charitable.",
        "He’s very skilful and clever with his hands.",
        "I’m hopeless at playing golf.",
        "His body is very healthy, considering his age.",
        "They claimed to be earthquake victims, but they were frauds/fakes.",
        "They make high quality chocolates.",
        "He returned some of the parts/components, because they were defective.",
        "That wasn’t a satisfactory attempt — you should try again.",
        "Life would be dreadful without a TV.",
        "He doesn’t have a regular job, and he makes a living of sorts/of a sort by doing this and that.",
        "That’s a clever idea/plan — and I think it’s the only way to handle this situation.",
        "Tomorrow won’t be convenient for me.",
        "She always chooses superior cloth for her dresses.",
        "Neither solution seemed acceptable.",
        "That was a pathetic attempt — no wonder it didn’t succeed.",
        "He was fired because he was found to be inefficient.",
        "This is a very satisfying job.",
        "That’s a rotten idea.",
        "This is a hopeless situation — I don’t know how he’s going to deal with it.",
        "He has expert hands and will be able to repair the car in no time.",
        "It’s an old car, but it’s in good condition and quite dependable.",
        "I like him — he’s a pleasant person.",
        "He behaved dreadfully at the meeting.",
        "He’s a great one for getting people to talk confidentially to him.",
        "Don’t eat that food — it smells dreadful.",
        "He may be poor, but he’s honest.",
        "This is the best hotel I’ve ever stayed at.",
        "He’s dishonest and immoral, and he won’t hesitate to trick you out of your money.",
        "In about a month, the weather would become mild and warm.",
        "The arrangement we come to must be satisfactory to both parties.",
        "That’s an old and decaying building.",
        "He’s a talented musician.",
        "They’ve called off the strike — it’s a very satisfying development.",
        "Let’s not forget that their support is very valuable to us.",
        "That bridge is very old and isn’t in good condition.",
        "He’s bad at mathematics.",
        "They always buy the choicest apples/ vegetables/fruits/meat.",
        "That man has a nasty mind.",
        "I’ve never seen him confident that things would turn out well.",
        "That’s a very popular and fashionable restaurant.",
        "Their business partnership has turned/gone sour.",
        "That’s a clever solution — I’ve been wondering how to solve this puzzle.",
        "This wallet is made of genuine leather.",
        "That’s a dull novel, and there’s nothing exciting in it.",
        "Most articles in that magazine are of a superior standard.",
        "What’s that disgusting smell?",
        "The great thing about him is, he’s very understanding.",
        "You can trust him — he’s a dependable person.",
        "I don’t think he’s a capable person — he doesn’t have the qualities necessary to cope with life.",
        "That film was marvellous — I enjoyed it very much."
    ]
}