{
    " Group 1 ": [
        "He has the ability to learn things quickly and well.",
        "He likes finding out about things.",
        "He’s got brains, but he doesn’t use them.",
        "He has the ability to make good judgments and quick decisions.",
        "He’s very sensible and thinks very clearly.",
        "He’s shallow and has no intellectual depth or understanding.",
        "He always makes sensible decisions.",
        "He’s intellectual and rational, rather than emotional.",
        "He has brains and ambition, but he never tries hard.",
        "He always acts on practical ideas and understanding.",
        "He has a great interest in learning new things.",
        "His judgment is never mistaken and is always correct.",
        "He’s very thorough in analyzing situations.",
        "He’s a very bright and intelligent person.",
        "Those children seem to be more intelligent than average.",
        "He shows a good understanding of people and situations.",
        "He has a scientific bent.",
        "He can understand situations well and knows how to take advantage of them.",
        "He can predict things that are going to happen.",
        "He’s not stupid, but never makes an effort to understand things.",
        "She’s very clever and can think quickly.",
        "He never stops to think that his actions may have negative consequences.",
        "She’s full of original and unusual ideas.",
        "He introduces changes and new ideas.",
        "He often does stupid things.",
        "He knows a lot about this subject.",
        "He has a good brain and he can understand things quickly.",
        "He’s an intellectual, and has an amazing brain.",
        "He’s experienced about life and is not easily shocked/impressed.",
        "He can express his thoughts in a clear and calm way.",
        "He notices and understands things quickly.",
        "He has a good understanding and practical knowledge of these things.",
        "His son has a bent for mathematics.",
        "She’s a brilliant/talented person.",
        "She always behaves sensibly.",
        "She has a good memory for names/faces.",
        "I don’t think he’s a serious- minded person.",
        "He’s a creative person.",
        "He’s quick to notice and react to things.",
        "He isn’t as intelligent as a normal person of his age.",
        "He doesn’t know what’s happening in the world.",
        "He’s slow to understand things.",
        "He’s good at making plans.",
        "He has clever and original ideas and is good at inventing things.",
        "He’s quite bright, but nobody would call him a genius.",
        "He has the ability to recognize things that are of good quality.",
        "He’s good at noticing things, especially things that are not obvious.",
        "He’s able to remember things very well.",
        "He has a brilliant mind.",
        "He’s an intelligent person, and he notices these things quickly.",
        "What he does is not based on logical reasons or clear thinking.",
        "He can think and express his ideas clearly and forcefully.",
        "He’s a shrewd person — you can’t trick him.",
        "He has a sharp/ready wit — and is very pleasant to talk to.",
        "He’s intelligent and can plan things well."
    ],
    " Group 2 ": [
        "He’s a man of outstanding skill/ability.",
        "He has a keen intellect.",
        "He often forgets things, and is unable to organize his thoughts properly.",
        "He’s good at judging the quality of things and people.",
        "He’s a very innovative person.",
        "He has a good mind, and is sure to figure out a way to get out of this difficulty.",
        "He’s full of clever and original ideas.",
        "He has a capacity for languages.",
        "He doesn’t think clearly and is emotionally/mentally unbalanced.",
        "He has a lot of creative abilities/powers/talents.",
        "He’s very good at persuading people to believe what he says.",
        "She’s got a good/bad memory.",
        "She’s a very clever woman and can understand things easily.",
        "He tends to say things that confuse everybody’s mind/thoughts.",
        "He spends a lot of time studying and thinking about complicated things and ideas.",
        "He often becomes confused and unable to think properly.",
        "He’s clear-headed.",
        "He has a keen/ sharp mind.",
        "He’s a man of considerable intellect.",
        "He’s quick at learning things.",
        "He’s intelligent and good at thinking quickly.",
        "He has the ability to invent and develop original ideas.",
        "He’s a lot smarter than most of us.",
        "He can express his thoughts and ideas easily and well.",
        "He’s stupid and takes a long time to understand simple things.",
        "He shows a clear understanding of a lot of facts about the subject.",
        "He’s always excited about things and is eager to know more about them.",
        "He’s rather serious and intellectual.",
        "He understands and recognizes things quickly and thoroughly.",
        "He often looks dumb and foolish.",
        "He spends a lot of time reading serious books.",
        "He’s a deep individual and very brainy.",
        "Nothing that he does shows good judgment.",
        "He’s easily able to think of new and exciting things.",
        "He’s very clever, and he’s good at using indirect methods to achieve things.",
        "She’s stupid and not very clever.",
        "He regularly checks up on all the recent facts about the subjects he’s interested in.",
        "He often looks confused and acts as though he can’t decide what to do.",
        "He’s very clever and is aware of what’s happening around him.",
        "The problem is, he isn’t experienced about the practical aspects of life.",
        "He’s an educated person.",
        "She has a sharp mind/intellect.",
        "He plans his work and activities very efficiently.",
        "He’s always uncertain and confused about things.",
        "He has a lot of knowledge of this subject.",
        "He can easily handle situations that most people find difficult.",
        "I don’t think he’s very clever or brainy.",
        "He’s only interested in serious subjects of a very intellectual nature.",
        "He has a lot of common sense.",
        "She can persuade anybody to do what she wants them to do.",
        "She can do complex maths in her head.",
        "He never uses his brain and keeps on asking other people what to do.",
        "He’s very quick to notice things and can understand them clearly.",
        "He’s very bad at organizing things in his life.",
        "He has gained a lot of knowledge by studying.",
        "Most of the children in her class had no difficulty in learning.",
        "She shows great academic knowledge.",
        "He seems to know everything.",
        "He has a sharp business brain.",
        "He’s clever and quick at understanding the deeper meaning of situations.",
        "He’s a shallow individual and not very deep.",
        "She has the ability to think clearly.",
        "His ideas are too simple, and they indicate a lack of intelligent thinking.",
        "Whatever he says is always very clear/ effective/forceful.",
        "He often acts as though he feels lost and uncertain.",
        "He has a sharp, analytical mind.",
        "He’s a man of forceful character, but he can’t understand complex problems and situations.",
        "He’s intelligent and well-educated.",
        "She’s a gifted child.",
        "He’s very well-informed and is never dull.",
        "He pays a lot of attention to things, and notices more about them than most people.",
        "His mental capacity is amazing.",
        "He’s very thorough in making plans.",
        "He’s very shrewd and can make quick decisions.",
        "He isn’t very intelligent and often does silly things.",
        "He’s an expert on this subject."
    ]
}