{
    "key": [
        "I hadn’t thought of that. You’ve got a point there!",
        "What about that! He’s started his own business!",
        " A breakdown transport strike flat tyre! This is real bad luck!",
        " A A transport A flat tyre! This is real bad luck!",
        "A power cut today of all days!",
        "A mere office boy hoping to get married to the Managing Director’s daughter! What an idea!",
        "Ah, Amit has taken the lead now! I think there are two more laps to go. (= taken the first position).",
        "As if she didn’t know!",
        "Ask them to stop making so much noise! It’s driving me out of my mind.",
        "At last, summer has come to an end!",
        "At least he finished third. That’s something!",
        "Away with all these rules and regulations! They don’t let you do business.",
        "Away with these corrupt ministers!",
        "Away with you! I’m trying to get some sleep. (= go away).",
        "Be careful! I’m sure he’s up to no good. (= planning to do something bad).",
        "Be careful! It’s very hot. You’ll burn your hand.",
        "Beat it! Get out of here!",
        "Break it up, you two! (= stop fighting).",
        "Bring it here this minute! (= at once).",
        "Carry on the good work, Sharma!",
        "Come on! Get in the car. Let’s go.",
        "Come on! Go for it! Don’t give in now. You’re sure to win this match.",
        " Come on! Let him go, Salim (= release him; let him leave free escape).",
        " Come on! Let him go, Salim (= release him; let him be  escape).",
        "Come on! Let’s follow that car!",
        " Come on! Stop the engine machine.",
        " Come on! Stop the motor machine.",
        "Come on, get a move on! You’ll have to finish the job by tomorrow, remember. (= hurry up).",
        "Come on, move it! We’ve got a lot to do today. (= hurry up).",
        "Come quick — Vinod had collapsed on the floor!",
        "Come, come! That isn’t fair. You shouldn’t say that.",
        "Come, come! That’s not true.",
        "Congratulations! I can’t tell you how happy I am for you.",
        "Damn you! You and your snooping questions!",
        "Did you ever see such a small elephant!",
        " Don’t do this, and that too, to impress others. Be yourself! (= act naturally).",
        "Don’t exaggerate — tell it like it is!",
        "Don’t give in now! Go to it — you can win this match.",
        "Don’t go around with those crooks — or you’ll come to no good!",
        "Don’t just stand there watching! Come and help us.",
        "Don’t let me catch you doing that again!",
        "Don’t lose interest now! The project is not even half-way through.",
        "Don’t lose your temper over something so silly. Be your age!(= stop behaving in a childish way; grow up!)",
        "Don’t mind me! I won’t disturb you!",
        "Don’t play out of turn!",
        "Don’t talk nonsense! I’ve had just about enough!",
        "Don’t talk rubbish! You don’t know the first thing about what you’re talking about.",
        "Don’t tease my sister again — or else!",
        "Don’t tell anybody — keep it secret!",
        "Don’t tell me you haven’t done it again!",
        "Don’t think he’s very rich — far from it! (= He’s not!).",
        "Don’t try any funny stuff with me!",
        "Don’t try to fool me. That just isn’t on!",
        "Don’t try to fool us this time. Look here, none of your little games!",
        "Easy! That floor is slippery.",
        "Everybody panicked, but she didn’t. She has a cool head!",
        " Father Teacher knows best — don’t argue!",
        " Mother Teacher knows best — don’t argue!",
        "Follow me!",
        "Get a move on! Or you’ll miss the train.",
        "Go and wash!",
        "Go on with you! You can’t be serious!",
        "God only knows what the boss is going to do when he comes to know about all this!",
        "Good show! You’ve done a thorough job.",
        "Goodbye! All the best!",
        "Goodbye! Take care (of yourself)!",
        "Guess what, I’ve won first prize!",
        "Have you ever heard such nonsense!",
        " He asked me not to compete in the 100 metres, so he could win. What an idea! (= What a foolish unreasonable suggestion!).",
        " He asked me not to compete in the 100 metres, so he could win. What an idea! (= What a  surprising suggestion!).",
        "He has cut his finger(s) on the broken glass! How careless of him!",
        "He introduced Bina to me — as though I didn’t know her already! (= I knew her already).",
        "He made me look a complete fool!",
        "He says he’s going to stand for Parliament — would you believe it ! (= believe it or not).",
        "He started explaining to me how important the conference was. As if I didn’t know it already! (= I knew it already).",
        "He started one of his stale jokes, and I thought “Here we go again!”",
        "He told me he didn’t like the idea. As if I cared! (= I don’t care at all).",
        "He told the workers the company faced a very uncertain future because of the frequent strikes. As if they cared! (= They didn’t care).",
        "He wants to marry a woman ten years older than him. Did you ever hear anything like that!",
        " He was arrested on a charge of credit card fraud or something. God help him!",
        "He’ll make you pay for ruining his chances. Be careful!",
        "He’s absolutely broke! Nobody ever thought he would come to this!",
        "He’s deep in debt, you know. And he’s lost his job. God help him! (= His circumstances are really unfortunate — and nobody will be able to help him).",
        " He’s going to marry a woman five years older than him. I ask you! (= And I express my anger shock",
        " He’s going to marry a woman five years older than him. I ask you! (= And I express my  disapproval).",
        " He’s not a novelist at all. Don’t talk such nonsense",
        " He’s not a novelist at all. Don’t talk such rubbish",
        "He’s smart, I’ll give him that!",
        "He’s so common, shouting at his wife in public like that!",
        "“He’s started his own business! How about that!”",
        "He’s their chairman, no less!",
        " Her brother must have seen you making eyes at her. You’d better watch out! (= looking at her in a way that suggests sexual interest).",
        "Here I am! It’s good to be home again.",
        "Here we are! His office is the second room to the right.",
        "Here we go — he’s lost his temper again!",
        "Hold everything! The machine’s jammed! (= wait; stop doing what you’ve been doing; hold it!).",
        "Hold everything! The picnic has been cancelled! Prem was taken ill suddenly.",
        "Hold it a second! I’m not ready yet! (= stop!; wait!; hold on!; stay in that position).",
        "Hold it! Don’t move!",
        "Hold it! You can’t go in there!",
        "Hold still! I want to take one more picture. (= don’t move).",
        "How can I tell what’ll happen in the future!",
        "How can you look to the Government for help in matters like these!",
        "Hurry up! You’d better get going, or you’ll miss the train. (= start now).",
        "Hurry! Or else you’ll miss the train (= otherwise).",
        "I can’t give you more than Rs.10,000 for it — that’s final!",
        " I could do with a cup of coffee! (= want",
        "I didn’t tell her any such thing!",
        "I didn’t think that your closest friends would deceive you — but you live and learn!",
        "I don’t know how I can find the money to meet these expenses. Oh, what a life!",
        "I don’t think the police are interested in arresting the real culprits — what a business! (= What an annoying affair!).",
        "I know what you’re planning to do. I wasn’t born yesterday!",
        " I know why you did all those things. I wasn’t born yesterday! (= I wasn’t deceived by the things you did I’m not as foolish or stupid as you think).",
        "I make a loss of Rs.10,000 on this deal, but that’s life! (= these things happen occasionally in real life, and there’s nothing I can do to change them).",
        "I never imagined the rain would pour down today — of all days. The match has been washed out — what a pity!",
        "I owe you some money, remember! Here you are! (= I’m giving it to you now).",
        " I saw him going hand in hand with her, and I couldn’t able to believe my eyes! All along, he’s been telling me they didn’t know each other (= I was very surprised and couldn’t believe what I saw).",
        "I stayed in that hotel only for a day. That was quite enough!",
        "I won’t do it — that’s final!",
        "I’ll do it. Don’t keep pestering me like this. Give me a break! (= stop annoying me!).",
        "I’ll see you next Monday! All the best!",
        "I’m not going to sell it — and that’s the end of the matter! (= that’s final)",
        "I’m trying to catch up with my work. Beat it! (= go away at once; hop it).",
        "I’ve had a very long day — I need a rest!",
        "If only he could give us a few hours of his time!",
        "If only he wouldn’t shout!",
        "If only I could spend a few happy hours with my family!",
        "If only I was home in bed!",
        " If only more people concerned themselves in problems like these!",
        "If only you people took a leaf from his book and submitted your reports in time!",
        " If you dare say that again, I’ll do you (for it)! (= punish you).",
        "It was a real job, getting the top off that medicine bottle! (= It was very difficult to get…).",
        "It’s a pleasure to watch those happy children. Look how cheerful they are!",
        " It’s dinner time!",
        "It’s great to know you!",
        "It’s later than I thought. Hurry up! Or we’ll miss the train.",
        "Just you wait — I’ll get even with you!",
        "Keep quiet, every one of you!",
        "Let go — or I’ll scream!",
        "Let me get my hands on him! I’ll teach him a lesson.",
        "Let them make their own decisions — so hands off! (= Don’t interfere!).",
        "Listen to those birds singing in the trees. And look at these flowers — what a lot of them! Ah, this is the life!",
        "Look at he flowers in those vases. How beautifully she’s done them!",
        "Look what you’ve done! You’ve ruined the game.",
        "Look where you’re going — you nearly bumped into me!",
        "Mind that step! It’s slippery.",
        "Mind what you say!",
        "Mind where you keep your wallet!",
        "Mind your head! The door frame is low.",
        "My God, I could do with a hot cup of coffee!",
        "My goodness! Have you seen the time! Hurry up, or we’re going to be late.",
        "My office-boy shouting at me! I ask you! (= Isn’t it absolutely ridiculous!)",
        "My! This curry tastes good!",
        "No way, Mr. Shenoy! I won’t do it.",
        "Not many people are bold enough to resign like that — he’s a man and a half!",
        "Of all the cheek! When I went into my office today, I saw my secretary sitting in my chair and chatting with someone who had come to meet her.",
        "Of all the dirty tricks! Gopal has gone and told the boss I left the office early yesterday.",
        "Of all the luck! He’s been promoted.",
        "Of all the nerve! My office boy — he came to me and told me I shouldn’t have been late.",
        "Oh my God! I’m done for! (= am in serious trouble).",
        " Oh, grow up and stop quarrelling you two! (= stop behaving in a silly way).",
        " Oh, grow up and stop fighting, you two! (= stop behaving in a childish way).",
        "Oh, the years of pain I had to go through — you’ve no idea!",
        "Oh, these children are too much! If only they made less noise! (= They’re very annoying and I can’t bear them).",
        "Oh, you’ve muddied your face again. Come on, get cleaned up!",
        "Only a week to go before my birthday!",
        "Poor man! He had a heart attack and he died before his time. (= before he was old enough to die).",
        "Remember you’ve prepared well for the exam. Go in and win!",
        "See you again soon! All the best!",
        "She was caught reading the boss’s private letters. How do you like that!",
        "She’s up to something, I can tell you.",
        "I saw him there, I tell you!",
        "So he was the murderer. To think that he was sitting next to me on the train!",
        "Speak lower — they’ll hear you!",
        "Stop annoying me! My patience is now at an end.",
        "Stop chatting and get on with your work!",
        "Stop it this minute!",
        "Stop wasting time — we’ve got work to do!",
        "Thank God everybody’s safe!",
        "Thank God she isn’t seriously hurt. You don’t know how relieved I am to hear that!",
        "That does it! This is the third time you’ve crashed the car and damaged it. Don’t take the car out again! (= What you’ve done is beyond the limit of what is acceptable, and I won’t tolerate it).",
        "That sounds like Mohan all over! (= That exactly what I would expect from him).",
        "That was close! I thought he’d run me over.",
        "That was the most exciting outing I’ve ever gone on. Oh, you’ve no idea!",
        "That’s a good idea!",
        " That’s a wonderful idea!",
        " That’s a marvellous idea!",
        "That’s just like him — try to fight it out on his own!",
        "That’s just like you — slog away at the accounts for hours!",
        "That’s just my grandfather all over!",
        "That’s my report! I wonder how it found its way into the hands of the newspaper reporters.",
        "That’s not yours — hands off! (= Don’t touch it!).",
        "The boss called me in, and what do you know, he told me I had been promoted!",
        "The boss didn’t even look at my report. All my hard work went for nothing!",
        "The decision was announced by the Prime Minister himself, no less!",
        "The earthquake victims — they went through a real ordeal. Oh, it was dreadful. You’ve no idea!",
        "The idea of you trying to threaten her! What...",
        "Cold is not the word for it, it’s freezing!.",
        "The riot is now firmly under control, thank God!",
        "The secret is out at last!",
        "The snacks are on me! (=I’ll pay for them).",
        "There (now)! Don’t keep worrying about it. Everything will be all right.",
        "There (now)! There’s nothing to worry about!",
        "There (now)! You’ve ruined my dress!",
        " There goes Vishal again, finding fault with others!",
        "There you go again, poking into other people’s business!",
        "There we go — she’s started crying again!",
        "There you are! Didn’t I tell you he was a colonel and not a major!",
        "There you are! I was wondering why you hadn’t come so far.",
        "There! Look what you’ve done!",
        "There! That’s the job done!",
        "There, there! Don’t cry!",
        " There’s the bell! your wallet! it is!",
        " There’s the There’s your There it is!",
        "This is our big chance! Let’s make the most of it.",
        "This is our team’s chance — go in and win!",
        "This isn’t a real gold chain — I’m afraid you’ve been done!",
        "Use your head! They won’t have approached you again if they’re not willing to reach a compromise. (= Think sensibly).",
        "Wait for me — I won’t be a minute!",
        " Up with the monarchy! (= We want it to begin on).",
        "Down with the king! (= We’re opposed to him).",
        "Wasting money like that on cigarettes and drinks! I ask you!",
        "Watch your language! We can’t have that here.",
        "Watch yourself! Don’t say things like that.",
        "We can’t get a loan from the bank now that just isn’t on!",
        " We’ll have to carry it into the bedroom. Be careful — it’s very heavy. Easy does it! (= Do it slowly and carefully).",
        "We’ve had enough of your fine speeches!",
        "Well, of all the impudence! How dare you speak to me like that!",
        "Well, of all the luck! He’s won the game again.",
        "Well, what do you know, he’s lost the election!",
        "What a bright idea!",
        "What a dead place this is! There’s nothing to do here.",
        "What a job it was, trying to close that deal! (= How difficult it was…).",
        "What a lot of hardship and suffering the drought caused! You’ve no idea!",
        " What a lot of people were killed before they could buy victory",
        "What a lovely day it has been!",
        "What a relief! The guests are off my hands.",
        "What a ridiculous idea!",
        "What a silly book this is!",
        "What a start that noise gave me!",
        "What a state you were in ! I’ve never seen you so angry!",
        "What a state you’re in ! Go and get cleaned up!",
        " What a stupid thing to do",
        "What a sweet (little) child! (= lovable…).",
        "What an awful noise! I can’t hear myself think. (= I can’t concentrate or think about anything because of the noise).",
        "What naughty children they are!",
        " What polite children!",
        "What wouldn’t I give for a hot cup of tea now! (= I want it very much).",
        "What wouldn’t I give to be back at home now!",
        "What a business it is, getting a passport!",
        "When I went to buy a TV, the dealer kept on talking to me about how he became a dealer for various makes of TVs — as if it mattered! (= though it did not matter).",
        "Who knows what he had in mind when he said that!",
        "Who knows what the future holds for them!",
        "Who knows what the future holds for us! (= what will happen to us).",
        "Who knows what they’re going to do!",
        "Who knows what’ll happen in the future!",
        "Who knows when we’re going to die! So let’s live well.",
        "Who knows! A lot of trouble may follow.",
        "Who knows! At some time in the future, things like these may happen.",
        "Who would have thought that he’d get this job!",
        "You can buy gorgeous dresses at that shop — at a price! (= at a high price).",
        "You can’t always have everything you want. Act your age!",
        " You can’t beat the system (in this company government society), you know — you’ll just have to accept it!",
        " You can’t beat the system (in this the our society), you know — you’ll just have to accept it!",
        "You can’t trick him into believing all this. He’s been around, you know!",
        " You had better watch out! I think he has designs on your money",
        " You look wonderful in that dress!",
        " You look marvellous in that dress!",
        "You must be joking! You can’t expect me to believe that!",
        "You seem to have made a hit with that girl, Bose!",
        "You shouldn’t have insulted him like that. You had better watch yourself!",
        " You timed your arrival well They never expected you’d come in at that moment!",
        " You timed your arrival beautifully They never expected you’d come in at that moment!",
        "You’re good at giving slick excuses — I’ll give you that! (= I admit it, but don’t think I like it).",
        "You’re not telling the truth. You’re hiding something from me. Come on! Out with it! (= say it!)",
        "You’re standing on my foot!",
        "You’ve been promoted! I’m so glad! This news really makes my day.",
        "You’ve no idea how disappointed I was!",
        "You’ve no idea how hot it is out there!",
        "You’ve no idea what a magnificent performance it was!",
        " Your brother really knows how to play chess! (= is good at…).",
        "Come on! It’s time for bed (= time to go to sleep).",
        "Damn it! I’ve forgotten my shaving things. You know, I had to start at short notice. (= without much warning).",
        "Don’t get excited! Keep cool!",
        " He tried to keep cool, though his heart was thumping now. (= remain calm, and not get excited",
        "Good Lord! Isn’t that a snake! [= (good) Heavens].",
        " He has food on the brain! (= keeps thinking about it or remembering it — continually).",
        " I won’t be able to wait — sorry! I have a train to catch. (= get on).",
        " I won’t be able to wait — sorry! I have a bus to catch. (= get on).",
        "I’m prepared to help them — within limits, of course! (= to a limited degree, to a reasonable extent).",
        "If only we had taken notice of their warning! (= paid attention to; considered; taken it into consideration).",
        "If you dare say that again, I’ll knock your block off ! (= hit you on your head).",
        "Listen, everybody! You’ll have to fill in the forms yourselves. (= nobody else must do it for you).",
        "Look at the size of that cat! (= Isn’t it really big?).",
        "My God, that shop’s on fire! (=burning).",
        " Stop it! Don’t pull me like that! You’re hurting (me arm).",
        " Watch your language! There are ladies present! (= Don’t use rude swear words).",
        " Watch your language! There are ladies present! (= Don’t use offensive swear words).",
        "Stop finding fault with him! you’re just kicking him when he’s down. ( = attack him when he’s not in a position to defend himself).",
        " Our factory workers seem to be waiting for an excuse to go out on strike. What a shocking unhappy state of affairs!",
        "Come on! Be a sport and give me a hand to lift this table. (= Be a helpful person).",
        "You and your stupid secret! Who wants to hear it anyway!",
        "Get out! I’m sick of the sight of you!",
        "Stop reading! It’s time you went to bed.",
        "Switch off the TV, children! It’s time for bed.",
        "Don’t be too severe on her — she’s only a child!",
        "He murdered a ten-year old girl. Oh, how could anyone commit such a horrible crime!",
        "The pan has boiled dry. Take it off the stove — come on!",
        "This plan won’t work. Come back to earth, Ajai!",
        "You can’t treat this office as (if it was) your house. Don’t entertain your guests here!",
        "You’ve been working hard all day. Go out and have fun!",
        "Let’s stop and rest (for) some time. I can’t climb any further!",
        " So you don’t know (the meaning You’re just guessing!",
        "If only school re-opened! The children are getting in my hair.",
        "There must be some mistake! I didn’t even speak to her, let alone molest her!",
        "Don’t wear that dress — everyone will make fun of you!",
        "If only I had a memory like hers!",
        " Ouch stop it! That hurts.",
        "Naveen is such a glutton. Look at him feeding on ice-cream!",
        "Hurry up! Open that gate — jump to it!",
        "Don’t mistake me, I don’t like kids!",
        "The driver indicated right and then turned left!",
        "Stop shouting, will you? Really, you are the limit!",
        "Oh, these children are the absolute limit!",
        "You should make an application today itself. Don’t delay!",
        "You’ll never guess who I ran into today — our old landlord!",
        "You’ll never guess what she told me!",
        "He stood there looking as if butter wouldn’t melt in his mouth. But I know he’s capable of murder when he loses his temper!",
        "Blow me, he can’t spell his own name!",
        "They’ve started quarrelling again. What a pain in the neck!",
        "Your room is a sight! Why don’t you straighten it up?",
        "You’re a sight! Get cleared up!",
        " He got 90 marks out of 100! That was a fine performance!",
        "I don’t think the government really wants to better the conditions of the workers — it’s all politics!",
        "This is a wild scheme. How can anybody put this into practice!",
        "I’ll do it tomorrow— that’s a promise!",
        " Come on! Eat some of the pudding",
        " Come on! Eat some of the porridge",
        "That was a brilliant score!",
        "Don’t tell anybody — keep it secret!",
        "You look happy, Sheela!",
        "Look at those flowers. Aren’t they a lovely sight!",
        "Remember, our necks are at stake!",
        "I don’t like him, but I’ll admit this: He certainly has style!",
        "You must be joking! You can’t expect me to believe that!",
        "You shouldn’t have behaved so rudely towards them. You really overstepped the mark this time!",
        "Rice pudding? Great! What a treat!",
        "That rice pudding was a real treat!",
        "The kitchen looks a sight! Come on, let’s clean it up.",
        " I wish there are no unpleasant surprises waiting for us!",
        "If only this fine weather held for one more week!",
        "Let’s stop this senseless arguing and turn our attention to their matters. (= start considering…).",
        "At last, the visitors have gone! Now we can turn our attention to our work.",
        "Imagine my surprise when he rang me up one day after five years!",
        "No, no, don’t pay — I’ll treat you!",
        " None of your foolishness please!",
        "Don’t touch that pan — you’d burn yourself!",
        "You don’t want to come with us? Okay, suit yourself!",
        "There it is, your wallet. It is lying right in plain sight — and you told me you couldn’t find it!",
        "It was a secret and I shouldn’t have told it to her — me and my big mouth!",
        "You’ll have to go at once!",
        "Don’t delay — leave at once!",
        "Stop — the lights are red!"
    ]
}