{
    " Group 1 ": [
        "Nowadays, cars cost a lot of money.",
        "Look at that dress she’s wearing — it cost very little money.",
        "Do you think money always brings happiness?",
        "If we don’t cut costs, we won’t be able to make a profit this year.",
        "He has invested his money in a highinterest bank account.",
        "How much cash have you got with you?",
        "His finances are in a bad state.",
        "Could you change a Rs. 100 note?",
        "He hasn’t paid off all his debts yet.",
        "I’m a little short of money/funds/cash at the moment.",
        "If you spend more than your income, you’ll soon get into trouble.",
        "The bank refused to lend to their company.",
        "They’ve already raised more than Rs. 500,000 for flood/famine/earthquake relief.",
        "How much are you prepared to spend?",
        "You’ll have to bear the cost of all these repairs.",
        "How much does a musician earn?",
        "He got a chance to go abroad at the company’s expense.",
        "His money is all tied up in his business.",
        "The shoes in the sale were really cheap.",
        "Can I pay you in coin?",
        "They have enough money to live on without financial problems.",
        "He has plenty of money, but no style.",
        "“How much do all these items together cost?” – “That comes to Rs. 78”.",
        "That dress costs too much money — or I would have bought it.",
        "If you pay cash, you can get some money off.",
        "Could you change a Rs. 10 note into two fives?",
        "You had better pay up — or they’ll take you to court.",
        "He’s inherited a lot of personal wealth.",
        "His last business deal made him a tidy profit.",
        "The bank has lent us Rs. 100,000.",
        "The bank has lent Rs. 100,000 to us.",
        "He owes me a great deal of money.",
        "He kept on spending money in an uncontrolled way, and he soon got into debt.",
        "I’m due for a pay rise this month.",
        "He earns Rs. 200,000 a year.",
        "He can claim back his travelling expenses.",
        "I bet you Rs. 1000 that he won’t win this election.",
        "He made his money by speculating on the stock market.",
        "How much money does he earn a month?",
        "If you sell the car now, it may fetch about Rs. 100,000.",
        "We can’t afford a car — we don’t have enough money to buy one.",
        "How are you off for money?",
        "If you need more money, ask me.",
        "Do you have any loose/small change with you?",
        "I need some change for the phone.",
        "They owe the bank more than Rs. 100,000.",
        "They owe more than Rs. 100,000 to the bank.",
        "They’ve paid the last instalment, and no more payment is due.",
        "I can lend you Rs. 5000 if you will pay it back next Monday.",
        "He owes me 500 rupees for the work I’ve done.",
        "She spends a fortune on clothes.",
        "He used the money to buy a car.",
        "He earns his living as a freelance photographer.",
        "Making money is his sole object in life.",
        "When he was a minister, he built up a lot of wealth.",
        "How much have you got in change?",
        "She spends a lot of money on clothes.",
        "His job brings in about Rs. 100,000 a year.",
        "I saw his wallet — it was stuffed with Rs. 100 notes.",
        "Ask the manager for a 500 rupee advance on your salary.",
        "Have you got change for a Rs. 100 note?",
        "They’re paid weekly.",
        "Their wages are paid weekly.",
        "I’m a little short now — I’ll pay you next week.",
        "He is on/earns/gets a salary of Rs. 1,20,000 a year.",
        "How much does that hotel charge for a single room?",
        "I owe my wealth to good luck.",
        "They don’t even have money to spend on basic necessities.",
        "They’ve offered Rs. 400,000 for our farmhouse.",
        "They gave me an interestfree loan.",
        "All his savings are in the bank.",
        "She comes from a poor family.",
        "He made a fortune on the stock exchange.",
        "Her husband’s small salary was their only source of income, so money was very tight.",
        "You’ve given me too much change by mistake.",
        "I’d like the money in Rs. 100 notes.",
        "The bank has agreed to advance Rs. 100,000 to us.",
        "I paid you with a Rs. 100 note, so I need Rs. 7 change.",
        "He’s leading a life of luxury.",
        "They’ve spent huge sums of money carrying out this project.",
        "This project/ bridge/scheme is funded by the government.",
        "He charged me Rs. 25 for the rice.",
        "He hasn’t paid back the money I lent him yet.",
        "He’s a man of great wealth.",
        "There was an offer of Rs. 100,000 for his car, but he turned it down.",
        "I pay an interest of 10% on the loan I’ve taken.",
        "He hadn’t earned the money — he had stolen it.",
        "You can make quite a lot of money out of this contract.",
        "How did his wealth grow like this?",
        "His business failed, and he lost all his money.",
        "If we buy these things at wholesale prices, we can save a lot of money.",
        "He sold the car, and it brought in about Rs. 75,000.",
        "He had a big, fat wallet in his pocket.",
        "I have paid the builder a 100,000-rupee advance.",
        "How much do they charge for a haircut?",
        "He gave the impression of coming from a wealthy background.",
        "It costs Rs. 2500, and I am Rs. 500 short. I’ll buy it tomorrow.",
        "Do they charge for postage and packing?",
        "The bank has agreed to finance our new business.",
        "He’s made of money.",
        "I saw him giving her a bundle of notes.",
        "His deposits have been earning 12% interest in the bank.",
        "He just managed to scrape enough money together to buy a TV.",
        "He got a tidy sum from the company when he retired.",
        "I have no cash on me — I’ll pay you tomorrow.",
        "He has invested most of his money in shares.",
        "Don’t waste your money on unnecessary things.",
        "Their firm has got into financial difficulties.",
        "What do they charge for a cup of tea?",
        "We’re collecting for famine relief. Would you like to make a contribution?",
        "How can he be hard up? He earns a decent salary.",
        "The cost of petrol has gone up again.",
        "You’ll have to change your American money for Indian money.",
        "Our holiday was terribly expensive.",
        "Don’t forget to count your change.",
        "You should invest your capital wisely.",
        "They don’t have enough money for their needs.",
        "Large sums of money are spent on market research.",
        "What’s the train fare to Bombay?",
        "That painting is worth a lot of money.",
        "They offered the dress to me at a bargain price.",
        "What a lot of money he wastes on drinks!",
        "Money is tight, and life is difficult.",
        "How much does he charge for washing a car?",
        "When he retired, all the staff contributed Rs. 50 towards a retirement present for him.",
        "We can’t buy a TV now — we’re too hard up to afford it.",
        "I was short of funds, and I couldn’t pay him."
    ],
    " Group 2 ": [
        "What’s the exchange rate of the dollar today?",
        "That bridge was built at great expense.",
        "He counted out 1000 rupees in 100-rupee notes.",
        "His investments earn a lot of interest.",
        "I have a large family to provide for.",
        "He has enough money to have everything he needs.",
        "She gave him 10 rupees in 50 paise coins.",
        "If I had more cash, I’d resign and set up my own business.",
        "This car is worth Rs. 200,000.",
        "This bill is long overdue — let’s not put off paying it any longer.",
        "I like this job, but I’m not making much money.",
        "I’m down to my last 10 rupees. I can’t afford to waste it.",
        "Does the shop charge for delivery?",
        "He only gets a low salary in that job.",
        "How can he have a car and live in such a nice house if he’s badly off?",
        "Our country was short of foreign exchange at that time.",
        "How much does it cost?",
        "Can’t you drop the price a bit?",
        "This is too high.",
        "Who will bear the expense?",
        "He’s a miser — he hates spending money.",
        "It’s very difficult to raise a family on what I earn.",
        "Only people like him can afford cars like this — he’s a millionaire, you know.",
        "This research is funded by the government.",
        "He’s a rich man — he must be worth at least a crore.",
        "Let’s not spend all this money at once.",
        "He desperately needed money.",
        "That’s a dependable garage, but their charges are rather high.",
        "He earns quite a high salary in this job.",
        "I’d like to buy it, but I can’t — I’m flat/absolutely broke.",
        "Have you paid the electricity bill yet?",
        "How much foreign exchange do you have?",
        "I got this dress cheap at the sales.",
        "How much did your holiday cost this year?",
        "They have very little money, and it’s hard for them to make ends meet.",
        "I got a rise of Rs. 200 last month.",
        "They’ve plenty of money, and they live well.",
        "I usually get a bit short of funds by the end of the month.",
        "He paid for his house by borrowing from the bank.",
        "He put the money in the safe.",
        "We can’t buy a car now. Money is tight at the moment.",
        "He’s only been in business for a year, and he’s already gone bankrupt.",
        "How much did the garage charge you?",
        "I don’t think he gets a good/decent salary in his present job.",
        "I don’t think they’re poor at all — he and his wife are always expensively dressed.",
        "The new Minister is an expert in finance.",
        "Waiter, can I have the bill, please?",
        "Apples/Chairs are going cheap at the market.",
        "The leader of the Opposition has demanded a cut in government spending.",
        "He comes from a rich family.",
        "How much did you pay them for the car?",
        "His family is very well-off.",
        "Our rent is in arrears.",
        "Can I borrow Rs. 100?",
        "This shirt is a real bargain at such a low price.",
        "I don’t want to put money into that company.",
        "Ask them to settle our bill. Tell them we need money.",
        "He’s a good electrician, and his charges are reasonable.",
        "The boss put up his salary by Rs. 500 last month.",
        "He died in poverty in the end.",
        "This cake cost Rs. 150.",
        "Where can I exchange my pounds for rupees?",
        "Shirts are reduced from Rs. 500 to Rs. 300 in the sale.",
        "The shopkeeper overcharged me by Rs. 500.",
        "They were a family of enormous wealth.",
        "He has a good job and is very well paid.",
        "He has a lot of well-off friends, and they would lend him as much money as he needs.",
        "Do they have enough finance for this project?",
        "He’s always borrowing off his friends.",
        "How much do your arrears for rent add up to?",
        "I think he’s paid a lot of money for it.",
        "I paid for the things he bought, and he said he’d settle up with me later.",
        "They’ll deliver the fridge free of charge.",
        "He’s on a good salary in that job.",
        "He comes from a poor family.",
        "The American dollar is a strong currency.",
        "Could you change me a Rs. 100 note?",
        "Could you change a Rs. 100 note for me?",
        "His salary is higher than mine.",
        "It’ll cost at least Rs. 5,000 to repair the car.",
        "It’s cheaper to go by bus than by train.",
        "I can’t find the money — or I’d have bought that car.",
        "I wonder how he and his family manage to live on one income.",
        "We completed the job on time, but we haven’t had any payment yet.",
        "He comes from a well-to-do family.",
        "I don’t like carrying much money on me.",
        "He borrowed Rs. 1000 from me last month. He hasn’t paid me back yet.",
        "He wants to get rich quickly.",
        "I bought some groceries from them on credit last month, and I haven’t been able to settle up yet.",
        "There’s no charge for children — they go free.",
        "I didn’t have any money on me at that time.",
        "They’re desperately poor.",
        "Have you got a 50-paise coin to put in this machine?",
        "He’s gone to change his dollars for/into Indian money.",
        "He contributed Rs. 1000 to the disaster fund/relief fund/famine fund/earthquake relief fund.",
        "The trip cost an awful lot of money.",
        "They asked Rs. 500 for the dress.",
        "Running a car is a great expense.",
        "You’ll have to make a payment of Rs. 500 as a deposit.",
        "They have very little money, and they live in poverty.",
        "The country’s finances are not good.",
        "He borrowed Rs. 20,000 from a bank and bought a TV.",
        "He’s a successful businessman, and he has money.",
        "At last, he’s settled all his debts.",
        "They’ll deliver the order for a modest extra charge.",
        "He had Rs. 100 with him in notes and coins.",
        "I doubt we’ll ever get rich.",
        "Most people in our village are poor.",
        "You can claim back on expenses.",
        "I don’t have any spare cash at the moment.",
        "He made certain he had enough money.",
        "I only have notes — I don’t have loose/small change.",
        "How much is the flight from here to Delhi?",
        "Ask about the price.",
        "Houses are very expensive in that area."
    ]
}