{
    " Group 1 ": [
        "The rain-soaked earth — it has a sort of smell — a pleasant smell, you know.",
        "The mango trees — they were in bloom.",
        "The soil was damp — and sweet smelling.",
        "The village was noisy with activity.",
        "The grass was very green.",
        "Look at the mountains beyond those hills — the snow-covered mountains",
        "I mean.",
        "Voices of people talking — the voices came clearly across the water.",
        "The lawns were green.",
        "The winds came from the mountains far away.",
        "We walked along a sandy path.",
        "Damp clay — the bank of the river was heavy with it.",
        "I felt a strange peace — a strange, all-pervading peace.",
        "There was no colour in the sky.",
        "There were a number of huts with thatched roofs.",
        "The calf was calling for its mother.",
        "The rain was pattering on the roof, and I sat there listening to it.",
        "Her garden has open, green lawns.",
        "The trees were still bare.",
        "The birds carried on with their chatter.",
        "There were large puddles all along the path.",
        "Children were shouting with laughter along the beach.",
        "The branches and leaves — they were stirred by the breeze.",
        "There were acres of green lawns and lovely trees.",
        "There was a soft breeze — and it came from the north.",
        "We could see birds bathing on the edges of the streams.",
        "The hills looked beautiful against the blue sky.",
        "The earth was full of dead leaves.",
        "The sun was over the hills — the eastern hills.",
        "The sky was pale blue.",
        "The horizon — it was filled with white clouds.",
        "The mountains were shining — shining with the setting sun.",
        "The tree trunks — they looked dark.",
        "There was a grove of bamboos to my right — and a grove of mangoes to my left.",
        "The eagle was not beating its wings and was floating on the breeze.",
        "There was a movement of some kind in the woods.",
        "Outside, the moon was bright.",
        "The skies suddenly cleared.",
        "It was a rough road used by the villagers.",
        "It was a beautiful country.",
        "It was a clear starry night.",
        "The bushes have started flowering.",
        "It was cool in the shade.",
        "The crows were fighting.",
        "We sat there, facing the sea.",
        "Look at those dark, heavy clouds.",
        "The earth was soggy.",
        "The trees were covered with tender green leaves.",
        "There was a glow in the sky — the eastern sky.",
        "It was very quiet in the valley.",
        "I could hear the roar of the sea.",
        "There was a gentle breeze.",
        "The valley was full of trees and streams.",
        "The fields were green — green with the sprouting rice.",
        "I found the evening full of light and, you know, splendour.",
        "The leaves sparkled — in the clear air.",
        "The sound of the song — it filled the air.",
        "It was a moment of great beauty — of great beauty and stillness.",
        "It was impossible to see the birds in the dark foliage.",
        "The hills were not high.",
        "The stars were very clear.",
        "The wild bushes were green.",
        "The hills in the distance looked black.",
        "The smell of the earth — that pleasant smell — it filled the air.",
        "There was a goat tied to a fruit tree.",
        "All along the banks of the river, there were trees.",
        "The path ended at the bank of a stream.",
        "The tall palms were very still."
    ],
    " Group 2 ": [
        "The hills, trees and everything — they looked alive and serene.",
        "Through the window, you could just see the sea.",
        "The rain was welcome after the hot days.",
        "The smell of the mango — it was in the air.",
        "The sound of falling water — that was pleasant.",
        "We were far away from noise and confusion.",
        "The leaves are full of dust — the summer’s dust.",
        "The goats were eating wild bushes.",
        "The soil was damp from the rains — the recent rains.",
        "All round, there were wide-spreading trees.",
        "The birds were still asleep in the trees.",
        "There was this sound of running water among the bushes, and we sat listening to it.",
        "There were many small streams going through the valley.",
        "It was a most lovely evening.",
        "There’s a slight mist today — a slight ground mist.",
        "A gentle breeze was blowing — from the south.",
        "There were a few red paths, and they wound through the palm groves.",
        "We had a long, hot summer this year.",
        "The morning star was barely visible.",
        "The earth was soft under the feet.",
        "The tree was full of leaves — tender new leaves.",
        "There was the smell of rain — and of dampness.",
        "Not a ripple on the water.",
        "The leaves of the tree — they were making shadows on the wall.",
        "Listen to the frogs croaking.",
        "The dew was still on the fields — and on the leaves.",
        "The road was full of puddles.",
        "The sun was just up, and it was quite early.",
        "Look at those vultures — they’re moving without a flutter of their wings.",
        "The river was wide and curving.",
        "The flowers looked intense — intense in their yellow.",
        "My feet sank into the clay — the damp clay.",
        "The woods — they spread for miles over the hills.",
        "There was a straight path, and it cut across the lawn.",
        "It had rained a great deal, and the fields were under the water.",
        "They sat there, feeding the ducks.",
        "Solitude — the purity of solitude — that’s what the whole place had.",
        "The surface of the water was still, and there were fishing boats on it.",
        "It had rained all night.",
        "We walked up a steep path — and then down a long slope.",
        "Several trees overhung the road.",
        "It was a nice garden with flowering bushes.",
        "The sea was dark — and restless.",
        "The sun was setting.",
        "It was a well-kept and well-watered garden.",
        "The raindrops on the flowers — they looked beautiful.",
        "There were a number of goats scattered about on the hillside.",
        "The clouds were red — golden red.",
        "The earth was red and dry.",
        "There were overhanging trees all along the road.",
        "The clouds were fantastically shaped.",
        "With the dawn, the frogs became silent.",
        "A large bird — it was trying to catch fish.",
        "The trees were dark against the evening sky.",
        "Birds began their chatter as soon as it began to get light.",
        "The water on the path was ankle deep.",
        "Look at those clouds behind the mountains.",
        "She sat there watching the waves come in and go out.",
        "There was dust everywhere.",
        "The sea was very blue.",
        "There was a sweet scent in the air.",
        "The grain was ripening in the fields.",
        "A bird came swooping in a curve and caught an insect.",
        "There was a strong smell of seaweed.",
        "There were deep pools of clear water.",
        "The sea was calm.",
        "The sea was violent and threatening.",
        "The trees were putting out green leaves.",
        "We were then going through the outskirts of the city.",
        "The birds were searching for worms.",
        "The clouds hid the sun.",
        "A bird flew across the moon — silently.",
        "It was a rough, pebbly road.",
        "There were a number of cows among the trees.",
        "The bird was perched on a branch of a tree — a dead branch.",
        "There was plenty of shade under the trees.",
        "The moon made a path of light on the river.",
        "The garden overlooked the river.",
        "We could see a few stars through the trees.",
        "The road curved and went past the ruins.",
        "The grapes were just beginning to ripen.",
        "The sky was intensely blue.",
        "It was quite early, and there was a beginning of a glow in the east.",
        "The road was crowded with bullock-carts.",
        "There was a pleasant smell in the air — the pleasant smell of the rose.",
        "Soon we reached the foot of a rocky hill.",
        "It was cool after the hot, sunny day.",
        "The wind had stopped blowing.",
        "The pond was full to the brim.",
        "The rain has washed away the dust — the dust of months.",
        "The cats were chasing each other.",
        "There were a great many birds running up and down the lawn.",
        "Look at those flowers shining — you know, with bright colours.",
        "It was a very peaceful evening.",
        "The blue of the sky was intense.",
        "It was a beautiful bird — its beak was red, and its tail was green.",
        "There was a cool breeze from the mountains.",
        "It was pleasant in the shade of the big tree.",
        "There was a column of smoke going straight up on the hills.",
        "It was very quiet by the river.",
        "There were jasmines in bloom.",
        "The whole garden — it looked like an enchanted place.",
        "The plants were beginning to bloom with red flowers.",
        "There were rows of carefully-planted palm trees.",
        "The leaves were covered with fine, red dust.",
        "The birds have settled down for the night.",
        "They were resting in the cool shade of the tree.",
        "The sun was very clear in the sky.",
        "There were butterflies hovering about the roses.",
        "The horizon was clear.",
        "The trees and bushes were intensely green.",
        "There was an open market on the roadside.",
        "The worms were the same colour as the tender leaves.",
        "The leaves were dark green.",
        "There was a stream of cool, fresh water among the bushes.",
        "The air was completely still.",
        "There were green trees on both sides of the road.",
        "The sun had just set, and we stood there watching the glow — the golden glow.",
        "The creepers grew on that wall.",
        "The sea was very calm.",
        "The rabbit came out from the thick bushes.",
        "There were a few birds perching among the rose bushes.",
        "There was a little stream — flowing under the stone bridge.",
        "There was a sparkle in the sea.",
        "It was a lovely place — rich and enchanting.",
        "It had been raining all night long, and now it was slowly clearing up.",
        "The sun was now a huge ball — a huge golden ball above the hills.",
        "The river was swollen.",
        "I sat there, listening to the hum of the bees.",
        "The rose bushes were covered with bright red roses.",
        "The trees and bushes were still, and they looked beautiful in the moonlight.",
        "The shadows were clear and sharp.",
        "The sun was setting, and clouds were golden.",
        "It was a small, well-kept park.",
        "There was a smell of the rain on dry earth.",
        "Someone was playing the flute, and I could hear its notes in the distance.",
        "A few drops of rain fell.",
        "It was pleasant and peaceful by the stream.",
        "The sky was intensely blue.",
        "Frogs were making a loud noise.",
        "The woods extended for miles.",
        "The vegetables they sold looked wilted.",
        "Look at the hills across the lake.",
        "The light of the setting sun — the golden light — the river was full of it.",
        "The eagle was making wide circles in the sky.",
        "The trees were washed by the recent rains.",
        "Smoke was rising from the huts.",
        "The rain washed the leaves clean of the dust on them.",
        "There was a bird perching on a huge, jutting rock.",
        "The vineyard was rich and full.",
        "To the west, a storm was gathering.",
        "Enchanting beauty — you know, that’s what I saw everywhere.",
        "It had rained most of the morning, and everywhere there were running streams.",
        "The tree was full of fruit.",
        "She waters the grass morning and evening.",
        "The frogs were having a splendid time.",
        "Squirrels wandered in and out of the bushes.",
        "There was a circle of dampness around each bush.",
        "The place was full of movement and bustle.",
        "We could see a few cows grazing in the meadow.",
        "There was a long, wide bend in the river at that point.",
        "After the rain, the hill was sparkling in the sun.",
        "The rain was still coming down, and the crows were soaked.",
        "It was pleasant in the moonlight.",
        "A bird called from somewhere nearby.",
        "It was very cool under the trees.",
        "There was water running in the sandy beds, and it made a pleasant noise.",
        "The clouds seemed alive.",
        "The village on the other bank of the river hadn’t been awake yet.",
        "There were low bushes among the rocks.",
        "There was a gentle breeze, and it was stirring among the corn.",
        "The water in the lake was still and clear.",
        "There was a scent in the air — a scent of jasmine.",
        "The morning sun was upon the white clouds.",
        "The water ran down the hill, and it made a pleasant noise.",
        "The waves were coming in very gently.",
        "The trees along the bank of the river reflected on the water."
    ]
}