{
    " Group 1 ": [
        "Whenever anybody laughs at him, he feels angry, and shows it.",
        "He’s a balanced person, and he makes sensible decisions.",
        "He’s a man of good character.",
        "He’s very harsh and rude, and most people here dislike him.",
        "He can get on with almost anyone.",
        "When somebody criticizes his work, he gets anxious and defensive.",
        "He’s a person who makes life fun.",
        "He likes going out a lot.",
        "He often loses his temper, but calms down quickly.",
        "He’s quiet and reserved.",
        "He never turns to friends when he has a problem.",
        "He’s very friendly and likes meeting people and talking to people.",
        "He often does things without thinking, and gets into trouble.",
        "When he feels angry, he expresses it directly.",
        "She worries too long over humiliating experiences.",
        "He’s very cruel, and shows no concern for other people or their feelings.",
        "People here have a poor image of him.",
        "He always watches the clock when he’s working.",
        "He’s a nervous person.",
        "If his friends say anything insulting, he’d break off the friendship.",
        "He behaves well and generously towards other people.",
        "He’s always willing to consider new ideas and suggestions.",
        "He finds it difficult to break out of a familiar routine.",
        "When he’s ill in bed, he likes to be fussed over.",
        "She feels ill at ease with strangers.",
        "He’s a very toughminded person.",
        "He’s very daring, and he’s willing to take risks and try new methods.",
        "She has a strong desire to better herself.",
        "He doesn’t enjoy conversation.",
        "He always plans things well ahead of time.",
        "He has a lot of leadership qualities.",
        "He has intelligence/determination.",
        "He has strong opinions and refuses to accept that he may be wrong.",
        "She has a kind of instinct for knowing when her friends are having problems.",
        "He’s very active and always on the go.",
        "He’s a carefree person.",
        "He’s a rather restrained type of personality.",
        "He finds it difficult to forget the things he’s done wrong.",
        "He often worries about his work.",
        "He often finds it difficult to get into conversation with strangers.",
        "She’s pleasant and easy to like.",
        "He’s good-looking, but he doesn’t have much personality.",
        "He likes to live alone, and deliberately avoids other people.",
        "He’s an aggressive, pushy person and he’s determined to get things done quickly.",
        "She often judges people by the way they look.",
        "He’s troubled with feelings of inferiority.",
        "He’s an aggressive person and is always ready to attack other people.",
        "He’s an even-tempered person.",
        "He isn’t happy in his job.",
        "He doesn’t enjoy entertaining people.",
        "He’s more energetic and determined than most people.",
        "He’s a sensible person.",
        "She’s pleasant/lively company.",
        "In general, he’s very/ reasonably competent.",
        "He’s often off work through sickness.",
        "She has an artistic personality.",
        "Do you feel sure of your own abilities?",
        "He tends to let things slide.",
        "He can express himself well in writing.",
        "People sometimes take advantage of me.",
        "He has a strong and assertive personality.",
        "He worries a lot over things that might happen.",
        "He does things without properly considering their consequences.",
        "He’s quiet and rather dignified, but a bit dull.",
        "He always stands up for his rights.",
        "She isn’t happy in her neighbourhood.",
        "He often feels miserable.",
        "He cuts off contact with friends when they try to take advantage of him.",
        "He’s very light-hearted and casual about things that most people take seriously.",
        "He likes work that involves thought and study.",
        "He finds himself ill at ease when he’s drawn into conversation.",
        "He prefers to work in close contact with lots of people.",
        "He can handle difficult situations with tact.",
        "Once he decides to do something, he won’t let anything stop you.",
        "He’s highly productive.",
        "He dislikes the idea of a holiday.",
        "He has a very forceful personality.",
        "He likes taking a day off from work now and then just to have fun.",
        "He’s as happy as the next person.",
        "He’s too proud of his abilities/achievements.",
        "She never misses a chance to talk to a friend.",
        "He’s very career-minded.",
        "Life seems to him to be too much effort.",
        "He’s never had a nervous breakdown.",
        "He has a weakness for alcohol.",
        "He doesn’t accept opinions that are different from his own.",
        "He has lots of personality.",
        "He deliberately avoids the company of others.",
        "He’s often poor company.",
        "He’s a quiet, withdrawn type.",
        "I sometimes feel confident, sometimes nervous.",
        "She lacks self-confidence.",
        "He has an assertive personality.",
        "He’s selfless, and shows concern for the happiness and welfare of other people, rather than for himself.",
        "He’s a very determined type of person.",
        "He takes part in all activities with great energy and enthusiasm.",
        "Generally, he honours his commitments.",
        "He always thinks individually and in a different way from other people.",
        "He’s very strongly opposed to change and new ideas.",
        "He’s a lovable person.",
        "He often finds it difficult to behave naturally and to show his true feelings.",
        "He’s easily embarrassed in social situations.",
        "She’s rarely bored with her work.",
        "He prefers action to planning for action.",
        "He’s a peaceful person, and he avoids quarrelling/fighting with other people.",
        "I found him interesting and amusing, but I found his brother dull and uninteresting/boring.",
        "I like him very much — he’s quite a personality.",
        "She often exaggerates.",
        "He often stops to analyze his own thoughts and feelings.",
        "I don’t always decide things on logical grounds.",
        "He has his shortcomings/faults — but I like him.",
        "He often refuses invitations to parties outright.",
        "He has a strong/attractive character.",
        "She has a weak character.",
        "Whenever she buys things, she chooses them carefully.",
        "People usually seem to feel comfortable with him.",
        "I don’t think he’s a religious believer.",
        "She gets nervous in high places.",
        "He’s very balanced in his personality and behaviour.",
        "He isn’t aloof, but approachable.",
        "He isn’t confident about your ability.",
        "He won’t hesitate to hurt other people to get what he wants.",
        "He can communicate very easily with people.",
        "I found him very interesting.",
        "She’s highly/mildly superstitious.",
        "I often do things on the spur of the moment.",
        "He’s a strong supporter of the new economic policies.",
        "He has a kind, friendly personality.",
        "He has little knowledge or experience of how these things are done.",
        "He’s too active and somewhat pushy.",
        "He worries a great deal over money matters.",
        "She feels panicky and incapable most of the time.",
        "He doesn’t show much affection and would seem unfriendly and unsympathetic."
    ],
    " Group 2 ": [
        "He enjoys making social contacts.",
        "He’s pretty careful about saying negative things.",
        "I sometimes lose my confidence under stress.",
        "He doesn’t like people playing practical jokes on him.",
        "He never gives up or admits that he’s been defeated.",
        "He’s a nice person.",
        "He cares only about himself and not about other people.",
        "She’s scared of open spaces/high places/heights.",
        "He keeps changing his mind about what to do.",
        "He’s always troubled by aches and pains.",
        "He’s very clever and skilful at achieving what he wants, especially by deceiving other people.",
        "He often tells jokes and stories.",
        "He’s an upright man and can be trusted.",
        "He usually takes the initiative and rings up his friends.",
        "He has a likeable personality.",
        "He was very difficult and unreasonable.",
        "He has a good speaking voice.",
        "He often blames other people when something goes wrong.",
        "He often acts quickly and suddenly without being careful.",
        "He often suffers from loneliness.",
        "She likes and respects her colleagues.",
        "He’s very business-minded.",
        "He’s very impatient.",
        "He’s a very lively individual.",
        "He never keeps himself clean.",
        "He’s very active and outgoing.",
        "She has a wonderful voice.",
        "His family life is a very troubled and uncertain one.",
        "He likes to live each day as it comes along.",
        "He has strong moral principles.",
        "He never tries to imitate other people.",
        "He’s a practical sort of person.",
        "He’s so satisfied about his achievements that he doesn’t feel he needs to do anything more.",
        "He often argues for the sake of argument.",
        "He doesn’t talk about work with his family.",
        "Almost always, he’s in good humour.",
        "She feels selfconscious in the presence of strangers.",
        "He isn’t submissive, but assertive.",
        "He tends to interrupt people when they’re talking — that’s his only failing.",
        "She often has dreams that she’s being chased.",
        "He generally has a serious and responsible attitude towards everything.",
        "I sometimes buy things on impulse.",
        "He’s the artistic type.",
        "I don’t think he has the right qualities to be a leader.",
        "He’s a very dignified and charming person.",
        "He has a great sense of humour.",
        "He remains calm and untroubled even in situations that are disturbing.",
        "He isn’t easily persuaded by the arguments of other people.",
        "It upsets her when other people lose their temper.",
        "I’ve always found him sure in his actions.",
        "She always keeps her room clean.",
        "He’s good company.",
        "Sentimental films always move her to tears.",
        "He enjoys a good argument and keeps his cool.",
        "He often philosophizes.",
        "He has a weak character and lacks courage.",
        "She has a warm personality and is very friendly.",
        "She seems very pleased with how clever she is.",
        "He’s a warm and sympathetic person.",
        "He’s the sort of person who wants to know the logical reason for everything.",
        "She often feels disgruntled.",
        "He isn’t easily impressed by things.",
        "He’s lazy and, for him, most work is hard work.",
        "His ideas and plans are never firm or clear.",
        "He fights to get what he wants done.",
        "He knows his own strengths and weaknesses.",
        "He isn’t respectable/trustworthy.",
        "He’s an impulsive person.",
        "He’s tough and realistic, and he takes decisions on practical grounds, and not on emotional ones.",
        "He doesn’t flatter or criticize anybody.",
        "He sometimes feels in good humour and sometimes feels depressed.",
        "She never takes the initiative in making new friends.",
        "He’s very quick at learning things.",
        "He gets through a tremendous amount of work every day.",
        "Have you ever seen the cruel side of his character?",
        "He doesn’t get on well with women.",
        "He plans almost everything in his life.",
        "She always tries to please angry people.",
        "His anger is always quick and short.",
        "He enjoys being with other people.",
        "He worries a great deal about his health.",
        "He’s calm and reasonable, and he doesn’t have frequent changes of mood.",
        "When anybody plays a practical joke on her, she joins the laughter.",
        "He’s very touchy on various subjects.",
        "He’s carefree and cheerful.",
        "He hates physical violence.",
        "He’s always forthright in argument.",
        "He smokes cigarettes.",
        "He drinks alcohol.",
        "He finds ill at ease on the telephone.",
        "Most people tend to respect/like him.",
        "I sometimes suffer from feelings of guilt and remorse.",
        "He’s rather reserved and distant.",
        "He’s full of new and exciting ideas.",
        "He’s a man of great personality.",
        "He enjoys life and doesn’t worry about the future.",
        "She has no difficulty getting off to sleep.",
        "He’s an academically-minded person.",
        "He can express himself easily in speech.",
        "He’s often indifferent to his friends.",
        "He’s happiest when he’s working.",
        "I don’t think he would risk his reputation for anything/anybody.",
        "He often changes his interests.",
        "He has a clean reputation.",
        "He tends to get touchy if he’s beaten in a sport/game — that’s one of his failings.",
        "Her voice is smooth and gentle and very pleasant to listen to.",
        "She’s a bit self-indulgent of her own problems."
    ],
    " Group 3 ": [
        "He prefers to spend an evening reading a good book.",
        "He’s very modern and follows all the latest fashions in clothes/ ideas.",
        "He’s practical and doesn’t allow emotions to affect his decisions.",
        "When his feelings are hurt, he goes quiet.",
        "He’s normal/conventional in his opinions and in the way he lives.",
        "It worries him quite a lot if anybody teases him.",
        "She isn’t shy — she’s outgoing.",
        "His mind often wanders badly.",
        "He’s fully aware of his own shortcomings.",
        "He states his needs and opinions clearly.",
        "She never praises her friends.",
        "He would work hard for success, rather than daydream about it.",
        "She finds it difficult to get on with men.",
        "He makes friends easily.",
        "He feels he has a lot to offer in his work.",
        "He never plays pranks on other people.",
        "He isn’t easily annoyed/worried/upset.",
        "He likes lots of excitement in his life.",
        "He’s easily influenced and controlled by other people.",
        "He’s capable of a high level of steady work.",
        "He rarely talks about himself.",
        "He’s often bubbling over with energy/enthusiasm.",
        "He doesn’t use his talents well.",
        "He’s always on time for appointments.",
        "He’s very difficult to please and will only buy something if it’s of very high quality.",
        "He hates the idea of fighting physically with another person.",
        "He’s always busy and active.",
        "He generally feels in good spirits.",
        "She shows self-control and patience when other people would be upset and angry.",
        "He’s reliable and responsible.",
        "He always puts his family before his social life.",
        "Generally, he tries to avoid a confrontation.",
        "He worries a lot about his health.",
        "I saw their President once when he came to visit India.",
        "He was dignified and impressive.",
        "If someone does a bad turn, he won’t let it pass.",
        "He’s a good conversationalist.",
        "He’s always relaxed in the company of other people.",
        "The most important thing in his life is his work.",
        "He’s irresponsible and careless.",
        "She thinks only of herself and her wants, and doesn’t consider other people.",
        "He has a strong and lively character.",
        "She has a pleasant character.",
        "He frequently gets involved in arguments.",
        "She isn’t very hopeful about her future.",
        "He laughs louder than most people.",
        "He’s no longer powerful/important.",
        "She’s 20, but is still scared of the dark.",
        "When he’s in conversation with someone, he’s frequently lost in thought.",
        "She tends to end up buying things she doesn’t really need.",
        "Basically, he’s quite a happy person.",
        "She suffers from inferiority feelings.",
        "He’s a good-natured person.",
        "He’s not too active or busy, but simply a normal person.",
        "He’s reliable and can be trusted completely.",
        "Fast cars appeal to him a lot.",
        "He often talks/walks in his sleep.",
        "He often has nightmares.",
        "Actually, his weaknesses make him more likeable.",
        "She’s shy and is easily embarrassed.",
        "She prefers to spend time alone rather than with friends.",
        "He usually comes to quick decisions.",
        "He’s a tactful person.",
        "He always tries to get his own way.",
        "He thinks he’s very important and valuable.",
        "He never says things without stopping to think.",
        "He pays too much attention to small and unimportant details.",
        "He leads an active social life.",
        "When he makes up his mind, he’s firm about it.",
        "His mind often wanders while he’s trying to concentrate.",
        "She always looks very sad.",
        "He’s too ready to believe what people tell him and is easily deceived.",
        "He never makes negative comments to anybody.",
        "He’s very/mildly ambitious.",
        "He often needs somebody to cheer him up.",
        "Normally, he doesn’t feel defensive when anybody criticizes him.",
        "He lacks determination and is unable to do anything properly.",
        "He thinks of himself as a failure.",
        "He seems very pleased with how fortunate he is.",
        "She daydreams a lot.",
        "He doesn’t like to engage in rough physical activity.",
        "He’s pretty optimistic about things most of the time.",
        "She worries a lot over misfortunes.",
        "He has a keen sense of humour.",
        "He’s not easily excited/worried by things.",
        "He finds it difficult to make friends.",
        "He enjoys spending long periods of time by himself.",
        "He often has dreams about finding money/falling.",
        "He wants to keep clear of all responsibilities.",
        "He’s a bit of a dreamer, and he puts off taking action.",
        "He has a strong personality.",
        "She behaves selfishly, and believes herself to be more important than other people.",
        "He stays calm and doesn’t get annoyed when things take a long time.",
        "She has frequent ups and downs in mood.",
        "He’s the sort of person who deliberately seeks out trouble.",
        "When he gets angry, he makes a scene.",
        "He’s an evil-minded person.",
        "He deals with things very cleverly.",
        "He becomes restless when he has to wait for somebody.",
        "He’s incompetent and can’t do his job properly.",
        "He tends to spend lavishly.",
        "He’s very upright in his business dealings, and I don’t think he’ll do anything dishonest.",
        "She can sing in tune.",
        "He’s often troubled by feelings of guilt.",
        "He’s incompetent and can’t do anything properly.",
        "He’s difficult to talk to and not very friendly.",
        "He often finds it hard to shake off hurt and resentment.",
        "He has a strong desire to be an important person in the community.",
        "He always says the future looks pretty black to him.",
        "He’s an irritable person, and he gets angry easily.",
        "He always talks too proudly about things he’s done.",
        "He tends to be talkative.",
        "It takes him a long time to get started on something.",
        "He tends to find it difficult to make decisions.",
        "He takes life as it comes.",
        "His ideas and plans change to suit new circumstances/conditions.",
        "He keeps his friends for years.",
        "He gives his opinions about things openly and honestly.",
        "He’s inclined to be moody.",
        "He always does the appropriate thing in a social situation.",
        "He fights hard to get what he wants.",
        "He likes to have time to be alone with his thoughts.",
        "He can tackle any problem calmly.",
        "He’s very difficult to please, and will only accept something if it’s exactly what he wants.",
        "She finds spiders/snakes/blood/crowds frightening.",
        "He often feels he’s inadequate in his work.",
        "She often blushes.",
        "He’s willing to try out new and unusual ways of doing things."
    ]
}