{
    "key": [
        "A less centralized government would be a weak government, I think.",
        "All this is against communist teachings and practices.",
        "An alliance between the opposition parties can certainly change the government.",
        "Are you planning to stand for Parliament?",
        "Did you vote in/at this election?",
        "Do the ideas of socialists and communists differ very much?",
        "Do you expect a heavy poll this time?",
        "Do you think the electorate are fools?",
        "Don’t ask me who I voted for.",
        "Don’t fail to vote.",
        "Don’t you think party politics is actually a divisive evil?",
        "Have they announced the winning candidate?",
        "He argued against socialism.",
        "He came here yesterday to canvass votes.",
        "He dealt with the crisis with real statesmanship.",
        "He doesn’t want to involve himself in local politics.",
        "He follows Marxist ideology.",
        "He has left his party and has joined another.",
        "He has never been defeated at the polls.",
        "He has never taken part in politics.",
        "He has strong socialist ties.",
        "He voted left.",
        "He was a great statesman of the time.",
        "He was our Home Minister, and he used to support moderate views.",
        "He won by a majority of 15, 000.",
        "He’s a conservative politician.",
        "He’s a former Secretary of State, and he’s running for President.",
        "He’s a hardliner, and his political opinions are extreme.",
        "He’s a liberal politician.",
        "He’s a member of our party.",
        "He’s a politician with centrist views.",
        "He’s a well-known politician.",
        "He’s against the capitalist system and way of life.",
        "He’s anti-fascist.",
        "He’s been a communist since childhood.",
        "He’s been struggling all his life for workers’ rights.",
        "He’s campaigning for the privatization of those industries.",
        "He’s going to be our party’s candidate.",
        "He’s planning to retire from politics.",
        "He’s pro-left in his views.",
        "He’s pro-revolution.",
        "He’s the leader of the opposition.",
        "He’s very active in student politics.",
        "He’s very left-wing in these matters.",
        "He’s well to the left on most subjects.",
        "He’s well to the right on most of these issues.",
        "He’s with the left wing of the party.",
        "Her son is aiming for a political career.",
        "Her son is thinking of going into politics.",
        "Here’s a party that stands only for keeping things as they are.",
        "His only interest is international politics.",
        "His party is likely to win this election.",
        "His politics are well to the left of centre.",
        "His popularity seems to have declined.",
        "How many votes did these candidates poll?",
        "I think the new party wants to avoid extremism.",
        "I voted against him.",
        "I wonder how long this government could survive.",
        "If only these political parties showed moderation and a sense of responsibility!",
        "If you want them to vote you in at the next election, you must do something for them now.",
        "In a way, nationalism is the major cause of most wars.",
        "Is he a strong candidate?",
        "It was not a statesmanlike decision.",
        "Local politics doesn’t interest him.",
        "Look at those people. They’re going to the polls.",
        "Many of them are politically moderate.",
        "Most MPs seem to be in favour of the new law.",
        "Most of them are not going to cast their votes.",
        "Most of them are on the left-wing of the party.",
        "Most people are cynical about politics.",
        "None of those parties favour social democracy.",
        "One candidate has polled 40% of the votes.",
        "Only national politics interest him.",
        "Our MP has resigned, and there will soon be a by-election.",
        "Our party demands social equality.",
        "Our party favours less state control.",
        "She voted for them.",
        "She’s standing against him in this election.",
        "She’s very right-wing/ left-wing in these matters.",
        "Social care of the people by the state — that’s what our party stands mainly for.",
        "Some of these are communist ideas.",
        "That’s a party divided by faction and intrigue.",
        "That’s an effective way of preventing dictatorship.",
        "The alliance of socialists and communists may field more than 200 candidates.",
        "The election campaign has already begun.",
        "The election results will be known in an hour or so.",
        "The government is going to be defeated in the next election.",
        "The government is going to be voted out this election.",
        "The main opposition parties are against this move.",
        "The new government is planning to bring in several reforms.",
        "The new party favours middle-of-the-road political views.",
        "The party is divided on how to deal with the situation.",
        "The party is going to split down the middle.",
        "The party is split on the issue.",
        "The party tries to stick to radical views and opinions.",
        "The people are going to elect us/our party.",
        "The people have started rising against the new government.",
        "The people will soon start revolting against the government.",
        "The Prime Minister can’t ignore the protests from the opposition.",
        "The right-wing of the party is against all changes.",
        "Their economic policies have not been a success.",
        "Their party favours greater personal freedom.",
        "Their party favours state ownership of most of the important industries.",
        "Their party has been losing support in the polls recently.",
        "Their party has broken into two factions.",
        "Their party is planning to resist the reforms.",
        "Their party is in opposition now.",
        "Their party is neither left nor right.",
        "Their party is neither part of the government nor in parliament.",
        "Their party lost the last election.",
        "Their party seems to have given up its centrist policies.",
        "Their political views are fairly middle-of-the-road.",
        "Theirs is a minor political party with extremist views.",
        "There have been several demonstrations against the government recently.",
        "There will be only a light poll this time.",
        "These are political matters.",
        "These are some of the principles our party favours.",
        "They counted the ballots/ballot papers once again by hand.",
        "They have radical views on this issue, and they’re asking for complete and thorough political change.",
        "They represent socialists.",
        "They want most of the industries under state ownership.",
        "They’re conservatives, and they want things to stay pretty much as they are.",
        "They’re fascists, and they don’t favour any political change.",
        "They’re middle-of-the road politicians, and their views are not extreme.",
        "They’re moderates, and they have no extreme views.",
        "They’re our voting public.",
        "They’re planning to reform the electoral system.",
        "They’re reactionaries, and they’ve been preventing changes.",
        "They’re trying to defend the political position of their party.",
        "They’ve been trying to prevent a split in the party.",
        "They’ve begun to count the votes.",
        "They’ve won a convincing victory in the elections.",
        "This election is certainly going to be a test of the public’s confidence in the government.",
        "This idea has been a powerful force in Indian politics.",
        "This is a clear mandate to the government to continue the reforms.",
        "This is a national movement, and it’s gaining strength day by day.",
        "This is nothing but the old colonial system developing in a slightly different form.",
        "This situation is nothing but political anarchy — nobody is paying attention to rules or laws.",
        "Use your vote wisely.",
        "We want to keep the society as free as possible.",
        "We’re against extremism in politics.",
        "What a lot of changes have been introduced by this government in a short time!",
        "What a lot of political changes have happened in a short time!",
        "What are the principles of your party?",
        "When are they going to gain real political freedom?",
        "When is the general election going to be?",
        "Why are most public affairs mishandled like this?",
        "Why does the party want the banking sector nationalized?",
        "You have the power to vote. Use it wisely.",
        "You’ve been elected by us, and you must act according to our wishes.",
        "I feel your party has become too radical."
    ]
}