{
    "Group 1": [
        "X: Will they be angry with me? + Y: I think so, yes.",
        "X: Have they left the office? + Y: No, I don’t think so.",
        "X: Won’t he be busy now? + Y: Yes, I think so.",
        "X: What does it cost? + Y: Let’s find out.",
        "X: Will she come here today? + Y: Yes, she will.",
        "X: When does she go to bed everyday? + Y: Quite early.",
        "X: How does it concern you? + Y: It doesn’t.",
        "X: Aren’t you the daughter of our Principal? + Y: Yes, I am.",
        "X: Did he bring the books? ~ Y: Yes, he did.",
        "X: Has she managed to get a camera? + Y: Yes, she has.",
        "X: What were they telling you? + Y: Nothing. Nothing important anyway.",
        "X: Should we be punctual? + Y: You had better.",
        "X: Can you come a little early? + Y: I’m sorry, I can’t.",
        "X: Why did they leave so early? + Y: I have no idea.",
        "X: How far will this train go? + Y: As far as Hyderabad.",
        "X: Hasn’t he been away on a tour? + Y: Yes, he has.",
        "X: Why can’t he come here more often? + Y: I’m afraid I don’t know.",
        "X: What did you do that for? + Y: Just to scare the children.",
        "X: Who did I talk to yesterday? + Y: To me.",
        "X: Can they be a little more strict with the children? + Y: I’ll ask them.",
        "X: Why did David borrow money? + Y: I don’t know. Please tell me.",
        "X: What is the name of the baby? + Y: We’ll have to ask someone.",
        "X: Wasn’t she a little rude to him? + Y: Yes, she was.",
        "X: Would you like to have a cup of tea? + Y: No, thank you.",
        "X: Can they come here right over? + Y: No, they can’t.",
        "X: What can it be used for? ~ Y: For washing clothes.",
        "X: What did you have for breakfast? ~ Y: Nothing much.",
        "X: Will they be asking for the payment? + Y: No, they won’t.",
        "X: What was he doing there? + Y: Eating food.",
        "X: When do they have breakfast everyday? + Y: You’ll have to ask them.",
        "X: Should he be experienced in your line? + Y: Yes, he should.",
        "X: What vegetable do we get most protein from? ~ Y: I don’t quite know.",
        "X: Have you a match to light a cigarette? + Y: No, I haven’t.",
        "X: Were they waiting for long? + Y: Yes, they were.",
        "X: What are you doing for your headache? + Y: I’m taking tablets.",
        "X: Has Simon been sleeping long? + Y: Yes, he has.",
        "X: How much should I pay for these fruits? + Y: Ten rupees altogether.",
        "X: Which one do you prefer — the red one or the yellow one? + Y: Neither.",
        "X: Who’s that man standing there? + Y: I’m not sure who he is.",
        "X: Do you know what the punishment for late-coming is? + Y: I really wonder what.",
        "X: How often does he go for films? + Y: Not very often.",
        "X: What is the best way to the zoo? + Y: I’m out of this place myself.",
        "X: Are your friends going home this weekend? + Y: No, They aren’t.",
        "X: Is there a restaurant anywhere near here? + Y: There’s one a kilometre to the south.",
        "X: What road is the hotel on? + Y: I don’t know what road.",
        "X: Did it take him long to get back? + Y: No, not very long.",
        "X: Weren’t you supposed to send a report? + Y: Sorry, I didn’t know that.",
        "X: Why did you have to leave so early? + Y: Because I had some private work to do.",
        "X: What size shoes does he wear? + Y: I’m afraid I don’t know.",
        "X: Haven’t you heard what happened? + Y: No, what did happen?",
        "X: What should they have done to escape punishment? + Y: Ask someone else.",
        "X: What has he been complaining to you about? + Y: About the way those boxes were unloaded from the trucks.",
        "X: Does he have to put in a written complaint? + Y: No, he doesn’t.",
        "X: What sort of a trick did he play? + Y: A nasty trick.",
        "X: How long is the journey from here to Chicago? + Y: Just about ten hours.",
        "X: Does John usually carry your bags? ~ Y: No, he doesn’t.",
        "X: How much are these oranges? + Y: Ten rupees a dozen. X: Did you have trouble finding this address? + Y: Just a little.",
        "X: Why didn’t she marry him? + Y: No one can explain.",
        "X: Which one are you going to select? + Y: I can’t decide.",
        "X: What do I have to do to help him? + Y: I really can’t say.",
        "X: Who did he meet there? + Y: I’m sorry I didn’t hear you.",
        "X: Are there any samples left? + Y: No, no more samples.",
        "X: Will there be any deduction? + Y: Sorry, there won’t be.",
        "X: Which one did they like best? + Y: I can’t tell.",
        "X: Isn’t he showing off too much lately? + Y: I think so, too.",
        "X: Have you ever seen a better film? + Y: It’s difficult to say.",
        "X: Why weren’t you getting her the things she wanted? + Y: You’d like to know, wouldn’t you?",
        "X: Does he get up early? + Y: Yes, he does.",
        "X: Couldn’t he be doing this just to fool you? + Y: Yes, he could.",
        "X: Weren’t you well yesterday? + Y: No, I wasn’t.",
        "X: Which will you give me — the one in the right hand or the one in the left hand? ~ Y: The one in the left hand.",
        "X: Should I be more strict with the children? + Y: Yes, you should.",
        "X: Has John come back from the office? + Y: I hope so.",
        "X: Why should she get upset over such a minor thing? + Y: I wonder why.",
        "X: How much did you pay for the bag? + Y: I don’t remember.",
        "X: Were father and mother here yesterday? + Y: Yes, they were.",
        "X: Are all the staff in the office against you? + Y: No, only a few of them.",
        "X: What time do you get up in the morning? + Y: Sometimes quite early, and sometimes quite late.",
        "X: Do you want to come with me? + Y: No, thank you.",
        "X: Could they be planning to strike work tomorrow? + Y: I’m afraid they could be.",
        "X: What did she pick up from there? + Y: We know what.",
        "X: What do you plan to do during the summer holidays? + Y: I haven’t decided yet.",
        "X: Do we have time for coffee before the film begins? + Y: I’m afraid not.",
        "X: What will it look like if nobody goes for the party? + Y: He’ll think everyone has ganged up against him.",
        "X: Have your father and mother been away long? + Y: Not very long.",
        "X: Where will they stay if they come? + Y: With you; where else?",
        "X: How did he do in the last examination? + Y: Quite well.",
        "X: Where have they been all these days? + Y: They alone know where.",
        "X: Do Mary and Minu have raincoats? + Y: Who knows!",
        "X: Did you like the film? + Y: No, I didn’t.",
        "X: How soon will the rains come? + Y: In a month or two.",
        "X: Who did they laugh at? + Y: I don’t know who.",
        "X: Why wasn’t anyone friendly with him? + Y: Because he was rude.",
        "X: Can I show you a trick? + Y: What trick?",
        "X: Should the man be asked to go away? + Y: You decide.",
        "X: What should it cost according to you? + Y: Far less.",
        "X: Haven’t you been going there frequently? + Y: Yes, I have.",
        "X: Which one of these is the best? + Y: The one lying on the top.",
        "X: Can you tell me how I can get to this address? + Y: Ask someone else, please.",
        "X: Who is the officer-in-charge here? + Y: The one who is sitting there.",
        "X: Didn’t I warn you not to fight with him? + Y: You did.",
        "X: How can I start this engine? + Y: Press this button.",
        "X: Do you often come here? + Y: No, only seldom.",
        "X: Are short people taken in the army? + Y: I don’t quite know.",
        "X: Will Mary and you be at the party today? + Y: Can’t say.",
        "X: Where do you get vegetables from? + Y: From the market.",
        "X: How large is your bedroom? ~ Y: Not very large.",
        "X: Should she be where others would see her or behind the curtain? + Y: Behind the curtain.",
        "X: How much will it cost to have this shoe mended? + Y: Fifty rupees.",
        "X: What did he do when the plane landed? + Y: I wasn’t there.",
        "X: Don’t you care for mutton chops? + Y: No, I don’t.",
        "X: How long ago did his grandfather die? + Y: I don’t know exactly.",
        "X: How old are you? + Y: Twenty years.",
        "X: Who is this little boy with you? + Y: My nephew.",
        "X: Where has Priya been studying all these years? + Y: Somewhere outside.",
        "X: Have you and your friends taken exercise today? + Y: Yes, we have.",
        "X: Do you have to take a lot of exercise to keep fit? + Y: Yes, they say so.",
        "X: How far is Calcutta from here? + Y: Very far.",
        "X: How often are there trains to Calcutta? + Y: Everyday, there’s a train.",
        "X: Can I show you some magic? + Y: That’d be fine.",
        "X: Isn’t it wonderful to have such good friends? + Y: Really it is.",
        "X: How will you get to the station from here? + Y: I’ll get a taxi, I guess.",
        "X: Where are you staying tonight? + Y: In a hotel.",
        "X: Have you ever been to this place before now? + Y: No, this is the first time.",
        "X: Are you a salesman? + Y: No.",
        "X: Could you spare some money for a week? + Y: I’m indeed sorry.",
        "X: Do you want anything else? + Y: No. These are about all, I guess.",
        "X: What did he want? + Y: You know it, don’t you?",
        "X: Have you got a few minutes to spare? + Y: Certainly, please come in.",
        "X: Are you going to the cinema? + Y: No. Not really.",
        "X: Who will be the Home Secretary next? + Y: Who knows!.",
        "X: Has Dad ever scolded him? + Y: No. That’s the trouble.",
        "X: Do you like being scolded? + Y: No, of course not.",
        "X: Did she have to give him a beating? + Y: No. He told the truth when he got a good scolding. X: Did he have to pay for the seat? + Y: It doesn’t seem so.",
        "X: Did Gita have to take a plane to reach there early? + Y: It looks like it.",
        "X: How many students are there in your school? + Y: I’m not sure just how many.",
        "X: Hasn’t he repaid the loan? + Y: He probably has.",
        "X: What places have you visited so far? + Y: Just a few.",
        "X: Did your brother bring you any present? ~ Y: Yes, he did.",
        "X: How much did you draw from the bank? ~ Y: You’d like to know, wouldn’t you?",
        "X: Do you prefer tea with sugar or without? + Y: With sugar, and plenty of it.",
        "X: Are you sure today is Thursday? + Y: Well, the calendar says so.",
        "X: How old is your father? + Y: Not very old.",
        "X: Did you have a nice time at the party? + Y: Yes, I had a wonderful time.",
        "X: Do you often go to restaurants? + Y: Not often, but on occasion.",
        "X: When should she serve coffee? + Y: A little later.",
        "X: Did it take him long to come back from the shop? + Y: Yes it did. I was wondering what kept him so long.",
        "X: Why weren’t you angry with him? + Y: Because it’d do no good.",
        "X: Can you tell me all these things in French? + Y: I’ll try to.",
        "X: What time does he leave for the office? + Y: By about eight.",
        "X: Have you ever been to the department store? + Y: Yes, why?",
        "X: Did the workers strike work today? + Y: No. The dispute was settled yesterday.",
        "X: What is wrong with this report? + Y: Everything. Take a look at it.",
        "X: Doesn’t Mary come here any more? + Y: No, she doesn’t.",
        "X: Would you like to go for a film? + Y: That’d be fine.",
        "X: How was the film? + Y: Not very good.",
        "X: Do you think we’ll be late for the film? + Y: No, there’s plenty of time.",
        "X: Does he always find fault with everything you do? + Y: Yes, he does.",
        "X: Hadn’t we better stay away from that area? + Y: Yes, we had. It’s quite unsafe.",
        "X: Who did she go to the park with? + Y: With a friend of hers.",
        "X: What are they supposed to do when a customer comes in? + Y: Give him service.",
        "X: How long ago did he borrow the money from you? + Y: Five or six months ago.",
        "X: Are you having a headache? + Y: Yes, I am.",
        "X: What hotel is the best hotel here? + Y: That’s difficult to say.",
        "X: What school is nearer to her house? + Y: I don’t remember its name.",
        "X: What experience do you have in keeping accounts? ~ Y: I do not have much experience.",
        "X: What different people have you talked with? + Y: People from different walks of life.",
        "X: What manner should the reception be arranged in? + Y: In the best possible manner.",
        "X: Do you find that your work is easy? + Y: Not quite.",
        "X: What different materials are these things made out of? + Y: We can’t tell you that.",
        "X: Do you feel that life is difficult in a city? + Y: No.",
        "X: Is it more expensive to send this parcel registered mail? + Y: Yes, it’s.",
        "X: What date is the marriage on? + Y: I am not quite sure.",
        "X: What place has he taken the car to? + Y: To a distant place.",
        "X: What other work besides cooking does she do? + Y: Washing.",
        "X: What famous places are there in this city? + Y: I’m afraid you’d have to ask someone else.",
        "X: What material is this cloth made of? + Y: Nylon, I think.",
        "X: Who did you get the news from? + Y: What news?",
        "X: Isn’t she a talkative girl? + Y: Yes, she is.",
        "X: What happened when it started raining? + Y: The game was put off.",
        "X: What things did your father bring this time? + Y: A lot of things.",
        "X: How far is your house from here? + Y: About a kilometre and a half.",
        "X: Do you know anybody here? + Y: No, I’m new to this place.",
        "X: Does he ever shout at you? + Y: No. Never.",
        "X: Does it ever snow here? + Y: No.",
        "X: Do they ever charge you too much for minor repairs? + Y: I can’t say.",
        "X: Who are the partners in your business? + Y: Ours is not a partnership business.",
        "X: What are you going to do to cut down your expenses? + Y: I haven’t decided yet.",
        "X: What questions did they ask you at the interview? + Y: Very many questions.",
        "X: What place have you been getting your supplies from? + Y: That is difficult to say.",
        "X: What interest do the banks charge for personal loans? + Y: It varies.",
        "X: What different colours does this cloth come in? + Y: Blue and green.",
        "X: Is it very painful to shave with an old blade? + Y: Yes, it is.",
        "X: What salary do you get? + Y: Not much to speak of.",
        "X: Is it less expensive to stitch clothes in this shop? + Y: Yes, it is.",
        "X: Do most of them smoke? + Y: Yes, most of them do.",
        "X: What different places have you visited so far? + Y: Only the beach and the museum.",
        "X: What other places do you have relations here? + Y: In a few more places.",
        "X: What purpose does the piston serve in a scooter? + Y: Who knows all these things!",
        "X: What different occasions do you put new clothes on? + Y: On several occasions.",
        "X: What type of work was he doing there? + Y: Whatever he would be asked to do.",
        "X: What brand of tea do you use? + Y: Who cares for the brand and all!",
        "X: What else besides medicines is needed to get well? + Y: Long rest.",
        "X: Do a number of people come here everyday? + Y: Yes, a lot of people do.",
        "X: What fruits are there in that shop? + Y: Several kinds.",
        "X: What other kinds of vegetables do you have? + Y: These are the only kinds.",
        "X: What year will he be going to college? + Y: There’s plenty of time for that.",
        "X: What number did you dial? + Y: Why do you want to know all these things?",
        "X: What questions did the prosecutor ask you? + Y: Only the ones I had expected.",
        "X: What is meant by “soporific”? + Y: My God! That is beyond me.",
        "X: What colour shirt did he choose? + Y: Light blue.",
        "X: Does it cost very much to travel first class? + Y: Yes, it certainly does.",
        "X: What different types of machines are there here? + Y: Many different types.",
        "X: Has he finished his studies for the day? + Y: Yes, he has.",
        "X: Will she be late today? + Y: Yes, she will.",
        "X: Can she unlock the door? + Y: No, she can’t.",
        "X: I’m going for a film + Y: I am, too.",
        "X: Should he repair the radio himself? + Y: No, he shouldn’t.",
        "X: Was he right in paying back the money? + Y: Not quite.",
        "X: Can he lift that heavy box? + Y: Yes, he can.",
        "X: Will Dad be bringing some sweets? + Y: I hope so.",
        "X: Is he a musician? + Y: No, he isn’t.",
        "X: Will he be speaking on for a long time? + Y: I hope not.",
        "X: Where should he look for the key? + Y: He knows where.",
        "X: Must he take all these medicines? + Y: Yes, he must.",
        "X: They’ve got a Dobermann. + Y: We have, too.",
        "X: How are you? + Y: Fine, thanks.",
        "X: Are you a student in this college? + Y: Yes, I am.",
        "X: Will he take long to come? + Y: Yes, he will.",
        "X: We’re going for a film tomorrow. + Y: So are they.",
        "X: How long has he been gone? ~ Y: Not very long.",
        "X: Is he a stuck-up person? + Y: No, he isn’t.",
        "X: I have no time to play with him. + Y: Neither have I.",
        "X: Did he get up early today? + Y: No, he didn’t.",
        "X: Are they very rich? + Y: No, they aren’t.",
        "X: Do we have to make the payment right now? + Y: No, we don’t.",
        "X: I am from Boston. + Y: So am I.",
        "X: Do you care very much for me? + Y: Of course, I do.",
        "X: Will he be bringing presents? + Y: I am afraid, not.",
        "X: Did she let you take her umbrella? + Y: Yes, she did.",
        "X: Do you mind if I use your pen for a few minutes? + Y: Not at all.",
        "X: We went to the beach yesterday. + Y: We did, too.",
        "X: How many children does your boss have? + Y: I have no idea.",
        "X: We have a dog at home. + Y: So have we.",
        "X: I can climb to the top of any tree. + Y: We can, too.",
        "X: Did you want to pull down the fence? ~ Y: Not really.",
        "X: Are these fruits ripe enough to eat? + Y: No, they aren’t.",
        "X: We didn’t listen to the radio yesterday. + Y: We didn’t either.",
        "X: Can you loosen this nut please? + Y: I’ll try to.",
        "X: Has he done the repairs properly? + Y: Yes, very well.",
        "X: I won’t be here tomorrow. + Y: Neither will John.",
        "X: Does he have to ask your permission to go out? + Y: No, he doesn’t.",
        "X: I don’t believe the things he said. + Y: I don’t, either.",
        "X: Has he answered the questions correctly? + Y: Yes, he has.",
        "X: Were there many people at the cinema? + Y: Not very many.",
        "X: Does she care very much for him? + Y: Yes, she does.",
        "X: You shouldn’t fight with him any more. + Y: Neither should he.",
        "X: Do you know Spanish very well? + Y: Not very well.",
        "X: Would she mind if I pick these flowers? + Y: Yes, she would.",
        "X: I didn’t enjoy the game at all. + Y: Neither did I.",
        "X: How will she make tea? + Y: She knows how.",
        "X: Do you know how to speak French? + Y: Only a little.",
        "X: Does this car run on diesel? + Y: Yes, it does.",
        "X: I haven’t put in an application for the ration card so far. + Y: Neither has she.",
        "X: Does he earn much money? + Y: Not much.",
        "X: Will she cause problems? + Y: No, she won’t.",
        "X: I like dark colour clothes very much + Y: So does Mary.",
        "X: Has he a bank account? + Y: Of course, he has.",
        "X: Have they got a property in Bangalore? + Y: Yes, they have.",
        "X: We’re going home. + Y: So are they.",
        "X: Do you often listen to the radio? + Y: No, only seldom.",
        "X: Has he gone to bed? + Y: No, he hasn’t.",
        "X: I have a lot of work to do. + Y: So has he.",
        "X: Are you from Barbados? + Y: Yes, we are.",
        "X: Should she answer all the questions? + Y: Of course, she should.",
        "X: Do you know what they have been telling about you? + Y: We know what.",
        "X: Have they returned the umbrella? + Y: No, they haven’t.",
        "X: Can we get home before it’s dark? + Y: I am afraid not.",
        "X: Does he have to draw money from the bank? + Y: Yes he does.",
        "X: Will he be long in coming? + Y: I think so, yes.",
        "X: Hadn’t you better keep from going to that place so often? + Y: Why?",
        "X: Where has he kept the keys? + Y: I don’t know where.",
        "X: Will he be able to find the place without much difficulty? ~ Y: Possibly, but I doubt it.",
        "X: There’s a pen lying on the floor. Is it yours? + Y: Yes, it looks like mine.",
        "X: Would he be finishing the work this week? + Y: No, I’m afraid he wouldn’t.",
        "X: Do I have to brush my teeth? + Y: Yes, everybody has to.",
        "X: Has your father made much money? + Y: I’m sorry, I didn’t hear you.",
        "X: Hadn’t you better unlock the door and get inside? + Y: Yes, I had better.",
        "X: Why has he put up a shed in the compound? + Y: I wonder why.",
        "X: How is your mother? + Y: She’s well, thanks.",
        "X: Why doesn’t he get married? + Y: Because he doesn’t plan to.",
        "X: How many trees have been cut down? + Y: I don’t quite know how many.",
        "X: How much does he pay that cleaning woman? + Y: Not much.",
        "X: Have you ever played a computer game? + Y: No, I never have.",
        "X: Why doesn’t he like a place like this? + Y: No one can explain.",
        "X: Which colour shirt do you prefer — yellow or orange? + Y: I’m not particular.",
        "X: Has he done the lessons very well? + Y: No, I don’t think so.",
        "X: Does he recognize me? + Y: No, he doesn’t seem to.",
        "X: Will you be going home this month-end? + Y: I haven’t decided yet.",
        "X: Does he have to get permission to go out of the office? + Y: No, he doesn’t have to.",
        "X: Which one of these pens do you want to choose? + Y: I can’t decide.",
        "X: How many days will he be on leave? + Y: I’m not sure just how many. X: You should have answered the phone as soon as it started ringing. + Y: Maybe you’re right.",
        "X: Will he be coming to the party? + Y: He will, but his wife won’t.",
        "X: Have they loaded up the lorry? + Y: Let’s find out.",
        "X: What time is it, please? + Y: Ask someone else, please.",
        "X: You must find a way of persuading him. + Y: I wonder how I can.",
        "X: Does he know that she hasn’t paid the bill? + Y: He probably does.",
        "X: Why did you plan to put up a car porch in the middle of the house, and not on one side? + Y: I’d like to have it that way.",
        "X: Have the police found out the truth about how the money has disappeared? + Y: I really can’t say.",
        "X: Have they been able to find a solution? + Y: It doesn’t seem so.",
        "X: Do you always go to work by car? + Y: Not always, but on occasion.",
        "X: Why have you stopped your work so early today? + Y: So I could go early.",
        "X: Do you want to get anything else today? + Y: No, nothing else. Thank you.",
        "X: Has he combed his hair? + Y: He has, but I haven’t.",
        "X: Splash a little water on the walls before scrubbing them. + Y: I beg your pardon?",
        "X: This is a one-way street — you mustn’t take your car this way. + Y: Sorry, I didn’t know that.",
        "X: Do you know why he didn’t want to go out today? + Y: No, I don’t.",
        "X: Do you know why he didn’t come today? + Y: I don’t know. Please tell me.",
        "X: Should we put up a board in front of our shop? + Y: Yes, I think we should.",
        "X: What were they talking in whispers when we came in? + Y: I really wonder what.",
        "X: Have they booked tickets for the journey? + Y: They probably have.",
        "X: Haven’t you heard? John has got married to Mary. + Y: Yes, but it’s hard to believe.",
        "X: How long do we have to wait? + Y: I wonder how long.",
        "X: Does he have a brother in England? ~ Y: No. Not that I know of.",
        "X: Why didn’t you look at her when she waved her hand? + Y: Because I didn’t want to.",
        "X: Can you spell “English”? + Y: I can, but my brother can’t.",
        "X: Why don’t we go for a film today? + Y: That’s a good idea.",
        "X: Why don’t you take out a few shares in this company? + Y: I have to think it over.",
        "X: Will he be able to make the speech without faltering? + Y: That’s something I am very sure of.",
        "X: Couldn’t you push him out of the room and bolt up the door? + Y: Yes, we certainly could, but we didn’t want to.",
        "X: How are you today? + Y: Just the same as always.",
        "X: Why does he always talk rudely to everyone? + Y: I don’t know why.",
        "X: Why did those people go underground? + Y: To escape punishment, of course."
    ]
}