{
    " Group 1 ": [
        " She has 14 children. How about that?",
        " She looks quite young, doesn’t she? As it happens, she’s 40 or so.",
        " She’s gone to the club. Why don’t you go along and pick her up?",
        " She’s good at sums, isn’t she?",
        " She’s good at skating, isn’t she?",
        " She’s good at tennis,, isn’t she?",
        " She’s not in love with him at all. Are you crazy or something? Whatever put that idea into your head? + (= What made you believe that?).",
        " She’s not in love with him at all. Are you crazy or something? Whatever put that idea into your head? + (= What made you think that?).",
        " Should I get a new shirt?",
        " Should I go to university or should I look for a job? Here’s a dilemma.",
        " Since when have you known him?",
        " So he didn’t attend the meeting. What of it?",
        " So he has got married? That’s news to me.",
        " So he says he can contribute some time, but not any money? That’s very big of him. + (= He’s not being kind/helpful at all).",
        " So he’s made a decision without consulting us? That’ll never do!",
        " So he’s not coming with us? It’s just as well, I think.",
        " So there’s going to be a book fair here next month? How did you hear about it?",
        " So they’re going to get married? I can’t believe it.",
        " So they’re not coming? They’ve cancelled their programme? Oh, good that’s a load off my mind. + (= a relief).",
        " So they’ve split up? I thought as much.",
        " So this is your new camera? What make is it?",
        " So you could get it done? That’s good work.",
        " So you know him? He lives next door to the post office. + (= in a building/house next to…).",
        " So you shouted back at the boss? You must be mad!",
        " So you took it away intending to give it back? I don’t think they’ll buy it.",
        " So you want me to change my decision? The answer is ‘no’.",
        " So you’re an applicant for that job? What experience have you had?",
        " So you’re going to buy that house? Has the agreement gone through? + (= been completed).",
        " So you’ve paid the money back? But John didn’t say a word about it to me.",
        " So you’ve resigned that post? I think you’re well out of it.",
        " So you’ve tightened the screws as far as they’d go? That’s the idea.",
        " So, he has made a complaint? He wouldn’t do it without good reason.",
        " So, that’s your (little) game. You’re trying to steal money from the company?",
        " So, you only got married last year? Do you have any family?",
        " Someone is knocking. Go and answer the door, will you?",
        " Stop acting the fool will you? + (= behaving as though you’re a…).",
        " Stop acting the martyr, will you? + (= behaving as though you’re a…).",
        " Stop shouting, will you? There’s no need to get excited about it.",
        " Stop talking hot air, will you?",
        " Straighten that painting on the wall, will you? It isn’t quite right.",
        " Suppose the news is true — what then?",
        " Sure enough, he had told them a lie, but why?",
        " Sweep away the broken glass, will you?",
        " Take a close look at this photo Do you recognize him?",
        " Take a close look at this picture. Do you recognize him?",
        " Take the first turning to the left after passing the Post Office. Then follow the road until you come to the traffic light. All right? + (= okay).",
        " Talking of cooking, what’s for dinner?",
        " Talking of Kamal, has he given that book back?",
        " Tell me, how does it feel to be a great actress?",
        " Tell me, is she very nice to look at?",
        " Thanks for giving me your time. Can I come and meet you once again sometime next week?",
        " That area comes under whose control?",
        " That box is very heavy. Can this shelf support it, do you think?",
        " That cake looks wonderful — cut me a big slice, will you?",
        " That girl has a lovely figure, doesn’t she?",
        " That may be true about newspapers. But how about magazines?",
        " That portrait really brings your father to life. Who painted it? + (= represents him in a lifelike way).",
        " That suitcase seems heavy. Do you need any help with it?",
        " That was a very good offer, but he turned it down. How stupid can you get?",
        " That was stupid of you. I mean, who else would have trusted a person like him with money?",
        " That’s a broken-down car and won’t cost much. Are you interested in buying it?",
        " That’s a cheap sewing machine. Why don’t you buy a better make?",
        " That’s a wonderful offer. Are you off your head to turn it down? + (= crazy).",
        " That’s enough of my problems troubles. Tell me, how are you doing in your new job?",
        " That’s enough of my  troubles. Tell me, how are you doing in your new job?",
        " That’s marshy land, isn’t it? Are they planning to do anything there?",
        " That’s rich land, isn’t it? Are they planning to do anything there?",
        " That’s poor land, isn’t it? Are they planning to do anything there?",
        " That’s forest land, isn’t it? Are they planning to do anything there?",
        " The beach runs to miles along the coast.",
        " The moment he came on the stage, do you know what happened? The audience rose to its feet as one man and started clapping and cheering. + (= at the same time).",
        " The petrol is giving out. Is there any petrol pump nearby, do you know?",
        " The sun is very strong — why don’t you wear your sunglasses?",
        " The train leaves at 3.30. Do you think we’ll be able to make it? + (= reach the station in time to catch it).",
        " The training is going to be really tough. Do you think you’ll be able to stay the course?",
        " The race is going to be really tough. Do you think you’ll be able to stick the course?",
        " The journey is going to be really tough. Do you think you’ll be able to  the course?",
        " The  is going to be really tough. Do you think you’ll be able to  the course?",
        " The unions have not called off the strike yet. Where do we go from here? + (= What should we do now?).",
        " Their house? It went for a fair price.",
        " Their profits went up by 50% this year. How about that for performance?"
    ],
    " Group 2 ": [
        " There (now)! Didn’t I tell you he’d be here today?",
        " There are 15 of them. Is there enough pudding to go around?",
        " There are 15 of them. Is there enough money to go around?",
        " There are several stories like these in the air. But is there any truth in them? + (= in circulation).",
        " There was a plane crash in… — now then, where was it?",
        " There’s a new film on at the Rex. Shall we go for it?",
        " There’s no law against falling in love, is there?",
        " There’s nothing much to pack, is there?",
        " These books are all out of order. Can you arrange them by this list?",
        " These books are out of order. Can you arrange them properly on the top shelf?",
        " These oranges cost a bit too much don’t they? + (= rather too much; very much).",
        " These people — are they really any use?",
        " These boxes — are they really any use?",
        " These prisoners — what do they do all day?",
        " These shirts, I don’t like. Have you got any others? me some few others.",
        " These shirts, I don’t like. Have you got any Show me a few others.",
        " These shirts, I don’t like. Have you got any  me  few others.",
        " They called him a dangerous… — now then, what’s the word they used? Yes—yes—psychopath.",
        " They can’t come? In that case, we may have to put off the meeting. + (= if that’s how things are).",
        " They had a shop there. Is it still in business? + (= operating; engaged in business).",
        " They haven’t taken up my application yet. You know the Joint Secretary, don’t you? Can you put in a word for me? That’ll help things along. + (= help the progress of).",
        " They paid me 100 rupees. How about that for an hour’s work? + (= What about that …?).",
        " They said they’d be here at 10 o’clock. It’s 1 o’clock now. How about that for punctuality?",
        " They say he’s got into drugs. Is it true? + (= started taking...).",
        " They were telling the Managing Director that the lock-out caused great suffering. What’s the use? He doesn’t know the meaning of the word ‘suffering’.",
        " This is an important job, and it needs a lot of skill and effort. Will they be able to do it?",
        " This is enough money to pay for the book. Why do you want more?",
        " This place is a bit too far to walk, isn’t it? + (= rather too far; very far).",
        " This plan looks good on paper, but will it work in practice? + (= in theory).",
        " This scheme looks good on paper, but will it work in practice? + (= in theory).",
        " This proposal looks good on paper, but will it work in practice? + (= in theory).",
        " This suitcase is very heavy. Can you help me with it?",
        " This university has great prestige in the eyes of other people. But what’s actually going on here?",
        " Today’s the twenty fourth, isn’t it?",
        " Too expensive? I thought it was quite cheap, if anything. + (= actually).",
        " Try and put yourself in my place. What would you have done if somebody had blamed you for something that’s not your fault?",
        " Turn off that radio, will you? It’s bad enough without that.",
        " Turn that chair the right way around, will you ? + (= facing the right way).",
        " Turn the volume down low, will you?",
        " Turn the TV down low, will you?",
        " Turn the gas down low, will you?",
        " Turn the flame down low, will you?",
        " Unscrew that handle, will you? Okay, we’re really in business now. Let me get my overalls on.... All right, I’m in business now.",
        " Use your head. Can’t you see? He’s trying to fool you.",
        " Wait a minute — have you filled in the application form?",
        " Was he of (any) help to you?",
        " Was he present at the meeting?",
        " Was she being sincere or was her behaviour just an act?",
        " Was she looking this way?",
        " Was she looking that way?",
        " Was she looking our way?",
        " Was she looking your way?",
        " Was that plane in proper and safe working condition then?",
        " Was the food all right?",
        " Was there anyone about when you got there?",
        " Was there anyone new at the meeting?",
        " We can’t put the deal back to where it had been at the start, can we?",
        " We know how to run our business. But what’s going on in your firm? You’d better put your own house in order before you criticize us.",
        " We only have about two litres of petrol left. Is there any petrol station nearby?",
        " We went to Bangalore and from there… — now then, what’s the name of the place? Yes — to Nandi Hills.",
        " We’ll buy a computer from the other party and a printer from these people. Make out two orders, will you?",
        " We’ll have to clean the whole house today. Who’ll do the scrubbing?",
        " We’ll talk about all those things later. First things first. Can we agree on a price?",
        " We’re all doing fine here. How are things going at your end? + (= there).",
        " We’re collecting money for the earthquake victims. Would you like to make a donation?",
        " We’re looking for a home help. Can you recommend somebody?",
        " We’re one player short. Can we make do with five?",
        " We’ve made all arrangements at our end. How about you?",
        " We’ve met before, haven’t we?",
        " Were there many people at the meeting?",
        " Were you at home last night?",
        " Were you away long? + (= for a long time).",
        " Were you dissatisfied with something I did? If so, give me a chance to put the matter right.",
        " Were you in on this secret?",
        " What about a game of tennis?",
        " What about Alex? Where’s he nowadays? + (= Have you heard about…?).",
        " What about me?",
        " What about the business you did of disguising your voice and telephoning him? Does he suspect you?",
        " What action have the authorities taken over the scandal so far?",
        " What are the chances of all that happening now?",
        " What are the chances of you getting the job?",
        " What are the charges against him? Have the police brought the case to court?",
        " What are the main points of conflict",
        " What are the main points of disagreement?",
        " What are the visiting hours?",
        " What are you driving at? + (= What are you trying to say?).",
        " What are you driving at? Are you suggesting that I stole your money?",
        " What are your plans for the weekend?",
        " What are your plans for the weekend? Are you very booked up? + (= busy; do you have any free time left?).",
        " What author do you like best?",
        " What blood group are you?",
        " What books have you read on this subject?",
        " What can we do but complain to the police?",
        " What chances do they have? Will they win the match?",
        " What class degree did you get at university? First class?",
        " What colour is her new dress? Red?",
        " What colour is your car?",
        " What colour should we paint the gate?",
        " What did they do to you? Did they beat you?",
        " What did this woman look like?",
        " What did you base your conclusion on?",
        " What did you do with the money I gave you?",
        " What did you do with the money you drew out of your savings account?",
        " What did you do with the money you drew out from your savings account?",
        " What did you learn at school today?",
        " What did you learn in school today?",
        " What did you spend the money on?",
        " What difference would it make?",
        " What do you do during your leisure hours?",
        " What do you feel about this plan?",
        " What do you make of him? + (= What’s your opinion of him?)."
    ],
    " Group 3 ": [
        " They’re a bunch of crooks. Don’t go around with them?",
        " They’re building a fire. Can’t you see the idea? They’re going to heat that iron bar.",
        " They’re going to make use of volunteers for that work?",
        " They’re not a strong team. How can they win this match? You’re expecting too much of them.",
        " They’re preparing a mailing list. Have you given your name in?",
        " They’re very angry with you — you shouldn’t have said those things, you know. Now what are you going to do to put things right?",
        " They’re very angry with you — you shouldn’t have said those things, you know. Now what are you going to do to set things right?",
        " They’ve agreed to release the hostages if certain conditions are met?",
        " They’ve decided to make the news public. What’ll we do?",
        " This box is quite heavy. Can you give me a hand with it?",
        " This box is quite heavy. Can you lend me a hand with it?",
        " This car bike is very old, isn’t it? I don’t think you’ll be able to get it going again. + (= working",
        " This motor bike is very old, isn’t it? I don’t think you’ll be able to get it going again. + (= operating).",
        " This  bike is very old, isn’t it? I don’t think you’ll be able to get it going again. + (= ",
        " This invention seems a good idea, but will it actually work?",
        " This is a bit much. How can I do both these jobs at the same time?",
        " What do you mean by shouting at them like that?",
        " What do you mean, my office was not co-operative?",
        " What do you mean, you can’t find it?",
        " What do you say to a cup of tea?",
        " What do you say to going for a walk?",
        " What do you think has caused such a steep fall in prices?",
        " What do you think is the plan",
        " What do you think is the problem?",
        " What do you think this is? A dinner party or what? Get away back to your seats at once.",
        " What does he do for a living?",
        " What does her husband look like?",
        " What does it taste like? What’s the pay like in your new job?",
        " What ever can we do now?",
        " What ever do you mean?",
        " What excuse can you give for coming out at this time of night?",
        " What gives you the right to do that?",
        " What gives you the right to say that?",
        " What has this government done to improve the living conditions of those people?",
        " What have you been doing since leaving college?",
        " What have you been doing to the car your room the road?",
        " What have you been doing to the  your  the road?",
        " What have you been doing to the  your  the road?",
        " What have you done so far to achieve reach your goal in life?",
        " What have you done so far to  reach your goal in life?",
        " What have you done to my car? I can’t start it. + (= You’ve damaged it).",
        " What have you done to your hand? It’s bandaged.",
        " What have you done with my tool kit? + (= Where is …?).",
        " What horrible food! How can we eat it?",
        " What if we paint the gate red?",
        " What if your plan fails?",
        " What in God’s name did you do that for?",
        " What in heaven’s name are you doing? + (= on earth).",
        " What is she carrying under her arm? Books?",
        " What is the full form of ‘Dr.’ ‘UK’ UNO?",
        " What is the full form of   UNO?",
        " What is the full form of   UNO?",
        " What is the news?",
        " What is the position?",
        " What is your opinion of John him?",
        " What is your opinion of  him?",
        " What is your state of health?",
        " What kind of camera machine do you have?",
        " What kind of car machine do you have?",
        " What kind of TV machine do you have?",
        " What kind of washing machine do you have?",
        " What kind of dress is that? She looks so common in it.",
        " What kind of shirt do you have in mind? + (= are you thinking of).",
        " What led you to choose a career in advertising?",
        " What make of car are you planning to buy?",
        " What more absurd, shocking, or surprising thing is possible?",
        " What more can I do",
        " What more can I say?",
        " What price did he offer for the car?",
        " What price did you pay for this car?",
        " What right have we to do that?",
        " What right have we to say that?",
        " What road is that hotel in?",
        " What sort of (a) man is your boss?",
        " What sort of (a) man is he?",
        " What sort of (a) person is he?",
        " What sort of a report is this that you’ve produced? + (= I’m not satisfied with it).",
        " What sort of books do you like best?",
        " What sort of camera do you have in mind? Is it anything like this?",
        " What sort of characteristics does it etc. have?",
        " What sort of characteristics does he, etc. have?",
        " What started you taking an interest in music?",
        " What stupid game are they playing now?",
        " What the hell are you talking about?",
        " What the devil are you talking about?",
        " What the blazes are you talking about?",
        " What time did she leave the office today?",
        " What time do you make? 5 o’clock?",
        " What time do you start work every day?",
        " What time does her office close?",
        " What time does the film finish?",
        " What time is it?",
        " What time is the news on?",
        " What time’s lunch?",
        " What time’s your lunch hour hour?",
        " What time’s your lunch dinner hour?",
        " What was her reaction to the news?",
        " What was that book you were reading? Have you got far with it?",
        " What was the idea of teasing her like that?",
        " What was the real reason for the quarrel?",
        " What was your main subject at university?",
        " What was your trip like?",
        " What was your holiday like?",
        " What about the restaurant on MG Road? Shall we try it?",
        " How about the restaurant on MG Road? Shall we try it?",
        " What? He has stopped smoking? I must be hearing things. + (= This is quite unlikely).",
        " What’ll be the overall cost of the project",
        " What’ll be the overall cost of the scheme?",
        " What’ll happen to that country if the rebels gain control?",
        " What’ll happen when the world ends?",
        " What’ll the boss say if he gets to hear of this?",
        " What’ll you do for water if the well goes dry?",
        " What’ll you do if the case goes against you? + (= is decided against you)",
        " What’s (on) the programme for today weekend? + (= What are we going to do…?).",
        " What’s (on) the programme for tomorrow weekend? + (= What are we going to do…?).",
        " What’s (on) the programme for this weekend? + (= What are we going to do…?).",
        " What’s behind this sudden change of plan?",
        " What’s Delhi like? I haven’t gone there so far.",
        " What’s for breakfast",
        " What’s for lunch",
        " What’s for dinner?",
        " What’s for pudding",
        " What’s for dessert?",
        " What’s going on here?",
        " What’s happening on the financial money front?",
        " What’s happening on the  money front?",
        " What’s happening?",
        " What’s his position on this question?",
        " What’s it being married?",
        " What’s on at the cinema today",
        " What’s on at the cinema tonight?",
        " What’s on now (on the TV)?",
        " What’s on tonight (on the TV)?",
        " What’s that black thing? It’s giving off a foul smell. + (= producing).",
        " What’s that box doing in that corner?",
        " What’s the going rate for carpenters",
        " What’s the going rate for secretaries?",
        " What’s the good of this telephone if it’s always on the blink?",
        " What’s the good of trying? + (= It’s useless…).",
        " What’s the good in trying? + (= It’s useless…).",
        " What’s the idea? Nobody is allowed to smoke in his hall.",
        " What’s the matter with him? He’s very excited.",
        " What’s the minimum rate or interest at which they lend money?",
        " What’s the news about them?",
        " What’s the news?",
        " What’s the point of asking him? He won’t help you.",
        " What’s the point of asking him? He’s as stupid as they come.",
        " What’s the price like?",
        " What’s the sense of borrowing such a large sum of money?",
        " What’s the sense of that decision",
        " What’s the sense of that that?",
        " What’s the use of complaining about it?",
        " What’s the use of fighting? You can’t beat the government + (= defeat…).",
        " What’s the use of fighting? You can’t beat the authorities. + (= defeat…).",
        " What’s the use of going out of your way to get into trouble?",
        " What’s the use of trying to advise him? It’ll have no effect on him.",
        " What’s the use of trying to advise him? It’ll have little effect on him.",
        " What’s the use of trying to get the government approval? It’s like banging your head against a brick wall.",
        " What’s the use of worrying just now?",
        " What’s this business I hear about you picking a quarrel with the boss?",
        " What’s this lever for? + (= What’s its purpose?).",
        " What’s wrong with it? I mean, don’t you like it?",
        " What’s wrong? Tell me — out with it! Come on!",
        " What’s your assessment of the situation?",
        " What’s your new boss like?",
        " What’s your new job house like?",
        " What’s your new  house like?",
        " What’s your normal working day like?",
        " What’s your opinion of that?",
        " What’s your explanation of that?",
        " What’s your point of view on the new labour policy?",
        " What’s your point of view on this issue? + (= opinion).",
        " What’s your reading of the situation?",
        " What’s your sex life like?",
        " What’s your state of health?"
    ]
}