{
    " Group 1 ": [
        "All our players played well today.",
        "Our team has a fairly good chance of winning this time.",
        "He doesn’t like indoor games.",
        "He only likes outdoor games.",
        "Wimbledon is a major sporting event.",
        "She did well on Sports Day.",
        "He was worried he’d lose his place in the team.",
        "He’s a first-rate cricketer.",
        "It’s a defeat — they’ve lost.",
        "When he was younger, he used to be interested in sport.",
        "There was keen competition among the various teams.",
        "Don’t play that card now — play the king of clubs.",
        "You can’t beat him at tennis.",
        "Let’s go to the football match tomorrow, shall we?",
        "I’ll bet they’ll win the match.",
        "He’s the best opponent I’ve ever played against.",
        "He works out at a gym three times a week.",
        "He jumped 18 feet.",
        "He’s beaten/broken the world 10",
        "000 meters record.",
        "The winner received a trophy and a certificate.",
        "How many points have their team scored so far?",
        "He plays a lot of outdoor sports.",
        "Then she challenged him to a game of chess.",
        "Do you like watching sports?",
        "Our town doesn’t have an indoor swimming pool.",
        "These exercises would help you reduce weight and improve your health.",
        "Where are the Olympic Games going to be held this time?",
        "Is he good at boxing/wrestling?",
        "So far, they’ve had five wins this year.",
        "He was listening to the sports news.",
        "He used to play a lot of sport when he was at school.",
        "He’s one of the best boxers, and it’ll be very difficult for anyone to take the championship from him.",
        "Our team has won the qualifying match.",
        "She lost the race.",
        "This is the third time he’s taken a strike at the goal.",
        "This stadium is often used for sporting events.",
        "He gambles at cards.",
        "He’s a tennis/chess champion.",
        "I swim three times a week.",
        "He’s a very good swimmer.",
        "Who won the gold medal in the 100 metres at this year’s Olympic Games?",
        "One thing I like about him is, he’s a very professional player.",
        "He’s their best batsman, and with each stroke, he’s been scoring runs today.",
        "He won the second game convincingly.",
        "He’s one of their best batsmen. He scored a century today.",
        "At last, he managed to beat his opponent, and he won the game.",
        "Did she win the race?",
        "That was an outstanding performance.",
        "His son takes part in a lot of athletic activities.",
        "Our college has a very good football field/ground.",
        "She was watching their game from the stands.",
        "I’ve never seen anyone run so fast.",
        "He couldn’t do his morning exercises today.",
        "He boxes/wrestles well.",
        "Our team failed to qualify for the Asia Cup finals.",
        "He often travels a long way to see his favourite team play.",
        "He’s never done any sport in his life.",
        "The other two boxers fought a match of 10 rounds.",
        "He’s a keen football fan/ football supporter.",
        "The game was a draw.",
        "Has he captained the Indian team before?",
        "How many players took part in the championship?",
        "That was a fine defensive play — don’t you think so?",
        "He’s a long-distance runner.",
        "He’s a professional, and he may not like to play against an amateur.",
        "She challenged him to a game of tennis.",
        "They failed to qualify for the semi-finals.",
        "They lost the second round.",
        "You play volleyball/badminton on a court with a high net.",
        "This is the third time she has won first place.",
        "Give me the cards — it’s my deal this time.",
        "Join a gym, and give your body a workout twice or thrice a week.",
        "That was the most thrilling boxing contest I can ever remember.",
        "The odds are 10 to 1 against that team winning.",
        "He’s an Olympic gold medalist.",
        "These exercises make your body fit and strong.",
        "He can run the 100 metres faster than anybody.",
        "They say he’s a good tennis player, but I haven’t played (against) him yet.",
        "He plays very well, and he’s good enough to be a professional.",
        "Have you ever run a marathon?",
        "He’s won the first quarterfinal.",
        "These events are meant to eliminate the weaker competitors.",
        "Do you play a lot of tennis?",
        "Thousands of supporters regularly go to watch that team play."
    ],
    " Group 2 ": [
        "Their school has a good athletics field.",
        "Is he good enough to play for our team?",
        "He’s a professional sportsman.",
        "I don’t think these exercises are good for you. You’re past 60, remember.",
        "They sell sports equipment.",
        "He punched the other boxer on the jaw/in the chest/in the side.",
        "The winners all received prizes.",
        "It’s the college sports day tomorrow.",
        "Our team has won the first round of the tournament.",
        "He takes exercise regularly.",
        "I don’t know if he won or lost.",
        "Both sides played very well.",
        "There’s a card missing from the pack.",
        "He bought a new tennis/ badminton racket yesterday.",
        "Every day, he works out in the gym for an hour.",
        "He shot two goals in the last match.",
        "He may even break/beat the Olympic record this time.",
        "He’s an amateur wrestler/footballer.",
        "When will the finals of the tournament be?",
        "How do you exercise your muscles?",
        "He’s a champion swimmer.",
        "Who won the cup/shield?",
        "Their town has a huge football stadium.",
        "Our wicket keeper missed an important catch — or we would have won the match.",
        "When he was younger, he used to take part in track and field sports — especially running and the javelin.",
        "I think you need more exercise.",
        "More than 30",
        "000 people turned up for the match.",
        "The fighters were aiming punches at each other.",
        "Where’s the shuttlecock? It’s my turn to serve, isn’t it?",
        "It’s my service next.",
        "He’s in the college team.",
        "Two of their players were sent out of the ground for fouling.",
        "If you want to be a good footballer, you should be good at passing.",
        "The doctor has asked him to take more exercise.",
        "The other boxer was knocked out in the fourth round.",
        "The cup final took place at another stadium.",
        "He was anxious to know the football result.",
        "Look at the way he played/hit/kicked the ball.",
        "Don’t try to win the match by fouling their players.",
        "It was an easy catch, but the fielder dropped it.",
        "He’s very good at sports.",
        "He does a lot of keep-fit exercises.",
        "Who played India this time in the final? Australia?",
        "The crowd cheered when he received the prize.",
        "He’s never taken part in a sports competition.",
        "He did well in the long jump/the high jump.",
        "Our team lost the World Cup final again this time.",
        "Who won?",
        "They were last year’s Cup finalists.",
        "Tennis is his favourite sport.",
        "Cricket and hockey are team sports.",
        "He’s exercising in the garden.",
        "He plays football every day.",
        "Our team can easily defeat theirs.",
        "The first round of the tournament starts tomorrow.",
        "What card did you play?",
        "He played the Ace of clubs/King of Hearts/Queen of Spades/ Jack of Diamonds/10 of clubs/9 of Hearts.",
        "He has a lot of gymnastic skills.",
        "Who won the championship?",
        "It won’t be easy to defeat that team.",
        "Both of them are football fans.",
        "She lost the match and left the court in tears.",
        "Don’t forget he became a champion by beating all other competitors.",
        "He was a lap ahead of the next man, and I thought he would win the race.",
        "He’s one of the best tennis players I’ve ever seen — he has a powerful serve.",
        "The result is a tie.",
        "Have you played him (at badminton)?",
        "Where are the cards? You have the deal now.",
        "He does a lot of gymnastic exercises every day.",
        "This year’s chess/ tennis tournament was a great success.",
        "Who holds the world record in/for the pole-vault?",
        "They both play tennis very well — they won the women’s doubles last year, you know.",
        "He’s a very talented player.",
        "He isn’t fit. He can’t play.",
        "Look at the way he hits the ball with his racket.",
        "How many contestants/ competitors were there?",
        "He finished in second place in the race and became a runner-up.",
        "She won by 5 points.",
        "Nowadays, he doesn’t engage in sports or fitness activities.",
        "I’ve started going to a keep-fit-class.",
        "He played the shot/stroke beautifully, didn’t he?",
        "He again fouled against/on one of our players — he should be sent off.",
        "She had to be content with second prize.",
        "He has a lot of athletic ability."
    ],
    " Group 3 ": [
        "His favourite sports are football and running.",
        "Are you interested in mountaineering?",
        "They play very well, but they lack good sportsmanship.",
        "The doctor has asked him to exercise himself more.",
        "He’s a brilliant cricketer and a true sportsman.",
        "Those two teams tied for second place in the game.",
        "I have never played basketball.",
        "Where are the cards? I deal next, right?",
        "He’s healthy and strong and he regularly enters sports competitions.",
        "Who judged the contest?",
        "The Australian team were the world champions then.",
        "He’s a good tennis player, and he’s likely to win the men’s singles this year.",
        "The Asian championships are going to be held in Delhi this time.",
        "Who beat them in the semi-finals?",
        "He’ll be playing for us tomorrow.",
        "He played a really bad shot this time.",
        "She was his rival in the competition.",
        "Don’t let your serve go into the net again.",
        "He scored two goals in the second half of the match.",
        "He’s a good tennis player/cricketer/golfer/footballer/snooker player.",
        "If you exercise regularly, you can get fit and remain healthy.",
        "Can you run a mile in 4 minutes?",
        "At least 50",
        "000 spectators must have watched the final game.",
        "This is the first major trophy he’s ever won.",
        "Their team won the Cup last year.",
        "That was an impressive jump.",
        "She swam the 100 metres very well.",
        "He’s not very good at athletics.",
        "The problem is, he doesn’t exercise enough.",
        "Our village doesn’t have a sports field.",
        "The match ended in a tie.",
        "That’s not the way to hit the shuttlecock with your racket.",
        "They’re playing poker/chess.",
        "It was the first time she had ever taken part in a gymnastic display.",
        "He won the first game, but lost the second and third.",
        "This exercise improves your co-ordination.",
        "He and his brother are the fastest runners, and they’re competing for the gold medal.",
        "He finished only a few inches behind the winner.",
        "That was the first time he had run in a marathon.",
        "At last, he’s got a place in the team.",
        "Our staff have sports competitions on January 26 every year.",
        "There’s a lot of rivalry between the two teams.",
        "He’s won a lot of sports contests.",
        "What’s the score so far?",
        "How often do you exercise?",
        "The children ran races in the playground.",
        "Spectators at a football match are always noisy.",
        "Who presented the trophies?",
        "The side he supported didn’t win.",
        "He’s good at sport.",
        "Football is an outdoor sport, but badminton is an indoor sport.",
        "He played as our first bowler.",
        "I don’t know how he managed to get in the team.",
        "She lost the race.",
        "Supporters of both the teams had packed into the stadium long before the play started.",
        "He always gets a good hand when he plays cards.",
        "How much money will the winner/loser get?",
        "Is he competing in the long jump?",
        "Who won first prize?",
        "He played the Jack of Hearts.",
        "Our college has a very good side/team, and we hope to win this year.",
        "Thousands of football fans came to watch the finals.",
        "Have you entered for the race?",
        "He qualified for the final by beating 10 competitors.",
        "If you play well, you can win a place for yourself on the university team.",
        "Many companies have come forward to sponsor our team this time.",
        "He hit the ball hard.",
        "This was the first time they had won a game against England.",
        "He does a lot of stomach exercises.",
        "He had to run against some of the best runners in the race.",
        "The spectators were shouting themselves hoarse and cheering on the team.",
        "The last game resulted in a win for the other side.",
        "I’m a fan of yours.",
        "Our team will win the world championship one day.",
        "Their team has qualified in the first quarter-final."
    ]
}