{
    "key": [
        "A knife is for cutting with, isn’t it?",
        "A picnic tomorrow? That’s a great idea.",
        "A thought came into my mind all of a sudden. What if he refuses our offer?",
        "About your mother — how’s she now? What do the doctors say?",
        "Above all else, do they have any evidence for what they were saying?",
        "Add these figures together/ up and find the total, will you?",
        "After all, their demands are not unreasonable. Why don’t you accept them and have done with it? (= get rid of the whole matter in that way).",
        "After calling me a liar, he comes and asks for my help. How about that for cheek?",
        "After criticizing him like that, how can you go and ask him for a loan? He’ll laugh in your face.",
        "All is well with you, I hope?",
        "All right, can you jump off this cliff into the sea?",
        "All right. I’ll ask him to apologize to you. How’s that for a compromise?",
        "All these are expensive watches, aren’t they? Show me the one that costs (the) least.",
        "All they ever do is sit around and gossip. Have you ever seen them doing any work?",
        "Am I in your way?",
        "Am I included in the invitation?",
        "And who do you think came and opened the door? His boss, no less!",
        "Anil and Asha are going around/about with each other, I hear?",
        "Any chance of a cup of tea?",
        "Any chance of him withdrawing the resignation?",
        "Any news of the plane crash?",
        "Anyone bold enough to stand up to the boss?",
        "Anyone rich enough to buy a Rolls Royce here?",
        "Anyone tall enough to get that book down from the top shelf?",
        "Are the children doing well at school?",
        "Are the children doing well at their new school?",
        "Are the potatoes done yet? (= cooked enough).",
        "Are the rules/instructions clear on this point?",
        "Are there any difficulties/problems at your end?",
        "Are there any last-minute changes in the plan?",
        "Are there enough chairs for the guests?",
        "Are there enough seats for everyone?",
        "Are they planning to make any changes to/in the team?",
        "Are those rules/ orders/laws still in effect? (= apply).",
        "Are you above/over the age of 18?",
        "Are you aware of the problem?",
        "Are you aware of the time?",
        "Are you by any chance Sheela’s father?",
        "Are you calling into question my loyalty? (= Are you questioning it?).",
        "Are you certain what you’re doing is for the best?",
        "Are you feeling better?",
        "Are you free for dinner/lunch/breakfast?",
        "Are you free this evening or booked up?",
        "Are you going out? Bring me back one or two magazines.",
        "Are you going to accept their offer? I want a definite answer on that.",
        "Are you going to write to them? Give them my love, will you?",
        "Are you having a bath?",
        "Are you in Delhi for business or pleasure?",
        "Are you interested in elephants?",
        "Are you living by yourself, or do you share your flat with someone else?",
        "Are you looking for your diary? It’s there (straight) in front of you.",
        "Are you making profits?",
        "Are you new to this place or have you been here long/a long time?",
        "Are you off your head to believe a man like him? (= foolish; mad; crazy).",
        "Are you out of your mind to go out in this weather?",
        "Are you planning on contesting the next election/this by-election?",
        "Are you planning to go on your own or are you going with them?",
        "Are you planning to stand for election this time? (= be a candidate in the election).",
        "Are you questioning the minister’s authority?",
        "Are you still with me?",
        "Are you still working for the same firm?",
        "Are you sure you’re getting the most out of your staff?",
        "Are you the head of the firm?",
        "Are you trying to win fame by doing all this?",
        "Are you using your pen at the moment?",
        "Are you with me so far?",
        "Are you wondering whether he’ll be able to do this work well? Look, he’s as good as the next man. (= he’s as good as most people are — perhaps better).",
        "Are you worried or concerned about anything?",
        "Aren’t I a talkative person?",
        "Arjun, how did this happen? Why don’t you speak to me man to man?",
        "Be at the office by eight tomorrow, will you?",
        "Boil the potatoes and then peel them. All right?",
        "Bring me a glass of water, will you? (= fetch it for me).",
        "Bring me the letters that came yesterday, will you?",
        "But how was I to know that they’d come back so early?",
        "But I saw him a few hours ago, and he seemed all right to me then. When did he have the stroke?",
        "But what has the government done to put these policies/plans/this programme of reforms into effect? (= carry them out).",
        "By any chance, have you got a light?",
        "By the close of business every day, how much money do you make?",
        "Can an elephant live for a hundred years?",
        "Can anybody give her back her dead husband? (= make it possible for her to have him again).",
        "Can I ask you a favour?",
        "Can I ask you a question?",
        "Can I bank on/depend on your support?",
        "Can I borrow your pen for a moment?",
        "Can I come in? I’ll only take up a minute.",
        "Can I have a go on your bike/in your car? (= a chance to ride /drive it).",
        "Can I have a quiet word with you?",
        "Can I have a read of that magazine?",
        "Can I have my book back, please?",
        "Can I interest you in this new detergent/shampoo? (= persuade you to buy).",
        "Can I join you?",
        "Can I leave this packet with you?",
        "Can I speak to you for a moment?",
        "Can I take it we’ve heard your final offer?",
        "Can she do acrobatics?",
        "Can they still be alive after all this time?",
        "Can we complete this hotel project without the need for any more approvals from any other authorities? (= without the approvals being necessary).",
        "Can we ever rid the world of poverty?",
        "Can we raise the ceiling a couple of feet?",
        "Can you act the part of a professor for some time?",
        "Can you arrange these books in correct order? Here’s the list.",
        "Can you arrange these flowers into some sort of order?",
        "Can you calculate the total of these figures?",
        "Can you change a rupee?",
        "Can you climb over that wall?",
        "Can you come back later? He’s busy at the moment.",
        "Can you come in for a little while?",
        "Can you come in for a moment? I’d like a (quick) word with you. (= a short conversation).",
        "Can you describe (to us) what actually you saw?",
        "Can you describe your attacker/next-door neighbour/dog/car?",
        "Can you describe your home to us?",
        "Can you do it? If not, I want to get it done by someone else.",
        "Can you do something for me? Can you give this letter to Mr.Arora?",
        "Can you do that once more?",
        "Can you drive/sew/swim/shoot (well)?",
        "Can you find me a good typist?",
        "Can you find me somebody to help me with this job?",
        "Can you get (a) hold of that end of the desk? Let’s shift it against the wall.",
        "Can you get hold of him and give him this packet?",
        "Can you get this message to him immediately?",
        "Can you get word to him that I want to see him for a few minutes?",
        "Can you give me a drink of water?",
        "Can you give me a general idea of the job?",
        "Can you give me some information about your cookery course?",
        "Can you give me this month’s production figures up until last weekend?",
        "Can you go without eating for a week?",
        "Can you guess her age?",
        "Can you help me free this dress? It’s got caught on the fence.",
        "Can you keep an eye on my bag/baby? I’ll go and get a magazine.",
        "Can you look me in the eye/face and say that again? I don’t think you’re telling the truth.",
        "Can you make a salad for me now?",
        "Can you make room for a few more books on that shelf?",
        "Can you make room for one more person in the car?",
        "Can you make sense of this letter? I don’t know what he’s trying to tell us.",
        "Can you play (me) that tape machine/recordplayer/ radio?",
        "Can you play that cassette/record/tape (for me)?",
        "Can you play that sort of music on the guitar/organ/violin?",
        "Can you put this book on one side for me? I’ll buy it next week.",
        "Can you put your suggestions down on paper?",
        "Can you reach (those books on) the top shelf?",
        "Can you rearrange the books on that shelf and make room for a few files?",
        "Can you remember where they live?",
        "Can you run a washing machine/photocopier/ computer? (= operate it).",
        "Can you send a man to look at my TV immediately?",
        "Can you show me something different?",
        "Can you stand on your head?",
        "Can you stand this stick/egg on end?",
        "Can you stick these broken pieces together?",
        "Can you suggest a different/an alternative plan, so we can tackle this problem?",
        "Can you swim under water?",
        "Can you tell me about the general situation in which all this happened?",
        "Can you tell me how this instrument works?",
        "Can you tell me the times of trains to Bombay? Do you know them offhand? (= off the cuff).",
        "Can you tell me what the weather is going to be like tomorrow?",
        "Can you try and build up a picture of the thief from what she told us?",
        "Can you try and picture nuclear war in the mind?",
        "Can you turn the sound up? I don’t hear very well.",
        "Can you unscrew the top of this bottle?",
        "Can you wait five minutes while I have a bath?",
        "Can’t I act how I like in my own home?",
        "Can’t you see he’s trying to fool you?",
        "Can’t you understand a mother’s love for her daughter?",
        "Chicken is off — they’ve only got beef. Shall we try some other restaurant?",
        "Come again? I didn’t hear what you said. (= please say that again).",
        "Come along to my office when you have a free moment, will you?",
        "Come on, hurry up! Make up your mind — they’re waiting. Do you want to go out or not?",
        "Come to think of it, how could he have sold the car? It was not his at all.",
        "Could I use your telephone? I want to call my boss about something.",
        "Could you do it at all?",
        "Could you do it right?",
        "Could you ever come to know who did it?",
        "Could you give me a rough idea how it works?",
        "Could you hear a funny sound in the engine?",
        "Could you mind my bag, please? I’ll be back in a minute.",
        "Could you pass me that book over there?",
        "Could you run/drive me to the station? (= give me a lift to…)",
        "Could you see the point of that story/point/joke/his argument?",
        "Could you wake me a bit early in the morning?",
        "Cut a few more slices of bread, will you?",
        "Dad, can I take the car/bike/motor bike today?",
        "Dad, you know Mohan? He’s come top/bottom of our class. (= He’s got the best/worst results).",
        "Did he get promotion through merit or seniority?",
        "Did he give his right name to them?",
        "Did he give you any help with the work?",
        "Did he go to university? (= study at a university).",
        "Did he say he saw me there?",
        "Did he serve on the committee?",
        "Did I understand you right? Your father has ten cars?",
        "Did the cats disturb you in the night? (= during the night).",
        "Did the dog open the door by itself? (= without help).",
        "Did they announce that the train/flight would be delayed?",
        "Did they do anything else?",
        "Did they pay you for the work?",
        "Did you come in just now or have you been here long/a long time?",
        "Did you do it? Answer me.",
        "Did you enjoy the film/ book?",
        "Did you go out that night?",
        "Did you have a good day at school?",
        "Did you have a hand in the project? (= Were you involved in…).",
        "Did you have fun at the party?",
        "Did you have good time in America?",
        "Did you have the house painted?",
        "Did you hear a noise outside?",
        "Did you hear all those nasty things she said? That was meant for you.",
        "Did you hear the fire alarm/ ambulance siren going off?",
        "Did you hear the news/gossip? It’s all over the village/factory.",
        "Did you like mathematics/history at school?",
        "Did you like the piece of music he played just now?",
        "Did you like the play? Who acted the part/role of Macbeth?",
        "Did you like this book? Mumbai really comes to life in it, doesn’t it? (= is represented in a lifelike way).",
        "Did you listen to the news last night?",
        "Did you meet anyone interesting at the party?",
        "Did you read her latest novel? Her style of writing has really come of age.",
        "Did you read the newspaper reports of the murder?",
        "Did you read the paper? There was an attempt on the Prime Minister’s life. (= an attempt to kill him).",
        "Did you see that film? It was very true to life.",
        "Did you see the accident?",
        "Did you see the expression on his face? He means business.",
        "Did you see the match? It was as exciting as anything.",
        "Did you see the notice?",
        "Did you see today’s paper?",
        "Did you stay there long? (= for a long time).",
        "Did you vote at the last election?",
        "Didn’t you have any breakfast at all?",
        "Didn’t you know he was only fooling?",
        "Didn’t you read it? It was in all the papers.",
        "Didn’t you see him shouting at them and insulting them last week? And he had the face to go to their house and ask for a loan after that! (= impudence).",
        "Do five photocopies of this letter for me, will you?",
        "Do I have to wear a suit or will this shirt be good enough?",
        "Do the suppliers provide after-sales service?",
        "Do these drugs act on the brain/central nervous system? (= have an effect on…).",
        "Do they charge for admission?",
        "Do they have a suitable room for the meeting?",
        "Do they live round here?",
        "Do they sell cat food/dog food?",
        "Do we have enough experience to do this job? I think this is the right time to take stock of our position.",
        "Do we have enough plates/cups/spoons/chairs/sandwiches/food to go round?",
        "Do we have to discuss this now? Won’t it keep until later?",
        "Do you believe all that the newspapers say?",
        "Do you believe in democracy/socialism/the new labour policy? (= have faith in…).",
        "Do you believe in God/fairies/ghosts? (= Do you believe that they exist?).",
        "Do you believe in miracles/life after death?",
        "Do you belong to the golf club? (= Are you a member of…?).",
        "Do you dream at night?",
        "Do you expect him to come to our help? That’s a laugh! (= That’s silly)",
        "Do you expect to get a part in that film?",
        "Do you feel all right?",
        "Do you feel like a coffee/having a coffee?",
        "Do you get the general idea now?",
        "Do you have a true idea of its seriousness/how important it is?",
        "Do you have an account at/with that bank?",
        "Do you have any idea what time it is?",
        "Do you have any information about/on hotels in that area?",
        "Do you have any money left over for tomorrow’s expenses?",
        "Do you have anything else to buy? The instructions on the label were difficult to understand.",
        "Do you have some ideas?",
        "Do you have the authority to sign the contract?",
        "Do you have the dress in a different colour?",
        "Do you have time to do it?",
        "Do you have to leave now?",
        "Do you hold with communism?",
        "Do you know any English?",
        "Do you know his address?",
        "Do you know his telephone number by any chance?",
        "Do you know of a good heart specialist?",
        "Do you know the man who lives in here?",
        "Do you know the way?",
        "Do you know what a lot of hardship he had to go through? (= suffer, experience).",
        "Do you know what it means to get on a platform and make a speech to an audience? You feel a tremendous sense of your own importance, your own worth … a sense of achievement … you know what I mean?",
        "Do you know what it’s like to face a criminal trial for something you haven’t done?",
        "Do you know what? There were no less than 1000 people at the party. (= at least).",
        "Do you like coffee or tea better?",
        "Do you like going shopping?",
        "Do you like potatoes?",
        "Do you like your job?",
        "Do you mean to say they sacked him for no apparent reason?",
        "Do you mean to say you have lost it?",
        "Do you mind if I smoke?",
        "Do you mind if I switch the fan on?",
        "Do you mind the noise?",
        "Do you play cards?",
        "Do you realise what he’s been through the last few days?",
        "Do you realize why she didn’t even look at you? She doesn’t love you, that’s why.",
        "Do you remember her wedding?",
        "Do you remember how we used to enjoy ourselves? They were good times.",
        "Do you remember that man I told you about?",
        "Do you remember the address?",
        "Do you remember when they built that house? It was before your time, of course. (= before you were born; before you were old enough to remember it).",
        "Do you see any difference?",
        "Do you sell these shoes in brown/black?",
        "Do you speak French?",
        "Do you supply them with the materials every month or on demand?",
        "Do you take me for a fool/an idiot?",
        "Do you take sugar?",
        "Do you think anyone rich would support the communist party?",
        "Do you think government cuts can be one of the reasons for the recession?",
        "Do you think he’ll be able to cope with the work?",
        "Do you think he’ll be able to handle the job without your help?",
        "Do you think he’ll be able to make it in the interview? (= be successful at…).",
        "Do you think he’s an upright official and won’t take a bribe? Everyone has their price, you know. (= There’s nobody who cannot be bribed in some way).",
        "Do you think he’s fit for the job?",
        "Do you think he’s free from responsibilities in this matter?",
        "Do you think I believe you? You’ve got to do better than that!",
        "Do you think it’ll be all right for me to do that?",
        "Do you think it’s really possible to put a stop to the abuse of drugs?",
        "Do you think money is central to happiness?",
        "Do you think some of our union leaders know the meaning of (the word) work?",
        "Do you think the bank acted properly in the best interests of the depositors?",
        "Do you think the government will cut taxes this year?",
        "Do you think the President would be willing to lend his name to a scheme like this? (= support it).",
        "Do you think the Prime Minister is losing hold on his party?",
        "Do you think the ruling party will be returned to power in this election?",
        "Do you think these factors would affect his decision?",
        "Do you think they’ll fall in with the arrangement?",
        "Do you think this is an appropriate course of action?",
        "Do you think those telephone wires are a bit down?",
        "Do you think you have no control over your life?",
        "Do you think you’ll be able to get him to agree to the plan?",
        "Do you think you’re man enough for the job?",
        "Do you understand the conditions perfectly?",
        "Do you understand this sentence?",
        "Do you understand what he’s saying?",
        "Do you want a drink of any sort?",
        "Do you want this system/practice/these customs/ rules to go on? (= continue to exist).",
        "Do you want to buy that table? The asking price is Rs. 15,000, but they may sell it to you for less. (= the price set by the seller).",
        "Do you want to talk in front of them?",
        "Doctor, I’ve got an upset stomach. Can you do something/anything for it?",
        "Doctor, is she any better at all?",
        "Does anybody have any further questions to ask?",
        "Does he do any sport?",
        "Does he have any experience of the work?",
        "Does he have enough experience to handle a senior job?",
        "Does he have enough marks to apply for university?",
        "Does he have the ability to cope with the work?",
        "Does he have the experience for the job?",
        "Does he have the means to support a family?",
        "Does he know about these facts?",
        "Does he know enough about company law to advise them on these matters?",
        "Does he know how to get there?",
        "Does he know how to use a computer?",
        "Does he play very well? A player’s religion is not a relevant point.",
        "Does he stand a chance of winning the election this time?",
        "Does it have anything to do with her father? (= Is it anything connected with…?).",
        "Does it mean that you don’t want to be a committee member? That’ll/It’ll never do! (= is unacceptable, and I object).",
        "Does money bring happiness?",
        "Does she appear in that film/ play/show/TV Programme?",
        "Does she stay at home or go out to work? (= have a job).",
        "Does she study hard?",
        "Does the police think the accountant is the guilty party?",
        "Does their offer still stand?",
        "Does this estimate allow for price rises?",
        "Does this shirt go with these trousers?",
        "Does your dog bite?",
        "Doesn’t that man answer the description the police have given? (= match…).",
        "Don’t answer back to your teachers. Do you hear me?",
        "Don’t argue with your boss. You don’t want to count the cost, do you? (= start having problems as a result of it).",
        "Don’t do anything foolish for a silly cause like that. Why should you put your reputation on the line? (= risk it).",
        "Don’t do it — do you hear me?",
        "Don’t interrupt me while I’m talking? Is that clear?",
        "Don’t keep on nagging me like this! Get off my back, will you? (= stop annoying/troubling me).",
        "Don’t raise your hopes. How do you know he’ll help you?",
        "Don’t touch anything until the police arrive. Do you hear me? Don’t touch anything!",
        "Don’t you go in for any hobbies at all?",
        "Don’t you have anything to do?",
        "Don’t you keep accounts for the business?",
        "Don’t you know the answer?",
        "Don’t you know what’s going on? Were you born yesterday?",
        "Don’t you see a shed over there? Look past those people/that tall building. (= look beyond…).",
        "Don’t you see? If you do that, you’ll be playing right into their hands.",
        "Don’t you think he’s tall for his age?",
        "Don’t you think the accused was let off lightly? This was the third time he had been charged for theft, you know."
    ]
}