{
    "key": [
        "I can’t see you until later — I’m rather busy now.",
        "I can’t sell the house at that price — it’s very much on the low side.",
        "I can’t stand by and watch my people suffering like this.",
        "I can’t stand by and watch these people suffer — I’m not built that way.",
        "I can’t tell one from the other. Both the dogs look so alike.",
        "I can’t tell you when he’ll be back home — he gets back home at all hours.",
        "I can’t think of a physical explanation for these strange happenings.",
        "I can’t think of a way to deal with this situation offhand.",
        "I can’t type — I have a painful cut on my index finger.",
        "I can’t understand this case — the facts just don’t make sense.",
        "I can’t understand why, but I have a feeling that we can’t trust him.",
        "I can’t wait any longer. I have to leave now — I’ve got work to do.",
        "I can’t wait here any longer. My nerves won’t stand it.",
        "I admit things look black — but in the long run, we’re going to come out all right.",
        "I agree that we may not be able to do this on our own.",
        "I agree with him. That’s quite a reasonable point of view.",
        "I agreed to do it, but I hadn’t considered the cost in time and labour.",
        "I always carry some loose change whenever I travel by train.",
        "I am absolutely independent, and I don’t need anybody’s help to survive.",
        "I can give you a hundred/thousand and one reasons why this plan won’t work.",
        "I am innocent. I’ve been arrested on a trumped up/false charge.",
        "I am interested to know/find out why they rejected our offer.",
        "I am speaking to the class at large and not to any individual student.",
        "I am the head of this firm in name only. All the powers are with him.",
        "I appreciate your concern for those people, but I don’t think we can do much to help them out.",
        "I asked him a few questions to find out/see how the land lay.",
        "I asked him about it, but he made no answer and took me into his office.",
        "I asked him for a loan, and believe it or not, he gave it.",
        "I asked him for a loan, but he told me ‘Nothing doing’.",
        "I asked him for his help, but he turned his back on me.",
        "I asked him for money, but he didn’t give me any.",
        "I asked him for my magazine, and he handed it back without speaking.",
        "I asked him if there was anything he wanted, and he shook his head.",
        "I asked him to call me back as soon as he got the information.",
        "I asked him to keep an eye on my suitcase and I went to the toilet.",
        "I asked him to repair the radio and went to take a bath, leaving him to it.",
        "I asked him where his daughter was, and he jerked his head towards a girl sitting on the settee.",
        "I asked him where the Post Office was, and he pointed down the road.",
        "I bought this desk in a junk shop. I polished it and made it as good as new.",
        "I bought this dress at a sale and I got it at half-price.",
        "I bought time by telling him I had left my wallet at home.",
        "I can never forget what I’ve been through in the past hour.",
        "I can only give you 95 rupees. That’s every penny I’ve got.",
        "I can only spare Ajith. I can’t spare anyone else. Take it or leave it.",
        "I can’t attend the meeting. The next best thing is to send my deputy.",
        "I can’t be at his beck and call all day. I have other things to do.",
        "I can’t bear the thought of staying alone in that house.",
        "I can’t believe that all this took place in one day.",
        "I can’t buy it — I’m a bit short of/low on funds at the moment.",
        "I can’t come — I’ve far too much work to do.",
        "I can’t come out now — something has suddenly come up.",
        "I can’t come today — I’ve got a lot of work to do.",
        "I can’t come. I’ve got some guests on my hands and I’m in a fix.",
        "I can’t comment on the situation, because I don’t know all the recent facts about it.",
        "I can’t dig this ground — it’s as hard as iron/stone/a rock.",
        "I can’t do all this extra work. It’ll bite into my free time.",
        "I can’t do so much work in a day. This is really hard going.",
        "I can’t give up the project now. I’ve spent a lot of time on it.",
        "I can’t give you an answer now — I like to keep my options open.",
        "I can’t give you much for your theory. I don’t think it holds water.",
        "I can’t give you the exact location, but I can give you a rough idea of where it is.",
        "I can’t go and see him, after all the lies I’ve told.",
        "I can’t go out again. I’ve only (just) this moment got back.",
        "I can’t hear a sound — perhaps there’s no one at home.",
        "I can’t help feeling that he’s a crook and that we shouldn’t trust him.",
        "I can’t make this sort of decision without consulting my superiors.",
        "I can’t miss this meeting. I want to get there on time.",
        "I can’t pay out money for doing a thing like this.",
        "I caught the eye of the waiter, and he came to take my order.",
        "I certainly want to make a profit — but not if it involves exploiting people.",
        "I changed places with Vishal on the train, so I could sit next to Prakash.",
        "I could sell the car for Rs.75,000. I’m glad it’s off my hands at last.",
        "I could tell by the look on his face that he was in a bad mood.",
        "I could tell something was up by the look on his face.",
        "I could use two or three cups of coffee right now.",
        "I couldn’t bear the thought of letting them find out what had actually happened.",
        "I couldn’t do anything to help them. The whole situation was beyond/out of/outside my control.",
        "I couldn’t do the second question, but I’ve done all the others.",
        "I couldn’t find a parking space there, so I came back.",
        "I couldn’t raise enough money at that time to buy that house.",
        "I couldn’t see a tree as far as the eye could reach/see.",
        "I couldn’t very well refuse when he gave it to me.",
        "I decided to keep out of the way until they had left, and so I went into my bedroom.",
        "I decided to speak to him only after his face softened.",
        "I demand to speak to/see the Manager. I’ve got a complaint to make.",
        "I did everything I could to get him to change his mind, but it’s no go.",
        "I did nothing out of the way during the weekend — I just stayed at home and watched TV.",
        "I didn’t know any of the people in that office, and I felt out of place.",
        "I didn’t know anybody in that village, and I felt rather out of it there.",
        "I didn’t know his address, so I wrote to him care of his sister.",
        "I didn’t know how often buses were running at that time of night.",
        "I didn’t know much about office management when I started this job.",
        "I didn’t know that a car went with your new job.",
        "I didn’t know the glass was cracked — I cut my lip on it.",
        "I didn’t know they were interested in buying it at the time.",
        "I didn’t like any of those paintings — not that I’m any judge or anything.",
        "I didn’t like her, to begin with, but soon we became very friendly.",
        "I didn’t like him at first, but in the end I got quite fond of him.",
        "I didn’t like his speech/that novel. It was dull and serious.",
        "I didn’t like it at first, but I learnt to like it after a while.",
        "I didn’t like that film. I found it a bit hard going.",
        "I didn’t like that novel — it’s got absolutely nothing going for it.",
        "I didn’t like the film very much. Actually, I had expected better.",
        "I didn’t like the show. I must say I had hoped for better.",
        "I didn’t like the start of the book — it was rather dull.",
        "I didn’t like to accept the invitation, but my wife persuaded me to.",
        "I didn’t make a big profit, but I managed to come out on the right side.",
        "I didn’t pay for the TV all at once. I bought it on easy terms.",
        "I didn’t pick a quarrel with him, because I wanted to keep the peace in the office.",
        "I didn’t realize how serious this problem was — or I would’ve attacked it right away.",
        "I didn’t recognize him at first, because I was not wearing my glasses.",
        "I didn’t say anything — on the off chance somebody might be passing.",
        "I didn’t spill the milk — you did. Don’t expect me to clean up after you.",
        "I didn’t take off my clothes, but slept just as I was.",
        "I didn’t talk to him. You see, I was afraid to tip my hand by saying too much.",
        "I didn’t tell her — I didn’t want to embarrass her.",
        "I don’t agree with you, but let it go at that.",
        "I don’t believe a word of all this. I think he’s lying.",
        "I don’t believe he’s an expert cook. He doesn’t know the first thing about cooking.",
        "I don’t believe him. I think this story is a product of his imagination.",
        "I don’t care who get the contract — it’s all the same to me.",
        "I don’t doubt your word. I know you’re telling the truth.",
        "I don’t even want to think about it, much less to talk about it.",
        "I don’t expect any further fall in interest rates this year.",
        "I don’t feel (quite) right. Let me lie down and rest for a while.",
        "I don’t feel well at all. I think I’ll go to bed.",
        "I don’t have any money on me. You must take care of the bill.",
        "I don’t have much on and I’m free today. Can ask them to come.",
        "I don’t know how I’ll be able to make up for lost time.",
        "I don’t know how I’ll be able to put right the wrong I’ve done them.",
        "I don’t know how to go about dealing with a situation like that.",
        "I don’t know how to kill time until the train gets in.",
        "I asked him about it, but he laughed in my face and told me nothing.",
        "I tried to persuade him, but he wasn’t having any. (= not interested/didn’t listen/didn’t agree).",
        "I asked the Manager if I could go home a bit early, and he agreed. God/ Goodness/Heaven knows why. (= I don’t know why and I’m very surprised at this).",
        "I asked you a straight question — give me a straight answer.",
        "I backed him in the boxing contest, but he didn’t win.",
        "I banged on the door and rattled the knob. There was no answer.",
        "I believe he’s on the right lines. We can expect some results soon. (= likely to succeed in his efforts — because his method is sensible or right).",
        "I believe his house is just past the post office (= I think).",
        "I believe you had an argument with the boss about something.",
        "I bought a few things and I gave him Rs.10. He gave me Rs.1.50 change.",
        "I bought a kilo of sugar and I asked the grocer to charge it to my account.",
        "You can put the groceries/apples to my account.",
        "Little by little, her work improved.",
        "I bought it for 5000 rupees, and sold it for 6500 rupees, and I’m 1500 rupees to the good. (= I have Rs.1500 more than I had).",
        "I bought it for Rs.2589 — that is, Rs.2600 in round figures.",
        "I bought the TV for Rs.15,000, but I’m open to offers.",
        "I bought this car five years ago, and it has given good service. (= has been in active use and has been dependable).",
        "I can beat him at chess with one hand tied behind my back (= very easily).",
        "I can copy 25 pages a day — make it 30 pages if you like.",
        "I can hold out no hope that you’ll be selected. (= give you any reason to hope that…; offer you any hope).",
        "I can read him like a book — he loves her and wants to get married to her. (= understand his thoughts, motives, etc. clearly).",
        "I can remain awake all night if I can get a cup of tea once in a while.",
        "I can set you right on one thing. All this happened on Monday and not on Tuesday.",
        "I can sleep the night with my parents there and leave early in the morning. I don’t need a hotel room. (= sleep for that night in the house where my parents live).",
        "I can very well understand a parent’s concern for his children. (= anxiety about what is happening or what might happen to…).",
        "I can work this debt off in about 3 months time. (= repay it by working).",
        "I can’t accept that he’d do a thing like that (= believe that…).",
        "I can’t afford to buy a car like that. I don’t have that kind of money, you know. (= so much money).",
        "I can’t afford to buy it. I’ve been out of work for about six months now. (= unemployed).",
        "I can’t afford to wait. Give me a reply by tomorrow.",
        "I can’t argue the point, because I don’t know the whole story.",
        "I can’t ask him for a loan — that’s the last thing I want to do. (= I don’t want to do it at all).",
        "I can’t believe you gave Rs.500 for this shirt. It looks very cheap, you know.",
        "I can’t do with standing in the queue all day. (= can’t bear…).",
        "I can’t even begin to explain how I came to do such a foolish thing.",
        "I can’t even begin to imagine how anybody could be so cruel.",
        "I can’t even begin to tell you how grateful I am. (= I find it very hard to do this — I’m so grateful).",
        "I can’t find my wallet — I looked for it everywhere.",
        "I can’t get hold of their office. I think their telephone is out of order or something. (= make contact with).",
        "I can’t help thinking that he was serious about leaving the job. (= I think that …).",
        "I can’t help wondering why he’s been keeping the information secret so far. (= I wonder why …).",
        "I can’t imagine why, but she’s going to get married to that crook.",
        "I can’t keep it for long — I’ll have to give it back in a day or two.",
        "I can’t lend you any more money. You owe me 5000 rupees as it is (= already).",
        "I can’t let you pay for it. No, no. I wouldn’t hear of it.",
        "I can’t make out why he’s so upset today. (= understand).",
        "I couldn’t make out if he was serious about it.",
        "I can’t put up with his rude behaviour any more.",
        "I can’t put up with the way she behaved just now.",
        "I can’t read all this small print. I’ll only strain my/the eyes.",
        "I can’t remember a birthday when I received so many presents.",
        "I can’t say how much it’ll cost/why he resigned/when he’ll be back/… (= I don’t know).",
        "I can’t say I’ve read that book seriously, but I’ve had a dip into it. (= gone through it briefly).",
        "I can’t say if he has stolen your wallet, but I wouldn’t put it past him. (= he’s quite likely to do it; he’s capable of doing it).",
        "I can’t take on any more work now — I’ve got my hands full. (= I have a lot of work to do, and I’m busy).",
        "I can’t take this risk. I have too much to loose.",
        "I can’t take you to them or do anything like that. The most I can do is to put in a good word for you.",
        "I can’t think why he did a thing like that. (= I can’t imagine/understand why).",
        "I cannot accept that he’ll do a thing like that (= believe...).",
        "I comforted the child, making like its mother — and it stopped crying. (= behaving like).",
        "I consider you a good friend, and I’d like to keep it that way.",
        "I considered the whole issue again. But I still feel the same, and I don’t think I’m going to change my decision.",
        "I could do with a rest from all this hard work (= I need it).",
        "I could hardly believe my eyes when I saw him coming out of a pub.",
        "I could hardly believe my eyes when I saw him repairing the car. I never thought he was good with his hands.",
        "I could have been in deep trouble but for your help.",
        "I could have killed/murdered/strangled/hit him for telling a lie like that. (= I was so angry).",
        "I could have taken the quick way out of the situation by apologizing, but I didn’t want to do that.",
        "I could hear a cassette/record/tape/record player/radio playing in the next room.",
        "I could hear him loud and clear for some time. And then all of a sudden, the line went dead.",
        "I could hear music playing on the radio/TV in the next room.",
        "I could only crack that problem after a lot of effort.",
        "I don’t think the government is prepared to fight elections just now.",
        "I don’t think the government is prepared to risk (holding) an election now.",
        "I don’t think the Government really wanted to impose these restrictions. I think the food scarcity must have forced their hand.",
        "I don’t think the government will be able to break the power of the trade unions.",
        "I don’t think the hostages will be able to make a break from there.",
        "I don’t think the jokes were as funny as all that.",
        "I don’t think the new law is going to work changes in the way our political parties function.",
        "I don’t think the Prime Minister should resign now. That won’t be a sensible decision.",
        "I don’t think the situation is as bad as all that. He has overstated the case.",
        "I don’t think the staff will agree to the pay cuts. (= a reduction in pay).",
        "I don’t think there was just cause to dismiss those workers/for dismissing them. (= a fair reason).",
        "I don’t think there’s much/any fight left in him. He’s had enough.",
        "I don’t think these rumours are going to break him. (= crush him).",
        "I don’t think these shoes would go with this dress. (= look suitable with).",
        "I don’t think they murdered him for his money. There’s nothing to support the idea.",
        "I don’t think they stand a chance of winning this match."
    ]
}