{
    "key": [
        "Enough of this! Why do you keep teasing your sister like this? (= stop it).",
        "Excuse me, can I get past, please?",
        "Excuse me. Can you tell me the way to the station?",
        "Express your anger, by all means. But why can’t you do it in a quiet, controlled way?",
        "Fear? He doesn’t know the meaning of the word.",
        "First I must press this button, and then I must push this lever. Right? I think I’ve got the idea.",
        "Five hundred rupees for that shirt? That’s nothing/ little short of robbery.",
        "Get a move on! What are you waiting for?",
        "Get Shankar on the line, will you?",
        "Give her a hand with the dishes, will you?",
        "Give my shirt a quick press, will you?",
        "Go along with you! (= I don’t believe you!; you’re joking!). You’re only fooling, aren’t you?",
        "Go and sit down for a while. Haven’t you been on your feet all this time?",
        "Go through this letter she’s written. Does it make any sense to you?",
        "Good God! Is that what really happened?",
        "Hand him this letter, will you? (= give him).",
        "Hand me down that book from the top shelf, will you?",
        "Has he been accepted for the job/course?",
        "Has he gone to university?",
        "Has he made any plans for the future? Isn’t he going to retire next month?",
        "Has the cheque been cleared yet?",
        "Has your car/typewriter been regularly serviced?",
        "Has your little boy started school?",
        "Has your son learnt to tell the time?",
        "Has your son reached school age?",
        "Hasn’t he come back yet? How long will he be?",
        "Have I done anything wrong? If so, tell me frankly, and give me a chance to put things right.",
        "Have I done anything wrong? Why do you keep giving me such severe looks?",
        "Have I offended you in some way?",
        "Have the painters got started on the dining hall?",
        "Have the police solved that murder case yet?",
        "Have they announced when the show will start?",
        "Have they decided who should lead the team?",
        "Have they fixed up a place for the meeting?",
        "Have they fixed up a time for the meeting?",
        "Have they found it out, d’you think?",
        "Have they found the missing child yet?",
        "Have they given out their decision yet?",
        "Have they let the hostages go?",
        "Have those letters gone out to them yet? (= been sent).",
        "Have you any idea what this is/when he’ll be back?",
        "Have you any idea who he is/where they’ve kept it? (= Do you know…?).",
        "Have you been back long?",
        "Have you considered what they’ll think?",
        "Have you done that right? Check again.",
        "Have you done this subject at school/college/ university?",
        "Have you found any mistakes yet?",
        "Have you found the matches?",
        "Have you gone to Switzerland? Sharma says there’s no place like it for skiing. (= as good as it).",
        "Have you got a fair idea of what they want you to do?",
        "Have you got any experience of using computers?",
        "Have you got anything on next Monday?",
        "Have you got everything you need? Okay, we’re in business now.",
        "Have you got the right money for the bus/train? (= exact fare)",
        "Have you got the washing machine/ computer working yet?",
        "Have you had enough (to eat/drink)?",
        "Have you heard about Hari going abroad?",
        "Have you heard any news from John lately?",
        "Have you heard how he did it?",
        "Have you heard the one about the soldier and the cow? (= a joke/a funny story about…).",
        "Have you heard the result/news?",
        "Have you known him for long?",
        "Have you listed your interests on the form?",
        "Have you locked the door? Go back and make sure.",
        "Have you made a list of the people you want to invite?",
        "Have you made any late changes to the report after you showed it to me yesterday?",
        "Have you made any plans for the weekend/ your journey?",
        "Have you made enough copies of this report?",
        "Have you made tea/coffee for them?",
        "Have you noticed one thing? He’s always able to take the lead in any group. (= become the leader; put himself in the position of a leader).",
        "Have you planted your peas?",
        "Have you read all of the book? (= the whole book).",
        "Have you read his latest book? It’ll certainly take its place among the best works on this subject.",
        "Have you read the book right through? (= completely).",
        "Have you read today’s paper?",
        "Have you reported the matter to the police?",
        "Have you seen her brother? He’s very powerfully/heavily/well built.",
        "Have you seen our new computer system in action?",
        "Have you seen the current issue of the Reader’s Digest?",
        "Have you seen today’s paper? It gives the latest development in the spy scandal.",
        "Have you sent for a doctor? (= sent somebody to fetch him?).",
        "Have you served on this committee before?",
        "Have you signed on at the Employment Exchange? (= registered your name).",
        "Have you spent any of the money?",
        "Have you started the new tin of milk powder?",
        "Have you typed those letters?",
        "Have you visited any foreign countries?",
        "Have you watered the tomatoes today?",
        "Haven’t I seen you before somewhere?",
        "Haven’t I told you time after time not to do that?",
        "Haven’t you heard? The Prime Minister is going to resign.",
        "Haven’t you made a start on that work yet?",
        "He had a nasty cut on his head/hand/arm. How did he get it?",
        "He has a deep cut on his leg. Did he have an accident or something?",
        "He has a high colour. Is he ill or something? (= His face is reddish).",
        "He hasn’t had any food within the last hour. Can he take this medicine now?",
        "He isn’t expecting you, is he?",
        "He isn’t in — why don’t you call back later? (= telephone once again).",
        "He isn’t in any of those places. Where else could he have gone?",
        "He lied about his qualifications in order to get the job. How’s that?",
        "He paid you 1,00,000 for that old car? That’s not bad! (= very good).",
        "He says that the policemen came for a pre-employment verification or something. If that’s so, why did so many of them come? I think there’s more to this than meets the eye.",
        "He was trying to blackmail you, wasn’t he? I had suspected this from the first.",
        "He’s a great one for tennis. Have you played him at it yet?",
        "He’s already left. Why don’t you phone tomorrow?",
        "He’s an American, isn’t he? How long has he been over here? (= in this country).",
        "He’s been absent from work for over a week now. Is he ill or something?",
        "He’s bringing up food again. Why don’t you take him to the doctor?",
        "He’s going to be a candidate in this election. How do you rate his chances? (= Is he likely to win?).",
        "He’s going to get married, I hear?",
        "He’s just 18, and he wants to get married. Can you beat that? (= Isn’t it strange/ surprising!; Would you believe it!).",
        "He’s losing colour. Is he ill or something? (= becoming pale).",
        "He’s not my boss. Who gave you that idea?",
        "He’s on familiar terms with the Managing Director. Why don’t you ask him to put in a good word for you?",
        "He’s one of the best foot ball players we have. Have you seen him in action? (= while he’s playing?).",
        "He’s won first prize again. How lucky can you get?",
        "He’s won first prize. Who’d have thought it?",
        "Hello, Arun, how’s life? (= How are you?).",
        "Hello, Peter. How are you? What brings you here?",
        "Her cough sounds better, doesn’t it?",
        "Here’s the bus. Have you got the right money?",
        "Hey! What’s the idea? Photography is not allowed here.",
        "Hey! What’s up?",
        "Hi, Priya, how are things going?",
        "His attitude has changed over night. Can you imagine any reason for it?",
        "His political beliefs are beside the point — is he good at his job?",
        "How about a cup of coffee?",
        "How about going by car? (= what about).",
        "How about her other books? Were they instant successes too?",
        "How about his new novel? Did you like it? (= What do you think of…?).",
        "How about some (more) tomato soup/orange juice/coffee/tea?",
        "How about the movement towards greater freedom for women, then? Has it not been gaining ground and becoming widely accepted?",
        "How about the other troupe? Are they also booked up? Can’t we try and get them?",
        "How about this box then? Where’ll we keep it?",
        "How about Vishakh? Isn’t he coming?",
        "How about you, Purnima? Which of these do you want?",
        "How are the children?",
        "How are things coming along there?",
        "How are you doing in the new job?",
        "How are you feeling now?",
        "How are you going to carry through this plan?",
        "How are you going to get money to buy such a large house?",
        "How are you making progress in your training?",
        "How are you off for money? Do you want to buy anything when you go out?",
        "How are you off for writing paper?",
        "How are you placed for money?",
        "How are you situated for money?",
        "How are you these days?",
        "How are you today?",
        "How are your studies/training coming on/along?",
        "How bad is your back?",
        "How bad is your headache?",
        "How bad is your leg? Can you walk?",
        "How big (a city) is Mumbai?",
        "How can he call himself our friend after what he did?",
        "How can he keep a family on such a low salary?",
        "How can he take all the credit for completing the job on time? It was a team effort, you see.",
        "How can he teach this subject, when he doesn’t know the first thing about it?",
        "How can he walk so fast at his age?",
        "How can I do two things at a time? (= at the same time).",
        "How can I go to the party? I haven’t got a thing to wear.",
        "How can I keep track of what everybody does?",
        "How can I stop these things happening?",
        "How can I tell you what’s going to happen? I can’t see into the future.",
        "How can I write a cheque? I have nothing in the bank.",
        "How can they force us to accept a lower price?",
        "How can we give life to this party?",
        "How can you be free with your time like this when so much remains to be done?",
        "How can you beat her like that? Isn’t it next door to cruelty? (= close to; almost the same thing as).",
        "How can you blame him for something you’ve done? You’re a fine one to talk.",
        "How can you call yourself a mechanic? You don’t know a spanner from a screwdriver.",
        "How can you claim credit for my work?",
        "How can you claim this bag belongs to you when you don’t have a leg to stand on?",
        "How can you cut with the back of the knife? (= the edge that’s not used).",
        "How can you damage public property in the name of the student community?",
        "How can you deny his claim to ownership/the inheritance?",
        "How can you give up the responsibility for the project like this? Who will carry it out now?",
        "How can you go back on your promise? (= fail to keep it).",
        "How can you permit these killings in the name of religious beliefs?",
        "How can you refuse to accept responsibility for the mistake?",
        "How can you refuse to accept the truth of those facts?",
        "How can you show that that’s so?",
        "How can you show your face there after the way you insulted them last month?",
        "How can you shut your eyes to all the corruption that’s going on in this office?",
        "How can you turn your back on your solemn promises?",
        "How can you/could you be so cruel/cheap/stupid?",
        "How come you didn’t come for Asha’s wedding? (= Why is/was it that … ?; How does/did it happen that …?)",
        "How could he have got hold of that knife to cut the straps?",
        "How could they achieve such a profit rise this year?",
        "How could those prisoners make a break when the prison was so heavily guarded? (= escape).",
        "How could you trust a stranger with so much money? I think you’re out of your mind. (= crazy/very foolish).",
        "How did he come to know about it? I don’t understand.",
        "How did he get it into his head that I’ll be able to help him? (= believe/decide…).",
        "How did he get that cut on his foot?",
        "How did he get that horrible cut across his face?",
        "How did it come about that the accident happened at the traffic lights?",
        "How did the discussion go? How did you do with the new boss?",
        "How did the dog get free? It was chained.",
        "How did the party/interview go?",
        "How did they get to be so wealthy?",
        "How did those patients manage to go outside the hospital grounds?",
        "How did you become a businessman — how did you get your start?",
        "How did you break your husband of the habit of smoking?",
        "How did you come to be interested in this subject? (= happen to be).",
        "How did you come to sprain your ankle?",
        "How did you find the film?",
        "How did you find the right road?",
        "How did you get hold of this information?",
        "How did you get to be a writer/musician? (= become…).",
        "How did you learn of/about their secret plans? (= find out about…).",
        "How did you like the film/book?",
        "How did you manage to jump clear of the fence/hedge?",
        "How did you reach these figures?",
        "How do they issue materials from the Materials Department? What procedure do they follow? I’d like to see it in action.",
        "How do you find time to study?",
        "How do you find your new boss? Is he a good person to work with?",
        "How do you find your new job? (= Do you like it?).",
        "How do you get to work as a rule? By bus?",
        "How do you know a real diamond necklace from a fake? (= recognize each).",
        "How do you know he’s an expert? Don’t take him at (his) face value. (= immediately assume that he’s actually an expert without more information).",
        "How do you like Bombay?",
        "How do you like the new school? Have you made friends with anybody?",
        "How do you like your new job/my new hairstyle/new dress?",
        "How do you make use of your spare time?",
        "How do you manage to stay looking young/beautiful?",
        "How do you see the current situation in Sri Lanka?",
        "How do you spend your time?",
        "How do you want me to end this letter?",
        "How do you want me to make good the damage done to your car? I can either get it repaired for you or I can give you money for the repairs.",
        "How does he feel about having to get up early/ work on Sundays?",
        "How does it feel to be criticized in front of everybody?",
        "How does it feel to be married?",
        "How does this machine operate? Is it hard to learn?",
        "How else can we deal with this problem? Have you got any suggestion?",
        "How ever could you behave so rudely towards her?",
        "How far along are they in the negotiations/talks?",
        "How far along are you with your report/project/the work I gave you? (= How much of it have you done?).",
        "How far away is the Post Office?",
        "How far can you swim?",
        "How far can you throw?",
        "How far do you think can I trust him? (= How much…).",
        "How far does the road/path/canal continue? (= go).",
        "How far is it from Bombay to Bangalore?",
        "How far is it to the beach/the nearest petrol station/the motorway?",
        "How far is it to the Post Office?",
        "How have you taken to your new job?",
        "How high are we above the sea level?",
        "How in God’s name did you find it out?",
        "How is your grandfather? (= What’s his condition/state of health?).",
        "How long ago did you hear it? Half an hour?",
        "How long are the summer holidays?",
        "How long are you going to live on borrowed money?",
        "How long can he hide away from me? One of these days, I’ll lay my hands on him.",
        "How long can the company hope to stay alive by cutting costs?",
        "How long do these drug smugglers think they’ll be able to escape the long arm of the law?",
        "How long has this cold war been going on here?",
        "How long is his journey to work? About an hour?",
        "How long is that river?",
        "How long is the strike going to continue?",
        "How many books do you need for tomorrow’s class?",
        "How many books will this shelf take?",
        "How many candidates are standing in this election?",
        "How many children attend that school?",
        "How many days have we got left?",
        "How many passengers did the plane/ship/coach carry?",
        "How many people were there on the course?",
        "How many shoes do you polish (in) a day?",
        "How many telephone calls have we made so far this month? (= until now).",
        "How many times have I got to warn you against playing with that knife?",
        "How many words are there to a line?",
        "How many workers do they have on their books? (= are employed by them).",
        "How many years did he serve in the army?",
        "How much annual leave do you get?",
        "How much did the lunch/dinner come to?",
        "How much did the total cost of the outing come to?",
        "How much did you give for that TV?",
        "How much money did he make last year?",
        "How much money is available for spending?",
        "How much money/sugar/ oil do you need?",
        "How much of a loan has he taken?",
        "How much will these repairs cost? Can you give me an idea? (= Tell me approximately how much it’ll cost).",
        "How often do you go to Delhi?",
        "How soon can you do it?",
        "How soon will he come back?",
        "How was the journey/flight/meeting/party? (= What was it like?).",
        "How well do you know him?",
        "How will you raise the funds for the scheme?",
        "How would you fancy going for a film?",
        "How would you fancy roast chicken for dinner? (= Would you like…?).",
        "How would you like a kick in the ribs?",
        "How would you like to be ignored by your friends? (= How would you feel about it?).",
        "How would you like to go for a film?",
        "How would you like to have a mugger attack you in a dark street at night?",
        "How’s everybody at home? Are they all right? (= safe and well).",
        "How’s his track record as a Personal Manager?",
        "How’s Pran? I haven’t heard much of him since I retired. (= haven’t heard a lot about him very often).",
        "How’s that book/film/your new job? (= What’s your opinion of …?).",
        "How’s this for a present?",
        "Hurry up! Time’s getting on. You don’t want to miss the train, do you?",
        "I can’t find that book anywhere here. What did you do with it? (= Where did you put it?).",
        "I can’t read that notice. Can you?",
        "I can’t shell out more — do you think I’m made of money?",
        "I can’t start this car — can you give it a push?",
        "I couldn’t make anything of her strange behaviour?",
        "I don’t get it. Why did he get married to a woman 10 years older than him?",
        "I don’t get you/your meaning. Can you explain it once again? (= understand …)",
        "I don’t know how much money we have left. Where’s my wallet?",
        "I don’t like the look of it at all. Why did they go and meet your wife? If all they wanted to know was your family background, they could very well have asked you.",
        "I don’t like the sound of this — why haven’t they told us the price yet?",
        "I don’t like this hairstyle. How about you?",
        "I don’t think this tool kit is complete. Where’s that big spanner?",
        "I don’t want to buy you drinks any more. Why don’t you buy me a drink for a change?",
        "I don’t want you to quarrel with them over it. All right?",
        "I guess I’m a little late. Have you been waiting long?",
        "I had left my book/bag here. Has anybody moved it?",
        "I have a bone to pick with you. Why did you insult me like that yesterday?",
        "I have a very full day before me — why don’t you give me a buzz tomorrow?",
        "I have to go to the police station and meet a police officer tomorrow. Will you go with me?",
        "I hear (that) there’s a change in the programme?",
        "I know he can repair motor bikes. But is he (any) good at repairing cars?",
        "I know she was a school teacher for some time. But that’s beside the point. (= not relevant). Can she do shorthand? We’re looking for a secretary, you know.",
        "I know you didn’t like that film. But why do you go on about it continually like this?",
        "I like that! So you completely forgot you had asked me to wait there?",
        "I like this blue dress. But will the colour run when I wash it? (= Will the colour come out of the dress?).",
        "I make the answer 362. How about you?",
        "I make the total 7456. How about you?",
        "I need 50 rupees more for paying the taxi driver. Have you got any money on you?",
        "I prefer this red one. How about you?",
        "I saw you coming out of her house last night. What’s your game? (= Tell me what your secret plan is).",
        "I saw you having a conversation with him. Trying to feel him out about something? (= trying to find out what he thinks about sth).",
        "I should’ve kept it secret? What do you mean by that?",
        "I shouldn’t have said all those things, I give you that! But can’t you forgive me?",
        "I think he wants to see you. Why else would he come here?",
        "I think he’s got the push, or why didn’t Ajith invite him for the party? (= sent away from his job).",
        "I think the washing machine/the motor/ the engine is running. Who switched it on?",
        "I think this house is too big for us. But can you give me an idea of the price?",
        "I think we should accept this offer. Now then, do you want me to speak to them about it?",
        "I think you married the wrong man — do you hear?",
        "I thought you’d have finished it by now. How long will you be?",
        "I tried to guess at his position in the company. Could he be one of the General Managers?",
        "I want to ask him for a loan. Will you come and hold my hand? (= come with me and be there — so that I will be brave and confident).",
        "I want to get up early tomorrow. Can you call me at 5 o’clock? (= wake me).",
        "I won’t be able to attend the meeting tomorrow. What/How about you?",
        "I wonder what has become of that old man who used to do the gardening for them?",
        "I worked hard and finished the job on time. But what thanks did I get?",
        "I’ll be back in a minute. Could you keep my place in the queue?",
        "I’ll give you 10% discount. How’s that?",
        "I’ll go and have a bite to eat. Please mind the phone for some time, will you?",
        "I’ll pay for the damage to your car. How about that for settlement?",
        "I’m afraid he isn’t in. Why don’t you ring up after half an hour or so?",
        "I’m afraid I don’t have any free time today. Shall we meet tomorrow?",
        "I’m afraid I’m not with you. Could you explain that once more?",
        "I’m all set. Shall we go? (= ready).",
        "I’m giving a birthday party tomorrow night. Would you like to come?",
        "I’m going to do a bit of shopping. Do you want to come with me?",
        "I’m going to sleep for some time. If I’m not up by 8 o’ clock, give me a call, will you? (= wake me).",
        "I’m not feeling well today. Can you attend the meeting in my place? (= instead of).",
        "I’m not responsible to see that quotations are sent out on time. Why are you laying that responsibility at my door?",
        "I’m really shocked. How could you do/say such a thing?",
        "I’m too tall/fat, aren’t I? (= am I not?).",
        "I’m very busy today. But Friday is clear — can you come then?",
        "I’m writing to him today. Do you want to sent any message?",
        "I’ve always been nice to you — why do you have it in for me?",
        "I’ve always helped him with his work. Why can’t he help me just for once?",
        "I’ve gone through the estimate you’ve prepared. Can you give me a breakdown of some of the figures? (= an analysis/a division into smaller figures).",
        "I’ve got a bone to pick with you. Why haven’t you cleaned up this mess yet? (= I’m angry or annoyed with you about sth, and I want to discuss it with you).",
        "I’ve just had a thought. Suppose they think of bringing a suit against us — what’ll we do then?",
        "I’ve lost my car key there. Keep an eye open/out for it, will you?",
        "I’ve only known him a few weeks. How can I get married to him?",
        "I’ve seen all these. Can you show me anything new?"
    ]
}