{
    "1. Word groups for use while making a phone call ": [
        "Hello, is that the XYZ company?",
        "Hello, Kumar. Sekhar here.",
        "Hello, is Ajith there?",
        "Mr. Ravi Sekhar?",
        "Is that you, Bindu?",
        "It’s Priya.",
        "I’d like to speak to Ashok.",
        "This is Raju Varma of the XYX company. Mr. Kumar, did you receive my letter?",
        "Anil here.",
        "This is Rao — Anil Rao. And I’m speaking from the XYZ Bank.",
        "Could you connect me with the sales department, please?",
        "Good morning. This is Mr. Menon.",
        "Can you give me Mr. Ajith Varma, please?",
        "Could I speak to Mr. Ashok Bhat, please?",
        "I’d like to speak to the person in charge.",
        "This is James John speaking.",
        "My name is Jain — Suresh Jain.",
        "Oh, it’s you, Anil, is it?",
        "Is Sharon there, by any chance?",
        "Ahmed speaking.",
        "Put me on to your accounts department, please.",
        "Could you put me through to Mr. Dixit, please?",
        "You don’t know me, but our mutual friend, Bret, told me to call you.",
        "I’m ringing from the XYZ company.",
        "Good morning. Mr. Murthy here.",
        "I’m phoning you to find out when your Managing Director will be back from England.",
        "Could I have extension 532, please?",
        "Mr. Kumar, we haven’t met, but Mr. Shankar asked me to contact you.",
        "I had met him yesterday, and he suggested I should call him today.",
        "I want to get some information about a flight.",
        "What time could I reach him?",
        "I’m phoning to ask you whether you could spare us some time tomorrow afternoon.",
        "I rang you earlier, but I couldn’t get through.",
        "I know you don’t want to speak to me, but don’t hang up yet.",
        "Thank you for your help. Bye bye.",
        "I want a few details of your computers.",
        "Can you connect me with your Managing Director?",
        "Can you tell me when the trains to Bombay leave?",
        "You wanted to know about the arrangements, didn’t you?",
        "Here’s the position.",
        "Have you a moment to speak on the phone?",
        "When can I reach you?",
        "Will you please tell Mr. Sekhar that Ravi Kumar is on the line for him?",
        "Would tomorrow morning or tomorrow afternoon be more convenient for you to see me?",
        "Could I come at 10 o’clock instead of 11?",
        "Can I contact him tomorrow?",
        "Can I speak to someone in your sales department, please?",
        "Hello, this is Ajai — Ajai Menon.",
        "It’s a business matter.",
        "This is Suresh again. Sorry, we were cut off.",
        "I’m phoning back about your order for a computer.",
        "Can you confirm that you’ll be able to attend?",
        "I’m phoning you about an overdue payment.",
        "Those books you sent me — they’re not the ones I had ordered.",
        "I’ll phone again tomorrow.",
        "Would you confirm the delivery date, please?",
        "Would you confirm the price, please?",
        "I just wanted to tell you about tomorrow’s meeting.",
        "Could you tell me how long he’ll be away?",
        "My reason for calling you is this ...",
        "Okay. I’ll drop in tomorrow evening, then.",
        "You rang us up a few days ago about a computer.",
        "The reason that I’m phoning you is to ask a favour.",
        "I’m phoning you, because we’re having some problems with our computer.",
        "It’s about a letter he wrote to me.",
        "Will he be at the office tomorrow?",
        "I’ve got a bit of a problem here.",
        "Listen. Tomorrow’s meeting — it’s been put off.",
        "I need some information from you.",
        "I’m afraid I have to make a serious complaint.",
        "Thanks a lot — goodbye.",
        "I bought a TV from you last week, and I’m having some problems with it.",
        "I need the price of your washing machine.",
        "Good morning, Mr. Arora, I’m sorry to disturb you.",
        "I’d like to speak to someone about an order.",
        "I’m looking for some information on your new motor bike.",
        "I’d like to speak to somebody about an ad I saw today.",
        "I’d like to know the price for a double-room for one night.",
        "As you know, our company is doing some work for you.",
        "Will you be able to see me tomorrow or day after tomorrow?",
        "Is that the XYZ hotel? ... I’d like to make a reservation for tomorrow, please.",
        "I’ve got good news for you.",
        "I’d like to ask your advice about something.",
        "Let me give you my phone number.",
        "Listen. The book you wanted — I’ve got it here.",
        "You remember the computer we bought from you. I’m phoning you about it.",
        "He asked me to call him when I got back to Bombay.",
        "I have a price query.",
        "You wanted to know our prices, didn’t you? Here they are.",
        "Would you ask him to ring me back when he comes in?",
        "I must have dialled the wrong number.",
        "Can I get in touch with you again after I get a reply from the XYZ company?",
        "Okay then. You’ll be hearing from me. Goodbye.",
        "Have you got a note pad handy?",
        "You asked me to call back today.",
        "I’m going to be in your area next week.",
        "I’ll telephone you again when it’s delivered.",
        "You asked me to ring when I was in town again.",
        "I’m ringing from the post office.",
        "Would you check if he’s in John’s office, please?",
        "Will morning or afternoon suit you best?",
        "This is the number I was asked to ring.",
        "That’s what I wanted to talk to you about.",
        "Isn’t that the XYZ company? So sorry.",
        "Do you know when he’ll be back.",
        "I’d like to talk to someone about a bill I received from you today.",
        "I’ll ring him at about 10 tomorrow, then.",
        "You’ll remember I spoke to you last week about a washing machine.",
        "It’s about the computer I bought from you.",
        "I’ll be in touch with you.",
        "Okay, bye bye.",
        "I’m phoning for some prices for computers.",
        "You know we were talking about the car you wanted to sell.",
        "I’m phoning about the order we had placed last month.",
        "I got your letter today, and I’m phoning to save time.",
        "Can you help me find out something about your prices? ...",
        "That’s why I’m phoning.",
        "What I really wanted to tell you is this: ...",
        "Please ask him to call me back. He has my number...",
        "That’s what I’m ringing about.",
        "Just one more question.",
        "I tried to get hold of him at his hotel, but there was no reply.",
        "Madhu, can I ask you to do me a favour?",
        "I can’t get any satisfaction from your deputy, that’s why I’m phoning you.",
        "Please tell him I called.",
        "You know that book you wanted me to buy. I can’t find it in any of the book shops here.",
        "You asked me to confirm the arrangements.",
        "What time will he be there?",
        "Sorry to have troubled you.",
        "I can’t get a dialling tone on my phone.",
        "I’ll hold on, if it won’t take too long.",
        "Can you send someone to look for him?",
        "I can ring up later if it’s convenient.",
        "You’ll be hearing from me again on next Monday.",
        "One other thing. I’ll be at a conference all day tomorrow.",
        "Could you ring me back tomorrow?",
        "I’d like some information on your new washing machine.",
        "He asked me to confirm as soon as possible.",
        "You wanted some details, didn’t you? Here they are.",
        "He asked me to call this evening.",
        "There’s a serious problem, I’m afraid, and I’m phoning you about it.",
        "I’ll ring again then.",
        "Once again, many thanks. Bye bye.",
        "I’m phoning you to find out the price of your washing machine.",
        "You know the quote you gave us for 50 ceiling fans last week. I’d like to order 4",
        "I’d like to know the price for a double-room.",
        "Think about it, and then perhaps you’ll call me back.",
        "If I’m not in, please leave a message with my secretary.",
        "Are you sure he isn’t there?",
        "I’ll call you back in the evening, would 4 o’clock suit you?",
        "Mr. Arora, it’s about the invoice you sent us yesterday.",
        "Would Friday 4 o’clock be suitable or Saturday 11 o’clock?",
        "Can I leave a message?",
        "Okay. Bye now.",
        "I wanted to let you know where you can contact me.",
        "Let’s settle the matter while we’re on the telephone.",
        "I’m phoning you, because it looks as though I won’t be able to keep the appointment we made.",
        "Are you there, Mr. Joshi?",
        "I’d like to book a room for two nights.",
        "If I’m not there, please leave a message for me.",
        "When you’ve checked things at your end, would you let me know?",
        "I’ll call him back well before 5. ",
        "Could you tell him I’m arriving on the evening flight?",
        "Bye then.",
        "Bye for now.",
        "I’m phoning you about a serious matter.",
        "So long. Bye now.",
        "Let him know I’ve received his packet.",
        "I’ve seen your ad in today’s Indian Express. I’d like to know your prices.",
        "Goodbye for now.",
        "Could you ask him about the order we had placed?"
    ],
    "2. Word groups for use while answering a phone call ": [
        "XYZ company here. Can I help you?",
        "Who’s calling?",
        "Ashok here.",
        "Hold the line, please.",
        "Who’s that calling?",
        "Ajith, good to hear from you. How are you keeping?",
        "Who’s speaking?",
        "Who’s this speaking?",
        "Who am I speaking to?",
        "Who would you like to speak to?",
        "Just a moment please.",
        "How can I help you?",
        "May I ask what it’s about?",
        "Accounts department — can I help you?",
        "What can I do for you?",
        "May I ask who you’re looking for?",
        "He won’t be in all morning. Can I help you?",
        "Can somebody else help you?",
        "What number are you calling?",
        "I’m afraid you’ve got the wrong number.",
        "He isn’t in at the moment. Can I help you?",
        "Could you hold on a minute?",
        "I’m afraid this is rather a bad line. Could you repeat that, please?",
        "I’ll see if he’s here.",
        "I’m afraid he’s not in yet.",
        "He is in a meeting at the moment.",
        "Is it to do with accounts?",
        "Could you give me your name, please?",
        "Hang on for a moment. Let me just check.",
        "Please hold on. He’s on the other line.",
        "Hold on, I’ll tell him you’re calling.",
        "He’s in a meeting with the General Manager at the moment.",
        "Hold on, please — I’m just trying to connect you.",
        "Is it to do with a sales query?",
        "Where are you ringing from?",
        "I’ll just have a look. Ah, here he is.",
        "Nobody by that name works here.",
        "Hang on just a minute.",
        "I’m sorry, there’s no such person here.",
        "Shall I ask him to call you when he’s free?",
        "I’ll phone you back as soon as possible.",
        "Who did you say you wanted to speak to?",
        "Would you like to ring back later?",
        "Could I have your number again, please?",
        "I’ll call you back tonight.",
        "Is it about an order?",
        "What seems to be the problem, Mr. Alfredo?",
        "He’ll only be in till 5 o’clock.",
        "He’s gone home. Can I take a message?",
        "If you give me your phone number, I’ll call you back.",
        "I’m afraid his phone’s engaged. Will you hold the line?",
        "He isn’t in at the moment. Can I give him a message?",
        "Okay then. I’ll give you a call at your hotel.",
        "Would you repeat your name, please?",
        "This is a very bad line, I’m afraid. Sounds as if you’re miles away.",
        "The extension is engaged. Would you like to hold the line or call back later?",
        "Would you hold on, please?",
        "Sorry, there’s no Mr. Panicker at this number.",
        "He’s at a conference in Bangalore.",
        "Is it to do with a delivery query?",
        "You can reach him any afternoon after two.",
        "I can give you his home number if it’s urgent.",
        "Thanks a lot. Goodbye.",
        "His phone is ringing, but there’s no reply. I’m the switchboard operator.",
        "I’m very sorry to hear this, Mr. Sekhar.",
        "Sorry, he’s out of town. May I help you?",
        "The line’s engaged. Would you like to hang on or call back later?",
        "I’m afraid he isn’t in. What would you like to know?",
        "Could you tell me who you want to speak to, please?",
        "It isn’t convenient to talk at the moment. I’m in the middle of a meeting. I’ll call you back later.",
        "Sorry, the number is changed.",
        "Hello, Shankar. Good to hear from you.",
        "He’ll be back at about 4",
        "But please confirm your booking in writing.",
        "The line isn’t very good. Can I ring you back?",
        "Thanks for calling.",
        "Ring me again if you need any further information.",
        "I’ll look into it right away, and I’ll ring you back.",
        "What do you want to see me about?",
        "He’s out of the office at the moment.",
        "He had to leave for Bombay suddenly yesterday.",
        "Sorry, he’s just gone out.",
        "He’s with the Managing Director in a meeting. Mr. Gupta is here. Would you like to speak to him?",
        "I didn’t recognize your voice.",
        "Look, I’m rather busy at the moment. Can I call you back?",
        "I’ll be in all evening today.",
        "I was just planning to phone you in fact.",
        "You can reach him at home.",
        "No, this isn’t the number you want.",
        "That’s our number all right, but this is not the XYZ company.",
        "I’ll see if he’s in at the office.",
        "You can telephone me personally if ever you require service.",
        "I’ll ring you back, if you like.",
        "Hold on — I’ll get you the information you need.",
        "He’s away for a few days.",
        "I had better ring off now. Dad’s waiting for me outside. Okay — bye-bye.",
        "It’d take too long to give you all the prices and terms on the phone. Why don’t you come down here?",
        "I’ll be in a meeting all evening.",
        "Could you possibly speak more slowly?",
        "What is it all about?",
        "Could you give me your telephone number, please?",
        "I’ll just note that down.",
        "There’s no person of that name here.",
        "Let me ring you back in about half an hour.",
        "I can’t tell you right now. I’ll call you back.",
        "He’s away on a business trip.",
        "Sorry, I didn’t catch that. Could you repeat it, please?",
        "Okay. I’ll see to that.",
        "If I haven’t confirmed by this weekend, get in touch again.",
        "Sorry to keep you waiting. He is on the other phone.",
        "That’s a difficult question to answer.",
        "I’ll put you through to our accounts department.",
        "Thanks for letting us know the mistake.",
        "Sorry, this is the wrong extension.",
        "Who did you say you were?",
        "Hold on. I’ll try to connect you.",
        "I can hardly recognize your voice. It’s as though you’re miles away.",
        "Can I let you know the situation tomorrow?",
        "There’s no one by that name here.",
        "You can ring him at his hotel.",
        "You know that order for three computers we placed with you last week? I’m calling you about it.",
        "Sorry, I didn’t catch the name of the company. Could you repeat it?",
        "Could you give me your phone number?",
        "I’ll connect you with our accountant.",
        "Hello, I can connect you now.",
        "Thanks very much for ringing.",
        "Thank you for calling, Mr. Peter.",
        "Well, I’m glad to hear that.",
        "I haven’t any time to talk just now. Can I ring you back in an hour?",
        "I think that’s okay by me. I’ll ring you back, shall I?",
        "Speak a bit louder, will you?",
        "You must have the wrong Sharma from the phone book.",
        "You asked me to call back about the partnership deed.",
        "Could you give me a fuller description?",
        "All right, I’ll see to it and you’ll get a call today.",
        "Sorry, I couldn’t hear what you said.",
        "I’ll let you know as soon as I can. He’s busy all weekend.",
        "I’ll tell you what I can do. I’ll... Give me a call tomorrow.",
        "I’m sure to have some news for you.",
        "Can you call me back in a few minutes?",
        "I’m glad you rang back so soon.",
        "I’d be glad to see you if you’re in this area.",
        "How do you spell your name?",
        "Is there anything else I can do for you?",
        "I need to know the reference number, please.",
        "I don’t know his number off hand, but I can easily look it up for you.",
        "Could I have your name and address?"
    ],
    "3. Word groups to speak about telephoning in general ": [
        "I have to make a telephone call.",
        "He spoke to me by (or on) the telephone last night.",
        "She telephones every week.",
        "The phone’s ringing, pick it up, will you?",
        "Can I use your phone?",
        "I picked up the receiver to make a call, but there was no dialling tone.",
        "I had/received a call from him last night.",
        "You’re wanted on the telephone.",
        "I’ve tried several times to ring his office, but there’s no reply.",
        "He dialled his secretary and said something in to the phone.",
        "The telephone’s out of order.",
        "Your wife was on the telephone earlier. She wanted you to call her back.",
        "You can phone me tonight.",
        "He lifted the receiver and dialled the number.",
        "Phone the hospital.",
        "He can always be reached on the office telephone.",
        "I phoned you, but the line was engaged and I couldn’t get through (to you).",
        "What’s the dialling code for Bombay?",
        "As soon as the telephone rang, he picked up the receiver.",
        "Somebody wants you on the telephone.",
        "He rang me last night about the meeting.",
        "Can I contact you by phone?",
        "It’s his dad on the phone.",
        "I dialled the number, but there was no answer.",
        "I’ll be back in a minute. If the telephone rings, answer it, will you?",
        "Put in the money before dialling.",
        "The telephone’s on the blink again.",
        "There’s Mr. Sekhar on the phone for you.",
        "I want to make a call to my father.",
        "I couldn’t pass on the message to them last night. They’re not on the telephone yet, you know.",
        "Is there a public call-box around here?",
        "What’s the code/ dialling code for London?",
        "What’s the area code for New York?",
        "I can’t tell you all this over the phone.",
        "Is there a phone number where I can contact him?",
        "I’ll have to ring off now — I’ll call you back later.",
        "Get on to the airline at once and see if the flight is delayed.",
        "I was in the bathroom and I couldn’t take the call.",
        "Get them on the phone, will you?",
        "Can I make a quick telephone call?",
        "If he isn’t there, dial his home number.",
        "Ring the police at once.",
        "I have been telephoning all day, but I haven’t been able to speak to him.",
        "I think he has left his phone off the hook.",
        "I think he has switched off the handset.",
        "He didn’t want any calls to disturb him, so he took the phone off the hook.",
        "He was talking on the telephone.",
        "She passed on the message and put down the phone.",
        "There’s no reply from this number.",
        "There’s no reply from his extension.",
        "How do I call the operator?",
        "There’s a phone call for you.",
        "The telephone’s ringing. Can you pick it up?",
        "Put the receiver down and call again.",
        "He was very angry and he slammed down the telephone.",
        "I had a bad (or poor) line and I couldn’t hear clearly what he was saying.",
        "Her voice was very clear on the telephone.",
        "He picked up the phone and passed it over.",
        "He spoke for a few minutes and then replaced the receiver.",
        "He hung up before I could explain.",
        "They telephoned the good news immediately.",
        "You can always reach me by telephone.",
        "If you don’t want to be disturbed, leave the phone off the hook.",
        "He telephoned from his hotel room.",
        "The telephone went dead in the middle of our conversation.",
        "I picked up the telephone, but the line was dead.",
        "He hurled insults at me on the telephone and I had to hang up (on him).",
        "Who answered the phone?",
        "You can’t telephone Kodaikanal directly from here.",
        "He telephoned a warning immediately.",
        "Is that the phone ringing?",
        "How do I dial London from here?",
        "Go and telephone the traffic police.",
        "Were there any calls for me while I was out?",
        "He asked if you’d ring him back when you got in."
    ]
}