{
    "key": [
        "Our plan was to leave early [in the morning].",
        "I’m planning to [fly to] Singapore next month.",
        "Last month we [did a sight-seeing tour].",
        "The tourist season is [at its height] in August and September.",
        "It’ll cost you Rs. 3,000 or so to [fly to] Delhi.",
        "You needn’t add any tips.",
        "Can I have a room for the night, please?",
        "Please book me [on the evening flight], will you?",
        "You’ll have to book [well in advance].",
        "If we don’t book now, we probably won’t get a flight.",
        "Last year we made a coach tour of Madhya Pradesh.",
        "The Air India flight was cancelled, and we had to book [on another airline].",
        "I think I’ll have to [make a trip] to Delhi [this weekend].",
        "The flight leaves at 4, so check-in is at about 3.45 or so.",
        "Holiday prices are lower [out of season].",
        "Let’s not take much luggage — let’s travel light.",
        "Are you travelling first class or second?",
        "We went on a guided tour of the museum.",
        "Where are you going for your holidays?",
        "What’s the price of a flight to London [at the moment]?",
        "Let’s go on an outing [this weekend].",
        "They [stopped over] in London for a day [on the way] to New York.",
        "The price of the holiday includes flights and accommodation.",
        "They travelled the length and breadth of Africa.",
        "They [put us up] for the night.",
        "I want to be sure of flying tomorrow.",
        "Can you book a ticket for me?",
        "This is where we get on the bus.",
        "What flight is it? BA438?",
        "There, we did a tour of the ruins.",
        "The hotel is convenient for the beach.",
        "He’s going to Bombay tomorrow [on business].",
        "When does the Air India flight [take off]?",
        "I didn’t bring that big bag. I wanted to [travel light], you know.",
        "That’s an overnight train.",
        "I did a one-month tour in France.",
        "Did you have a good journey?",
        "When did you get back from holiday?",
        "Do you want to fly first or economy class?",
        "We had an outing to the seaside last week.",
        "There’s a small additional charge for the use of the swimming pool.",
        "We missed the 4 o’clock bus.",
        "We checked in at the hotel last night.",
        "We haven’t any single rooms left.",
        "He always travels first class.",
        "All the arrangements have been made.",
        "Do you have room reservations?",
        "We got a guide to take us round the sights.",
        "What would you do if the flight was cancelled?",
        "In the afternoon, we made a tour of the palace.",
        "It was a good hotel, but it was rather noisy.",
        "He was carrying a rucksack on his back.",
        "Transport facilities are good in that area.",
        "We often have last-minute cancellations.",
        "It’s a long train journey from here to there.",
        "I’m thinking of going on holiday next month.",
        "When will you be going? Next month?",
        "They’ve [gone on a trip] to the seaside.",
        "He left home to travel, and he was hoping for excitement and adventure.",
        "I don’t like bus journeys much. I’d rather travel in a car.",
        "You’ll be served breakfast in your room.",
        "Let’s [go first class] [this time]. Don’t book second class.",
        "He’s [due to arrive] [on the morning flight].",
        "There are no vacancies [on the flight].",
        "The price of the holiday includes accommodation and breakfast.",
        "We must go on a tour of the museum tomorrow.",
        "I’ll need some extra money for the holidays.",
        "We joined the passengers waiting to [get on the bus].",
        "I helped him carry his luggage to the train.",
        "What are your hotel rates?",
        "This is a long flight.",
        "We broke our journey at Nagpur.",
        "They had nothing to declare, and they [went straight] [through customs].",
        "We’re going to Kashmir for our holidays.",
        "I’m planning a short holiday, maybe a week or so.",
        "The beach was packed with people.",
        "We spent two days in Delhi, and after that, we went to Agra.",
        "I had to run fast to catch the bus.",
        "You needn’t trouble to meet me. I’ll hire a car and come.",
        "This time he’s going by air.",
        "Would you like a single room or double?",
        "There are no vacancies in the hotel.",
        "We stayed at a hotel by the sea.",
        "You’ll have to book [in advance] if you’re travelling [by train].",
        "He’s touring (in) Singapore.",
        "Which way is north?",
        "Is it cheaper [by train]?",
        "The Bombay flight arrives at noon.",
        "While we are in Delhi, we should visit Agra.",
        "We did the trip [in two stages].",
        "We stayed two nights at that hotel.",
        "How long would you like to stay?",
        "Did you have a good journey?",
        "The journey should take about five hours.",
        "The journey is quicker by land than by sea.",
        "All our rooms have been reserved.",
        "I’d like a room with a view over the city.",
        "I’d like to go. But it’s such an expensive journey.",
        "Are there any places left on that flight?",
        "There was a rail strike, so we had no choice but to stay on in Bombay.",
        "He saw us off at the station.",
        "He isn’t old enough to travel alone.",
        "Kodaikanal is full of tourists in the summer.",
        "Sorry, we’re fully booked for the night. Why don’t you try the XYZ hotel?",
        "When we were in Delhi, last month, we visited the Red Fort.",
        "This ticket is valid for any flight on that route.",
        "Last year they went on pilgrimage to Haridwar.",
        "It’s quicker to travel [by train].",
        "I’ll have to [catch the evening flight] to Bombay.",
        "When is it you’d like to leave?",
        "I went on a long train journey last month.",
        "That’s an expensive country to visit.",
        "Train is much quicker.",
        "Let’s not travel by air — let’s travel over land.",
        "Sorry, we’re fully booked up.",
        "I can try to find another hotel for you, if you like.",
        "I have an open ticket for that route.",
        "We made the booking a month [in advance].",
        "Did you manage to make a booking?",
        "We’re planning to book into the XYZ hotel on Friday evening.",
        "We saw some amazing sights at the zoo.",
        "The train was delayed for hours and the wait seemed endless.",
        "Be sure to call and confirm your flight at least 48 hours before departure.",
        "I’ll look you up when I come to Delhi.",
        "(At a hotel:) You have a reservation for me for today.",
        "Ahmed is thinking of making a pilgrimage to Mecca.",
        "This time let’s travel in comfort.",
        "We spent a lot of our holiday sight-seeing in Delhi.",
        "There’s one thing with the British Airways flight. The time might be more convenient for us.",
        "It’s a day’s journey by bus.",
        "I did some cross-words to amuse myself on the journey.",
        "It’ll cost you to go [by train], so why not go by bus?",
        "We didn’t break the journey — we travelled non-stop.",
        "Is there a dining car on the train?",
        "Is there a direct flight from Bombay to Rome?",
        "Can you hold the rooms for us till tomorrow?",
        "Don’t hurry; we’re not late.",
        "We got off the bus at the last stop.",
        "We left town last night [on a bus].",
        "That hotel offers a range of leisure activities.",
        "I went with them to see the sights of Delhi.",
        "Cost is an important element when we’re thinking of holidays.",
        "What’s the departure time of the flight?",
        "Is there a connecting flight to Rome?",
        "I went and saw him when I was in Bombay last week.",
        "The flight is fully booked.",
        "Every year thousands of pilgrims visit Mecca.",
        "Everyone except Smitha is going [on the trip].",
        "We’re thinking of going on a conducted tour.",
        "The Air India flight leaves much earlier, at 5.45 a.m.",
        "Can you drive me to the station?",
        "10% will be added on to your bill as a service charge.",
        "We didn’t break the journey anywhere — we travelled through.",
        "The journey won’t cost you a penny if you go with them.",
        "Could you arrange for Mr. Desai to be met at the airport?",
        "Can you call a taxi for me?",
        "He had already booked us in at the XYZ hotel.",
        "I enjoyed the holiday enormously.",
        "My baggage is missing.",
        "Our car [broke down] [on the way], and we had to hitch a ride to Madras on a lorry.",
        "The most direct route is through the city centre.",
        "I got on the train at Pune.",
        "I got on at Pune.",
        "What kind of transportation is available from airport into town?",
        "I came across an old friend in Goa.",
        "I’d like to take an earlier flight back if possible.",
        "We went for a sail [in the evening].",
        "You needn’t concern yourself with the hotel booking. The travel agent will take care of it.",
        "He took us to see the sights of Bombay.",
        "And the other flight — when’s that?",
        "We’re going on a guided tour tomorrow.",
        "The train had just left when we got to the station.",
        "We made an overnight stop at Pune.",
        "The plane was an hour late.",
        "You had better take a taxi from the airport.",
        "They were put up at the Holiday Inn.",
        "They put up at the Dwaraka Hotel.",
        "That hotel may not be too luxurious, but quite comfortable.",
        "Can I hitch a lift with you as far as the station?",
        "The hotel wasn’t very good. We had expected better.",
        "I got off the train at Dadar.",
        "I’m catching a plane to London at 4.00 p.m.",
        "He makes several business visits to Bombay every month.",
        "My name’s on the waiting list.",
        "Visitors are not allowed to take photographs there.",
        "What time is the plane due?",
        "He has gone off on his travels again.",
        "I spent my holidays touring.",
        "I spent my holidays touring Kerala.",
        "That flight leaves rather late [in the evening].",
        "We can’t afford a holiday abroad.",
        "There was a wonderful view from the top of the hill.",
        "We stayed the night at Lucknow.",
        "I’d like to change a flight-booking, please.",
        "I’m planning to leave in about two week’s time. But I haven’t made a booking yet.",
        "They offered to put us up for the night.",
        "The next day we continued our journey.",
        "Have you packed your stuff?",
        "Should I hire a car?",
        "I love to go travelling.",
        "Is she well enough to travel?",
        "If we average 50 kilometers per hour, we should arrive at about 2 o’clock.",
        "Hasn’t the train come in yet?",
        "I want to go to the airport.",
        "She’s too ill to travel.",
        "We found a guide, and he knew the city well.",
        "Did you enjoy your stay at the hotel?",
        "I want to travel and see something of life.",
        "We’re going to go touring [this weekend].",
        "That’s a ticket on the Air India and not on the British Airways.",
        "He’s due to land at 4 o’clock.",
        "If you want to go in June, you had better book your tickets now.",
        "I want to go on a world tour.",
        "Would you like to go on the trip this evening?",
        "I’ll check with the airline.",
        "We made camp for the night [by a river].",
        "It’s cheaper by bus than [by train].",
        "Can I pay by credit card?",
        "He loves travelling.",
        "I’m going on holiday next month.",
        "I’ve booked a double room at XYZ hotel.",
        "I’d like a taxi in about half an hour’s time.",
        "We travelled 500 kilometres or so yesterday.",
        "I flew here from Bombay last night.",
        "You need a guide to show you the castle.",
        "Car hire is very expensive there.",
        "We [stayed overnight] at a friend’s house.",
        "What would it cost if I flew Air India? Rs. 8,000?",
        "We loaded our baggage into the car.",
        "When I went to Delhi, I went on a few trips to places nearby.",
        "I’m booked on an Air India flight to London this Thursday. It looks as though I’ll have to change my booking.",
        "Could you book that flight for me, then?",
        "Let’s go camping.",
        "There’s a frequent bus service from the city centre to the airport.",
        "What’s the public transport like?",
        "Do trains and buses run frequently?",
        "He has travelled the whole country.",
        "I’ll do my packing in the morning.",
        "The train got in very late.",
        "He’s expected to arrive in Bombay by 11.00 a.m.",
        "Let’s go and wander about the hills.",
        "Can you find us a good hotel?",
        "When you leave the plane you’ll have to go through customs and immigration.",
        "We were given a [tour of the place].",
        "The British Airways flight would be slightly more — Rs. 9,500 or so.",
        "From Madras, we went to excursions to a few places nearby.",
        "Is there a bank near here where I can change some traveller’s cheques?",
        "You’ll have to show your passport at the check-in desk.",
        "They made an overnight stop in London.",
        "Buses don’t run frequently in that area.",
        "The time of the other flight is rather more convenient.",
        "We broke camp in the morning and left for home.",
        "We missed our connection to Singapore.",
        "He’s planning to write an account of his travels.",
        "Do you have a single room free for Friday night?",
        "What time did you start out?",
        "What’s the changed departure time?",
        "We’re touring round Goa during our holidays this year.",
        "Several airlines fly the same route.",
        "We spent the night at a hotel.",
        "What time does the train get in, do you know?",
        "What about the return flight?",
        "Let’s make an excursion to the mountains.",
        "It’s a long way to drive. Why don’t we take a train?",
        "We put up our tents [by a river].",
        "I think this time-table is out-ofdate.",
        "And when’ll you be returning?",
        "That night, we camped in the hills.",
        "When the bus stopped, we all got off.",
        "This holiday has been excellent value for money.",
        "Have you booked your flight yet?",
        "We travelled over by car.",
        "I’m looking for a cheap hotel for the night.",
        "I’ll leave buying the tickets to you.",
        "Can you give me a [lift into town]?",
        "You can fly on the morning flight.",
        "Where are you [bound for]? Bombay?",
        "The arrival time of the flight is 4.30.",
        "I left the key at reception.",
        "I left the key at the desk.",
        "He likes travelling on his own.",
        "The plane got in at 5 o’clock.",
        "The other flight lands [in the evening].",
        "Last month I made a journey to Bombay.",
        "Baggage should be checked in at least an hour before the flight.",
        "Let’s [pitch camp] here.",
        "Are there any seats left?",
        "That’s an expensive hotel.",
        "We went to Goa for a holiday.",
        "I’d like to go on holiday, but I can’t find the money.",
        "He took us on a tour of the city.",
        "We’ll visit Goa [on our way home].",
        "He blew all his savings [on a trip] to Goa.",
        "I’ll leave it you to buy the tickets.",
        "He’s arriving [on the evening flight]."
    ]
}