{
    " Group 1 ": [
        "When I try to start the engine, it cuts out.",
        "You should wash and dry your car once a week.",
        "Turn on the headlights, and try cranking again.",
        "Check if the oil level is low.",
        "I want to get my back tyre changed.",
        "I think my car doesn’t perform well at high speeds.",
        "I’ll have to get my brakes adjusted.",
        "The engine runs, but backfires.",
        "Driving habits and high speed are the main causes of this problem.",
        "The battery has to be replaced.",
        "The brake pedal is not firm.",
        "There’s a crease in the bodywork here. Get it repaired immediately.",
        "The mechanic says the fuel pump is faulty.",
        "The engine starts, but stops soon after.",
        "The water pump has developed leaks.",
        "The brakes are too noisy.",
        "My car won’t start — I think the battery is dead.",
        "He says this problem is caused by defective ignition.",
        "My tyre has gone flat — I think it has a slow puncture.",
        "I started a bit late, because I wanted to avoid the rush hour traffic.",
        "Have you checked the level of the oil in the oil pan? Use the dipstick.",
        "Have they checked the condition of the battery?",
        "The spark plug has worn.",
        "You must replace it with a new one.",
        "The engine stalls when idling.",
        "Did the problem develop suddenly or gradually over a period of time?",
        "There’s a lot of caked mud on the underside of the body.",
        "This problem is due to a completely dead battery.",
        "I think the oil should be drained and clean oil added.",
        "The engine doesn’t start in damp/wet weather.",
        "The engine continues to run after the ignition is turned off.",
        "Gears clash when changing into reverse.",
        "When the engine is running, the charge indicator on the instrument panel shows no charge.",
        "Ask your mechanic to look over the car — the engine seems to lack power.",
        "Can you make a quick check of the engine?",
        "Ask them to test the battery.",
        "I’m taking the car in to have it serviced tomorrow.",
        "You should check the paintwork regularly. If there’s any damage, you must get it repaired at once.",
        "The fuel pump has failed — we’ll have to fit a new replacement.",
        "The gears don’t seem to engage smoothly.",
        "The water pump seems to have developed noise.",
        "This tyre has never punctured.",
        "I think this spark plug is defective.",
        "The parking lights are weak.",
        "The engine stalls when I change into gear.",
        "The trouble could be in the ignition system or the fuel system.",
        "I want to get the idle speed adjusted.",
        "I’m going to take the car to my mechanic tomorrow.",
        "The battery must be kept sufficiently charged in cold weather.",
        "Engine stalls on acceleration.",
        "You should repair any damage as soon as it’s seen.",
        "This problem indicates a bad connection at the battery.",
        "Let’s check the oil level.",
        "The car can only be kept in a straight line with much steering.",
        "Slow-moving traffic often causes the engine to overheat.",
        "The garage worker tested the air pressure in my tyres.",
        "I hear a knocking sound when the car starts. It gets worse when the car accelerates.",
        "The slightest pressure on the brake pedal causes the car to stop.",
        "Ask him to check the battery condition.",
        "Let’s get all worn parts replaced.",
        "You should check and adjust the brakes regularly.",
        "The bodywork of the car has become rusted.",
        "The carburettor is faulty.",
        "The clutch pedal is too stiff/hard to push down.",
        "The fan belt is in good condition.",
        "He helped me mend the puncture.",
        "The ignition system is in running condition.",
        "He’s fixing the brakes on my car.",
        "The engine stalls as it warms up.",
        "He doesn’t look after his car properly — I don’t think its engine would last long.",
        "Has your car been serviced recently?",
        "The engine runs but misses — it stops working for a very short time and then starts again.",
        "This battery frequently requires water. Do you think it’s overcharged?",
        "The engine has poor acceleration.",
        "Caked mud will damage the bodywork.",
        "I think the trouble is in the starting motor.",
        "You should put fresh oil into the crankcase.",
        "The steering wheel jerks when turning.",
        "The engine starts and then stalls after idling for some time.",
        "The car speeds up and slows down under steady throttle.",
        "The battery keeps running down.",
        "The engine won’t start quickly.",
        "Is the car in regular use?",
        "The main problem is poor idle/poor acceleration/lack of acceleration/lack of engine power.",
        "Is there any sign of leakage?",
        "I think the car needs a service.",
        "He’s taken the car to a garage for repair.",
        "The car is not accelerating smoothly at high/low speeds.",
        "The car sways on turns and on rough roads.",
        "The fan belt is overtight.",
        "I think this tyre has a slow puncture — it’s looking a bit flat.",
        "I find that too much effort is required to change gear.",
        "The main problem is poor acceleration.",
        "When the clutch pedal is pushed down, my foot feels a series of slight pedal movements.",
        "The engine backfires every now and then.",
        "Do everything, so we can prevent a repetition of this trouble.",
        "The engine has poor initial pick up.",
        "He washed the car down, and started drying it.",
        "Is there caked mud under the wheel arches? Hose it away.",
        "The headlights go out when I turn the key to start the engine.",
        "You should change the oil filter with every other oil change.",
        "The battery is low.",
        "There’s some sort of grinding noise when the car is in neutral.",
        "The engine speed varies under steady throttle.",
        "When I push down the brake pedal, the brakes squeak/chatter.",
        "The engine won’t start unless I use the choke.",
        "This is only a minor fault, and we can’t say your car has serious engine trouble.",
        "The battery case has cracked."
    ],
    " Group 2 ": [
        "The door latch is not operating correctly.",
        "He’s taken the car in for a service — he’ll only be back in the evening.",
        "The engine is sluggish when it’s accelerated.",
        "The car needs major repairs.",
        "The fan belt has worn.",
        "When I shift from neutral into first gear, the car doesn’t move forward.",
        "You must get this complaint checked immediately.",
        "This trouble must be corrected immediately.",
        "The car pulls to one side when braking.",
        "The engine stalls when it warms up.",
        "The most likely cause is a run-down battery.",
        "The engine stops running when the car is stopped.",
        "The engine runs roughly while idling.",
        "You must get the engine oil changed.",
        "I think a major servicing job is required.",
        "When I’m driving along at a steady speed, the engine power increases and then decreases.",
        "Ask them to make a quick check of the frequent trouble sources.",
        "I have to push the brake pedal too far down to apply brakes.",
        "Troubles like these come from problems in the fuel system.",
        "The braking action is slow.",
        "The top of the battery has cracked.",
        "The bonnet latch isn’t operating correctly.",
        "Is the oil level correct?",
        "I find it very hard to change gear.",
        "Is the radiator hose in good condition?",
        "I had a puncture today.",
        "The car pulls to one side during normal driving.",
        "This must be because of a problem in the carburettor.",
        "This problem may cause serious trouble to the clutch.",
        "Too much pedal pressure is required to apply brakes.",
        "The indicator light stays on all the time.",
        "The starting motor cranks slowly, but the engine won’t start.",
        "The engine runs on when the ignition is turned off.",
        "These parts seldom give trouble.",
        "There’s a lot of dirt in the bottom of the doors.",
        "The battery is in fairly good condition.",
        "The engine keeps making a funny noise.",
        "I think the engine is overheating.",
        "The battery is old — it must have worn out.",
        "There’s too little brake pedal free play.",
        "He drove the car to the garage to have it repaired.",
        "The car shakes while idling.",
        "I think a complete engine overhaul is required.",
        "That’s a front-wheel-drive car, and this is a rearwheel- drive car.",
        "Engine troubles like these can come from many causes.",
        "Remove the caps on the battery, and check the electrolyte level.",
        "If the electrolyte level is low, add water.",
        "The boot latch isn’t operating correctly.",
        "The engine runs unevenly.",
        "The car keeps weaving from one side of the road to the other.",
        "The main causes are long periods of slow speed and idling.",
        "Everything checked normal, and the mechanic couldn’t say what caused the problem.",
        "They’ve agreed to service my car tomorrow.",
        "The engine starts, speeds up and then dies.",
        "My car tyre had a puncture today.",
        "These problems will cause excessive oil consumption.",
        "Some sort of noise is heard when the clutch is engaged.",
        "If the electrolyte level is very low, the battery can be damaged.",
        "I can hear metallic knocking from the engine when the car accelerates.",
        "Wash headlamps and sidelamps, and dry them.",
        "The headlights are not very bright.",
        "The car is leaking oil.",
        "The drive belts are in poor condition.",
        "The clutch pedal is very stiff.",
        "The engine misfires at high speeds.",
        "When I press the accelerator down, there’s little or no speed increase.",
        "The headlights don’t work properly.",
        "Engine troubles like these can increase fuel consumption.",
        "The mechanic says there’s about Rs. 5000 worth of repairs to be done.",
        "The battery will be ruined if it’s severely overcharged.",
        "The engine doesn’t turn at all.",
        "The engine turns slowly, but doesn’t start.",
        "The petrol consumption has gone up. The carburettor could be faulty.",
        "There’s too much play in the steering system.",
        "I have to add coolant frequently. It must be leaking.",
        "I hear some sort of noise when I release the clutch pedal.",
        "Ask them to inspect the tyres — they should check tread wear too.",
        "Try starting now.",
        "The battery was at fault.",
        "The indicator light is erratic.",
        "The top of the battery is covered with dirt and grime.",
        "Ask the mechanic to replace all the worn parts.",
        "The engine misfires at high speeds.",
        "Look, the bodywork has split here.",
        "They tried to jump-start the engine with a booster battery.",
        "Oil is leaking out of the car.",
        "My car has been having clutch troubles for some time now.",
        "The car jerks while moving forward.",
        "The engine stops running when the car is moving.",
        "The brakes remain applied even when the pedal is not pressed.",
        "The horn doesn’t work properly.",
        "This problem can result from driving habits.",
        "Clean off the corrosion around the battery terminals.",
        "The headlights are dim, and not bright.",
        "The engine won’t start easily.",
        "The car shows a tendency to veer away from a straight path.",
        "There’s a leak in the car radiator.",
        "He managed to repair the car on his own.",
        "Do you have this problem even at normal speeds?",
        "The tyre looked okay from outside, but it had internal damage.",
        "I started the engine, and it ran quietly for some time. Then it cut out before the car could move forward.",
        "The braking action is poor.",
        "The brake pedal has to be pushed down with too much force.",
        "The engine is using too much oil.",
        "I kept on trying to start the engine until the battery ran down.",
        "The engine falters and stops when it’s hot.",
        "You must take extreme care while driving at night.",
        "The sun blinded me for a moment, and the car ran into a lamp-post.",
        "There is a dent in the bodywork here. Why don’t you get it repaired?",
        "The driver has run the battery down, trying to start.",
        "The engine warms up very slowly.",
        "I hear some sort of noise when I push down on the clutch pedal.",
        "The brake pedal can be moved to strike the floorboard, and no brake action is produced.",
        "When I turn on the ignition key, the engine cranks, but does not start.",
        "The car vibrates when I push the clutch pedal down.",
        "My car is at the garage, getting fixed.",
        "This problem can be due to many causes.",
        "What’s the state of charge of the battery? Is it fully charged?",
        "The battery is only three-fourths charged.",
        "The battery is fully discharged. It must be recharged.",
        "The engine fires, but fails to keep running.",
        "The engine runs hesitantly and then stops.",
        "This tyre has a bulge — it should be replaced.",
        "I don’t think this tyre is safe for further use.",
        "My car seems to be leaking oil.",
        "I can’t change into second gear.",
        "The brake pedal goes to the floor.",
        "Do you smell anything unusual — fumes or burning?",
        "This must be because the carburettor is at fault.",
        "On the way I developed a flat, and I didn’t have a pump with me.",
        "I think the exhaust pipe/exhaust has to be replaced.",
        "This is a very common complaint.",
        "Some condition in the engine or the fuel system or the ignition system must be preventing normal starting.",
        "I have to take my car in for its 10,000 kilometre service tomorrow.",
        "The silencer pipe is badly rusted."
    ]
}