{
    " Group 1 ": [
        "There was a heavy fall of rain last night.",
        "There’s been no rain, and the weather has been dry for some time now.",
        "What thundery weather!",
        "Their city has a warm, dry climate.",
        "Is it raining now?",
        "He wore a muffler/woollen scarf around his neck to keep warm.",
        "Rocks weather till they’re worn away.",
        "A spot of rain fell on my head.",
        "There’s a chill in the air this morning.",
        "The temperature had fallen below freezing point, and there was frost on the ground.",
        "It’s started to shower.",
        "A dark sky is a sign that it’s going to rain.",
        "The past week was very cold.",
        "It began to snow hard.",
        "The weather was bad.",
        "Many people like that place because of its calm weather.",
        "I don’t think the weather is going to get better for some days.",
        "Look at the vapours rising from the lake.",
        "It was a miserable, wet day.",
        "How’s the weather? Is it raining?",
        "It was a clear night, and we could see lots of stars.",
        "Ask the children to come in from the wet.",
        "The weather forecast warned of chill winds and rain.",
        "There’s more cloud today than yesterday.",
        "What sticky weather! I wish it would rain!",
        "We’ve had a lot of bad weather lately.",
        "By evening, the rain began to ease off.",
        "The hills are covered in snow.",
        "It’s bitterly cold outside.",
        "She put warm clothes on and came out.",
        "The weather is icy today — you’d better wrap up warm.",
        "It’s pouring — we can’t go out.",
        "It was quite sunny and not raining when I left.",
        "It’s raining a little outside.",
        "The windows have misted up, and I can’t see out.",
        "His hands were blue with cold.",
        "We’ve had one of the heaviest rainfalls in years.",
        "The rains have failed again this year.",
        "And then, there was a great flash of lightning.",
        "It was a cool evening.",
        "We had very little rain this year.",
        "Let’s not go for a swim now — let the sun take the chill off the water.",
        "It’s raining very hard.",
        "The wind has worn the rocks away.",
        "In Delhi, it’s very hot in summer, and very cold in winter.",
        "The windows are covered with frost.",
        "I like cold weather.",
        "Shut that door — there’s quite a draught.",
        "If the weather clears up, we’ll go for a walk.",
        "Steam formed on the insides of the kitchen window.",
        "The wind blew again.",
        "It began to rain hard, and they got wet.",
        "It rained for some time, but it turned out fine again.",
        "There’s a lot of damp in the air.",
        "The rain poured down all day long.",
        "This is the worst weather in years.",
        "It was pouring with rain.",
        "It was a cloudy day.",
        "It was a sunny day with clear blue skies.",
        "It’s a nice day, isn’t it? Bright and warm.",
        "Let’s go and sit in the sunshine for some time.",
        "The weather hasn’t been calm, but very windy, lately.",
        "The climate there is very hot and damp.",
        "I wonder what the weather is going to be like tomorrow.",
        "The sky hasn’t cleared yet after the thunderstorm.",
        "His room is well ventilated.",
        "It was a perfect summer’s day.",
        "The annual rainfall here is about 6 inches.",
        "They left in the drizzling rain.",
        "The well has gone dry.",
        "The climate of this place is good for growing coffee.",
        "Does it rain very much in that area?",
        "It’s very cold today — you’d better wrap up warm.",
        "The flight had to be cancelled — adverse weather conditions!",
        "Shut the windows, will you? There’s a cold draught in here.",
        "There were strong winds last night.",
        "You’re soaked! Didn’t you have an umbrella with you?",
        "It’s cooler under the trees, isn’t it?",
        "It rained the whole day.",
        "I hope it clears up by evening.",
        "The mountaintop was covered in mist.",
        "Last year, we had a long spell of dry weather, and it affected agricultural production.",
        "It’s drizzling.",
        "The skies are clear today.",
        "It’s the coolest day in a long time.",
        "The steam would make the walls moist.",
        "It was a hot, sweaty day.",
        "What a foul day it is!",
        "It was a hot, sticky day.",
        "We had very little rain this month, and the air is dry.",
        "The sky is cloudy today.",
        "We had light rain all evening.",
        "Is the weather different in your place?",
        "There was a heavy fall of snow there last night.",
        "It was a sunny day.",
        "Come out of the cold — come into the warm.",
        "There was a flash of lightning, and then a loud peal of thunder.",
        "That room is badly ventilated.",
        "It rained steadily throughout the night.",
        "On the way, I was caught in a shower.",
        "The day was overcast and humid.",
        "It’s wet weather.",
        "Last night, there were gusts of wind of upto 50 miles per hour.",
        "He expected it to be hot in Delhi, and it was.",
        "Today, the temperature has dropped to freezing point.",
        "We go out in all weathers.",
        "It rains a lot in June in our area.",
        "There were high winds last week.",
        "There’s going to be a storm, I think. Look at those black clouds.",
        "It’s been a mild winter this year.",
        "We can’t go now — it’s raining hard.",
        "Look at the condensation on the windows.",
        "It’s a lovely day, isn’t it?",
        "It has started to drizzle.",
        "The car windows were/had fogged up, and I couldn’t see a thing clearly.",
        "The rain has wet him through.",
        "It’s freezing cold in here — wrap this shawl around the baby, and keep it warm.",
        "This is the foulest/coldest/warmest/worst day I can remember.",
        "At last, the dry season is over.",
        "A bright/ clear blue sky is a sign that it’s not going to rain.",
        "It’s very cold — wrap a scarf round your face.",
        "The water turned into ice.",
        "The weather was warm and sunny.",
        "Has he adjusted himself to the climate there?",
        "It started raining, and she took shelter under my umbrella.",
        "The steam condensed and formed drops of water.",
        "They had to spend the night in the bitter cold."
    ],
    " Group 2 ": [
        "What showery weather!",
        "We’ll go out when it stops raining.",
        "It’s a wet day, and the rain isn’t going to let up now.",
        "The fog lifted by breakfast time.",
        "Don’t go out without a coat — the cold weather will chill you to the bone.",
        "I like crisp winter days.",
        "The sky turned black when the storm came near.",
        "It’s starting to drizzle.",
        "What’s the weather like outside?",
        "I think there will be strong winds tonight.",
        "I hate stormy/hot/wet weather.",
        "The weather grew harsh and chilly.",
        "The storm destroyed our crops.",
        "The ground shone with dew in the morning sunlight.",
        "It’s pouring today.",
        "We’ll go for a picnic if it’s fine.",
        "What cloudy/ damp/sticky weather this is!",
        "I’m wet through.",
        "It had stopped raining, and the sun was breaking through.",
        "The weather has been rotten all week.",
        "It was bitter outside, and I decided to stay indoors.",
        "Last night, we had a cloudless sky.",
        "What depressing weather we’re having!",
        "Do you like the weather in this part of the country?",
        "Frost has killed several of the young plants.",
        "I’m freezing cold — get me a sweater, will you?",
        "The weather is fine/nice today.",
        "He shook the rain off his raincoat.",
        "The water evaporated in the heat of the sun.",
        "The sun will evaporate the water.",
        "The sky clouded over, and it started to thunder.",
        "The rains come in June in this area.",
        "The weather forecast is for overcast skies.",
        "The old tree was blown down in a gale.",
        "It was a cold day, and there was an awful draught.",
        "The lake has frozen up.",
        "Look at that band of thick cloud spreading from the west.",
        "There’s a bit of blue sky between the clouds.",
        "Is it raining hard?",
        "Do you like warm weather?",
        "Delhi has a climate with extremes of temperature.",
        "The thick mist clouded the mountaintop.",
        "Will the rain ever let up?",
        "What a pouring wet day!",
        "A bitter wind started blowing, and I got cold, and I went inside into the warm.",
        "It’s colder/cooler/hotter/warmer than yesterday, isn’t it?",
        "The rain has dampened the ground.",
        "It was fine in the morning, but clouded over later on.",
        "The weather last month was bleak and unpleasant.",
        "We had a mild winter last year.",
        "Does it ever snow in your area?",
        "Today’s a cloudless day — very bright and sunny.",
        "Sun, wind and other weather conditions make the paint on walls, doors and windows weather.",
        "There was a hard frost last night.",
        "There was frequent thunder and lightning.",
        "I’m hot and sweaty.",
        "This is the closest weather for a long time.",
        "His glasses steamed up when he came in from the cold, and he couldn’t see a thing.",
        "The water evaporated in the sunshine.",
        "The monsoon is late this year.",
        "You’re so cold — go and sit by the fire.",
        "There’s hardly a breath of air this morning.",
        "The fog took a long time to clear.",
        "Isn’t it warm inside?",
        "I think we can expect sunny skies for the next two days.",
        "The weather was windy and unpleasant.",
        "I think it’s going to rain.",
        "The rocks are shaped by sun, wind and rain.",
        "They have good weather there in the summer.",
        "The climate there is very harsh and unpredictable.",
        "It’s freezing tonight.",
        "It was a bleak winter’s day.",
        "This is the second day it’s been overcast.",
        "The sky’s clouded over — I think it’s going to rain.",
        "The rain’s just pouring down.",
        "The drizzle has now stopped.",
        "Today, it’s a little too warm for me.",
        "Why didn’t you take the raincoat with you?",
        "You’re drenched to the skin.",
        "What cold/hot/wet/windy/overcast weather this is!",
        "There was thick fog last night, and it must have made driving conditions dangerous.",
        "We’ve had a lot of cloudy weather lately.",
        "Rock crumbles when it weathers.",
        "The grass was covered with frost in the early morning.",
        "I hate the hot summer nights.",
        "How do they live in this heat there?",
        "The rain remained steady for some time.",
        "Soon the winds dropped to a gentle breeze.",
        "It wasn’t just a rain — it was a real cloudburst.",
        "It’s raining again.",
        "They took shelter from the rain under a tree.",
        "It’s blowing hard tonight.",
        "It was a foggy morning.",
        "The sky is completely covered with cloud.",
        "The storm has done severe damage.",
        "The skies remained sunny today.",
        "Look at the dew on the leaves.",
        "I hadn’t an umbrella, and I was caught in a sudden downpour.",
        "What a windy day!",
        "We’ll go for an outing tomorrow, weather permitting.",
        "It’s freezing in this room.",
        "A strong breeze started to blow.",
        "It was nice in the morning, but it’s raining now.",
        "The steam fogged (up) my glasses.",
        "This happened on a winter’s night.",
        "Has she adjusted to the climate there yet?",
        "The weather is good today.",
        "I wasn’t wearing a sweater, and I was cold.",
        "I’m very cold today.",
        "We had heavy rain all day.",
        "The morning was overcast, but it didn’t rain.",
        "It was a calm, cloudless day."
    ],
    " Group 3 ": [
        "The rain stopped, and the sun came out.",
        "There was a fog warning on the radio.",
        "It was a warm, sunny day with no wind.",
        "You’d better wear a sweater over your shirt.",
        "All the trains have been cancelled because of bad weather.",
        "The radio has given a frost warning.",
        "The roads will be icy tomorrow morning.",
        "When does the monsoon season begin?",
        "The weather is very cold today — do the zip up on your jacket.",
        "The crops need rain.",
        "It was several hours before the rain began to ease up.",
        "There was quite a downpour last evening.",
        "The weather was overcast for two days.",
        "There’s hardly a breath of wind today.",
        "The fields were covered in mist.",
        "You can’t count on good weather in June.",
        "This is better weather than last January.",
        "The weather was stormy and unpleasant.",
        "It was a clear night, and the sky was full of stars.",
        "It was dull/cloudy and raining.",
        "How’s the weather today?",
        "The day was windless, and clouds were not moving.",
        "What was the weather like on your holiday?",
        "What a fine day it is today!",
        "That place is famous for its mild climate.",
        "My glasses are all fogged up.",
        "The weather was bleak, and I felt very cold.",
        "It hailed last night.",
        "Rain fell heavily all day.",
        "The sun certainly feels good after all that bad weather.",
        "I could hear thunder over the hills.",
        "Suddenly rain started lashing against the windows.",
        "It was a dull day, and not sunny at all.",
        "The weather was stormy, and the plane couldn’t take off.",
        "They often have bad fogs during winter.",
        "The weather was cold, dull and unpleasant.",
        "The cat went and sat in a patch of sunlight.",
        "A late frost will damage all these young shoots on the trees.",
        "What’s the average summer/winter temperature here?",
        "Is it cold/chilly outside?",
        "How long does the dry season last?",
        "Don’t go out in the rain without a coat.",
        "The sky was calm/blue and cloudless.",
        "The wind soon died down.",
        "It was a real deluge, and everybody got very wet.",
        "It was a hot summer day.",
        "It suddenly got nippy/chilly in the evening, and he put his sweater on.",
        "The wind blew his hat off.",
        "Because of the mist, we couldn’t see very far.",
        "The sky was overcast, and there was not much light.",
        "There are black clouds, and it’s going to rain.",
        "The weather is likely to remain clear for a few more days.",
        "Today it’s quite cold and damp.",
        "The trees gave the house shelter from the wind.",
        "It was a windless day.",
        "There’s been a long spell of dry/wet/cold weather.",
        "I don’t think the weather is going to be fair for our journey.",
        "What foul weather! It’s been stormy for weeks.",
        "The room became very hot, and the windows became covered with mist.",
        "The weather there is very pleasant — it’s neither too cold nor too hot.",
        "It began to hail.",
        "Let’s get out of the cold, and get warm — we’ll go inside.",
        "I’m freezing.",
        "It was a stormy night.",
        "I feel a bit chilly — let’s go inside.",
        "It was very cool yesterday, but it’s very hot today.",
        "It was the foggiest night of the year.",
        "I got caught in the shower — I hadn’t an umbrella.",
        "The air is cool and fresh.",
        "It’s snowing — I think I’ll stay in today.",
        "There, the temperature drops below freezing during winter.",
        "We’ve been having clear, cloudless, weather for some time now.",
        "This heat is killing me.",
        "The weather isn’t very good today.",
        "Come in out of the rain.",
        "Wear a sweater or you’ll feel cold.",
        "The storm raged.",
        "It was a hot day and very humid.",
        "It rained several times today.",
        "The mountains were hazy in the distance.",
        "I got soaked standing out in the rain.",
        "This kind of weather is good for the farmers.",
        "The wind was very strong, and they couldn’t sail to windward.",
        "It was a dull and cloudy day.",
        "What a nice bright day!",
        "This year, we had a long dry/sunny spell.",
        "Winters are usually rather mild in our area.",
        "We can’t go out — it’s too wet.",
        "The weather is much hotter than usual this year.",
        "Use this raincoat — it’ll protect you from the wet.",
        "Look at the flag flapping in the wind.",
        "He always wears a jersey in cold weather.",
        "Things were difficult to see because of the mist.",
        "She didn’t have any woollen clothes on, and she was shivering with cold.",
        "Look at those children playing in the sunshine.",
        "The wind is blowing hard.",
        "It’s been cold and wet for weeks.",
        "The summers are generally very wet here.",
        "What was the temperature like last night?",
        "It was very cool and pleasant in there.",
        "I feel rather cold.",
        "Ask him to wear warm clothes. It’s quite windy and cold.",
        "We have cold winters and warm, dry summers here.",
        "The wind has lessened in force.",
        "It was too hot, but he still went for a walk.",
        "It’s freezing today.",
        "He doesn’t like living in a tropical climate.",
        "It rains a great deal in this season.",
        "There was a slight breeze, and it moved the leaves of the trees.",
        "That was a fine, clear and calm day, with no wind.",
        "We had good weather generally last month.",
        "It was a long hot summer.",
        "I hate to go out in the wet.",
        "The rains came in June.",
        "It’s sweltering today.",
        "It’s still raining.",
        "It’s hailing.",
        "There’s a chill in the air.",
        "I like going for a walk in the cold.",
        "And then, there was another flash of lightning.",
        "Don’t expect it to rain — this is the dry season.",
        "There was a storm last night.",
        "It’s been raining all week — what miserable weather!",
        "She wrapped the blanket round her for warmth.",
        "She shivered in the cold.",
        "The snow melted in the sun.",
        "It was a bright, sunny day.",
        "I like this kind of weather.",
        "When does the rainy season start?",
        "The storm is weakening.",
        "The weather was wet, and I decided to stay indoors."
    ]
}